AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t METALO     : 4;            /*!< [3..0] Meta data about this sample which represents the lower
                                                     4 bits of the PGA gain code                                               */
      __IOM uint32_t LGDATA     : 12;           /*!< [15..4] Low-gain PGA sample data                                          */
      __IOM uint32_t METAHI     : 3;            /*!< [18..16] Meta data about this sample which represents the upper
                                                     3 bits of the PGA gain code                                               */
      __IOM uint32_t MIC        : 1;            /*!< [19..19] Which audio channel this data is from encoded as int(slot
                                                     number/2). In other words, this is 1 if data is from slots
                                                     2 or 3, or 0 if from slots 0 or 1.                                        */
      __IOM uint32_t HGDATA     : 12;           /*!< [31..20] High-gain PGA sample data                                        */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< (@ 0x0000003C) This is a pop-on-read mirrored copy of the ADCFIFO
                                                                    register with the only difference being
                                                                    that reading this register will result in
                                                                    a simultaneous FIFO POP which is also achieved
                                                                    by writing to the ADCFIFO Register. Note:
                                                                    The DFIFORDEN bit must be set in the CFG
                                                                    register for the the destructive read to
                                                                    be enabled.                                                */

    struct {
      __IOM uint32_t METALOPR   : 4;            /*!< [3..0] Meta data about this sample which represents the lower
                                                     4 bits of the PGA gain code                                               */
      __IOM uint32_t LGDATAPR   : 12;           /*!< [15..4] Low-gain PGA sample data                                          */
      __IOM uint32_t METAHIPR   : 3;            /*!< [18..16] Meta data about this sample which represents the upper
                                                     3 bits of the PGA gain code                                               */
      __IOM uint32_t MICPR      : 1;            /*!< [19..19] Which audio channel this data is from encoded as int(slot
                                                     number/2). In other words, this is 1 if data is from slots
                                                     2 or 3, or 0 if from slots 0 or 1.                                        */
      __IOM uint32_t HGDATAPR   : 12;           /*!< [31..20] High-gain PGA sample data                                        */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< (@ 0x00000040) Configures the clock, maximum count, and enables
                                                                    the ADC internal repeating trigger timer.                  */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< [9..0] Trigger counter count max, used as initial condition
                                                     to trigger. Also used repeatedly each time counter reaches
                                                     it to restart trigger timer at zero. To update this value,
                                                     first disable the INTTRIGTIMER by setting TIMEREN to DIS,
                                                     change TIMERMAX, and then reenable it INTTRIGTIMER by setting
                                                     TIMEREN to EN again.                                                      */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< [18..16] Configure number of divide-by-2 of clock source as
                                                     input to the trigger counter up to divide-by-32. To update
                                                     this value, first disable the INTTRIGTIMER by setting TIMEREN
                                                     to DIS, change CLKDIV, and then reenable itthe INTTRIGTIMER
                                                     by setting TIMEREN to EN again.                                           */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< [31..31] ADC-internal trigger timer enable.                               */
    } INTTRIGTIMER_b;
  } ;

  union {
    __IOM uint32_t FIFOSTAT;                    /*!< (@ 0x00000044) This register contains status of the data FIFO.            */

    struct {
      __IOM uint32_t FIFOCNT    : 8;            /*!< [7..0] Number of valid entries in the ADC FIFO.                           */
            uint32_t            : 24;
    } FIFOSTAT_b;
  } ;

  union {
    __IOM uint32_t DATAOFFSET;                  /*!< (@ 0x00000048) Sample offset value                                        */

    struct {
      __IOM uint32_t OFFSET     : 13;           /*!< [12..0] Add this signed offset to data before being written
                                                     to the FIFO. This enables the user to convert unsigned
                                                     samples to signed or remove a DC offset on the samples.
                                                     Note that this does NOT affect the comparator limits, which
                                                     still operate on original unsigned samples.                               */
            uint32_t            : 19;
    } DATAOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED[5];

  union {
    __IOM uint32_t ZXCFG;                       /*!< (@ 0x00000060) Configures the zero crossing comparator                    */

