AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
            uint32_t            : 24;
      __IOM uint32_t HFRC2READY : 1;            /*!< [24..24] HFRC2 clock is ready (goes high approx 5us after HFRC2
                                                     is powered up)                                                            */
      __IOM uint32_t PXTALCLKEN : 1;            /*!< [25..25] At least one peripheral clock relying on XTAL is on              */
      __IOM uint32_t PHFRCCLKEN : 1;            /*!< [26..26] At least one peripheral clock relying on HFRC is on              */
      __IOM uint32_t HFADJEN    : 1;            /*!< [27..27] HFADJ circuit is enabled                                         */
      __IOM uint32_t OSEL       : 1;            /*!< [28..28] RTC uses XT or LFRC                                              */
      __IOM uint32_t XTALCLKOUTEN : 1;          /*!< [29..29] XTAL output clock is on                                          */
      __IOM uint32_t HFRCCLKEN  : 1;            /*!< [30..30] HFRC oscillator clock is on                                      */
      __IOM uint32_t HFRC2CLKEN : 1;            /*!< [31..31] HFRC2 oscillator clock is on                                     */
    } CLOCKENSTAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN2STAT;                /*!< (@ 0x00000034) This is a continuation of the clock enable status.         */

    struct {
      __IOM uint32_t TRACECLKEN : 1;            /*!< [0..0] Trace clock is on                                                  */
      __IOM uint32_t ADCCLKEN   : 1;            /*!< [1..1] ADC clock is on                                                    */
      __IOM uint32_t APBACTIVITYCLKEN : 1;      /*!< [2..2] APB clock is on in the Activity power domain                       */
      __IOM uint32_t APBAOHCLKEN : 1;           /*!< [3..3] APB clock is on in the AOH power domain                            */
      __IOM uint32_t APBAOLCLKEN : 1;           /*!< [4..4] APB clock is on in the AOL power domain                            */
      __IOM uint32_t APBAPBCLKEN : 1;           /*!< [5..5] APB clock is on in the APB power domain                            */
      __IOM uint32_t APBAUDCLKEN : 1;           /*!< [6..6] APB clock is on in the AUD power domain                            */
      __IOM uint32_t APBCRYPTOCLKEN : 1;        /*!< [7..7] APB clock is on in the Crypto power domain                         */
      __IOM uint32_t APBDISPCLKEN : 1;          /*!< [8..8] APB clock is on in the DISP power domain                           */
      __IOM uint32_t APBDISPPHYCLKEN : 1;       /*!< [9..9] APB clock is on in the DISP PHY power domain                       */
      __IOM uint32_t APBGFXCLKEN : 1;           /*!< [10..10] APB clock is on in the GFX power domain                          */
      __IOM uint32_t APBHCPACLKEN : 1;          /*!< [11..11] APB clock is on in the HCP A power domain                        */
      __IOM uint32_t APBHCPBCLKEN : 1;          /*!< [12..12] APB clock is on in the HCP B power domain                        */
      __IOM uint32_t APBHCPCCLKEN : 1;          /*!< [13..13] APB clock is on in the HCP C power domain                        */
      __IOM uint32_t APBIOSCLKEN : 1;           /*!< [14..14] APB clock is on in the IOS power domain                          */
      __IOM uint32_t APBMSPI0CLKEN : 1;         /*!< [15..15] APB clock is on in the MSPI0 power domain                        */
      __IOM uint32_t APBMSPI1CLKEN : 1;         /*!< [16..16] APB clock is on in the MSPI1 power domain                        */
      __IOM uint32_t APBMSPI2CLKEN : 1;         /*!< [17..17] APB clock is on in the MSPI2 power domain                        */
      __IOM uint32_t APBMSPI3CLKEN : 1;         /*!< [18..18] APB clock is on in the MSPI3 power domain                        */
      __IOM uint32_t APBSDIO0CLKEN : 1;         /*!< [19..19] APB clock is on in the SDOI0 power domain                        */
      __IOM uint32_t APBSDIO1CLKEN : 1;         /*!< [20..20] APB clock is on in the SDIO1 power domain                        */
      __IOM uint32_t APBUSBCLKEN : 1;           /*!< [21..21] APB clock is on in the USB power domain                          */
      __IOM uint32_t AUDADCCLKEN : 1;           /*!< [22..22] AUD ADC clock is on                                              */
      __IOM uint32_t DISPCLKEN  : 1;            /*!< [23..23] DISP clock is on                                                 */
      __IOM uint32_t DPHYPLLCLKEN : 1;          /*!< [24..24] DPHY PLL clock is on                                             */
      __IOM uint32_t DSPI2S0CLKEN : 1;          /*!< [25..25] DISP I2S0 clock is on                                            */
      __IOM uint32_t DSPI2S0REFCLKEN : 1;       /*!< [26..26] DISP I2S0 reference clock is on                                  */
      __IOM uint32_t DSPI2S1CLKEN : 1;          /*!< [27..27] DSP I2S1 clock is on                                             */
      __IOM uint32_t DSPI2S1REFCLKEN : 1;       /*!< [28..28] DSP I2S1 reference clock is on                                   */
      __IOM uint32_t DSPPDMCLKEN : 1;           /*!< [29..29] DSP PDM clock is on                                              */
      __IOM uint32_t GFXCLKEN   : 1;            /*!< [30..30] GFX core clock is on                                             */
      __IOM uint32_t IOM0CLKEN  : 1;            /*!< [31..31] IOM 0 clock is on                                                */
    } CLOCKEN2STAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN3STAT;                /*!< (@ 0x00000038) This is a continuation of the clock enable status.         */

    struct {
      __IOM uint32_t IOM1CLKEN  : 1;            /*!< [0..0] IOM 1 clock is on                                                  */
      __IOM uint32_t IOM2CLKEN  : 1;            /*!< [1..1] IOM 2 clock is on                                                  */
      __IOM uint32_t IOM3CLKEN  : 1;            /*!< [2..2] IOM 3 clock is on                                                  */
      __IOM uint32_t IOM4CLKEN  : 1;            /*!< [3..3] IOM 4 clock is on                                                  */
      __IOM uint32_t IOM5CLKEN  : 1;            /*!< [4..4] IOM 5 clock is on                                                  */
      __IOM uint32_t IOM6CLKEN  : 1;            /*!< [5..5] IOM 6 clock is on                                                  */
      __IOM uint32_t IOM7CLKEN  : 1;            /*!< [6..6] IOM 7 clock is on                                                  */
      __IOM uint32_t MSPI0CLKEN : 1;            /*!< [7..7] MSPI 0 clock is on                                                 */
      __IOM uint32_t MSPI1CLKEN : 1;            /*!< [8..8] MSPI 1 clock is on                                                 */
      __IOM uint32_t MSPI2CLKEN : 1;            /*!< [9..9] MSPI 2 clock is on                                                 */
      __IOM uint32_t MSPI3CLKEN : 1;            /*!< [10..10] MSPI 3 clock is on                                               */
      __IOM uint32_t OTPXTLCLKEN : 1;           /*!< [11..11] OTP XTL clock is on                                              */
      __IOM uint32_t RSTGENCLKEN : 1;           /*!< [12..12] Reset generator POR clock is on                                  */
      __IOM uint32_t RSTGENPOSCLKEN : 1;        /*!< [13..13] Reset generator POR clock is on                                  */
      __IOM uint32_t RTCCLKEN   : 1;            /*!< [14..14] Real Time Clock clock is on                                      */
      __IOM uint32_t SDIO0CLKEN : 1;            /*!< [15..15] SDIO 0 clock is on                                               */
      __IOM uint32_t SDIO1CLKEN : 1;            /*!< [16..16] SDIO 1 clock is on                                               */
      __IOM uint32_t UART0CLKEN : 1;            /*!< [17..17] UART 0 clock is on                                               */
      __IOM uint32_t UART1CLKEN : 1;            /*!< [18..18] UART 1 clock is on                                               */
      __IOM uint32_t UART2CLKEN : 1;            /*!< [19..19] UART 2 clock is on                                               */
      __IOM uint32_t UART3CLKEN : 1;            /*!< [20..20] UART 3 clock is on                                               */
      __IOM uint32_t USBREFCLKEN : 1;           /*!< [21..21] USB reference clock is on                                        */
      __IOM uint32_t WDTCLKEN   : 1;            /*!< [22..22] WDT clock is on                                                  */
      __IOM uint32_t XTALENABLED : 1;           /*!< [23..23] XTAL oscillator enable                                           */
            uint32_t            : 8;
    } CLOCKEN3STAT_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t MISC;                        /*!< (@ 0x00000044) This register controls a 'safe' mode for burst,
                                                                    which disables the clock when burst transition
                                                                    is happening. It also includes a register
                                                                    to force the HFRC during deep sleep. It
                                                                    is mainly used for debug and testing.                      */

