AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t HF2ADJTRIMOUT : 11;        /*!< [10..0] HF2ADJ trimming output                                            */
            uint32_t            : 21;
    } HF2VAL_b;
  } ;
  __IM  uint32_t  RESERVED4[8];

  union {
    __IOM uint32_t LFRCCTRL;                    /*!< (@ 0x00000078) LFRC control                                               */

    struct {
      __IOM uint32_t LFRCOUT    : 1;            /*!< [0..0] Disable LFRC output                                                */
      __IOM uint32_t LFRCPWD    : 1;            /*!< [1..1] Power down LFRC                                                    */
            uint32_t            : 30;
    } LFRCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[2];

  union {
    __IOM uint32_t DISPCLKCTRL;                 /*!< (@ 0x00000084) Provides ability to select the PLL reference
                                                                    clock, and derivative of the display clock                 */

    struct {
      __IOM uint32_t PLLCLKSEL  : 4;            /*!< [3..0] Selection for PLL reference clock.                                 */
      __IOM uint32_t PLLCLKEN   : 1;            /*!< [4..4] Enable for the PLL clock through clkgen                            */
      __IOM uint32_t DISPCLKSEL : 3;            /*!< [7..5] Selection for PLL reference clock.                                 */
      __IOM uint32_t DCCLKEN    : 1;            /*!< [8..8] Enable for the PLL clock through clkgen                            */
      __IOM uint32_t DBICLKSEL  : 2;            /*!< [10..9] selection for DBI_CLK                                             */
      __IOM uint32_t DBICLKDIV2EN : 1;          /*!< [11..11] Enable for DBI CLK divider, 0x1: DBICLK/2, 0x0: bypass           */
            uint32_t            : 20;
    } DISPCLKCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKGENSPARES;                /*!< (@ 0x00000088) CLKGEN Spare Regs                                          */

    struct {
      __IOM uint32_t CLKGENSPARES : 32;         /*!< [31..0] Placeholer spare registes that can be used as needed
                                                     for future use                                                            */
    } CLKGENSPARES_b;
  } ;

  union {
    __IOM uint32_t HFRCIDLECOUNTERS;            /*!< (@ 0x0000008C) Provides SW controlled # idle cycles before powering
                                                                    down HFRC, HFRC2., core clock enable(s)                    */

    struct {
      __IOM uint32_t HFRCPWRDOWNDELAY : 6;      /*!< [5..0] Idle counter for HFRC POWER DOWN DELAY                             */
            uint32_t            : 2;
      __IOM uint32_t HFRCCLKREQDELAY : 6;       /*!< [13..8] Idle counter for HFRC CLK REQ DELAY                               */
            uint32_t            : 2;
      __IOM uint32_t HFRC2PWRDOWNDELAY : 6;     /*!< [21..16] Idle counter for HFRC2 POWER DOWN DELAY                          */
            uint32_t            : 2;
      __IOM uint32_t HFRC2CLKREQDELAY : 6;      /*!< [29..24] Enable for the PLL clock through clkgen                          */
            uint32_t            : 1;
      __IOM uint32_t UPDATEENABLE : 1;          /*!< [31..31] usage : Clear UPDATEENABLE or 1'b0; Update other bits
                                                     fields of this register. Set this register to 1'b1 for
                                                     HW to update.                                                             */
    } HFRCIDLECOUNTERS_b;
  } ;
  __IM  uint32_t  RESERVED6[32];

  union {
    __IOM uint32_t MSPIIOCLKCTRL;               /*!< (@ 0x00000110) Provides ability to select the MSPI clock, and
                                                                    derivative of the MSPI clock                               */

    struct {
      __IOM uint32_t MSPI0IOCLKEN : 1;          /*!< [0..0] Enable for the MSPI0 io clock through clkgen                       */
      __IOM uint32_t MSPI0IOCLKSEL : 4;         /*!< [4..1] selection for MSPI0 io clock                                       */
      __IOM uint32_t MSPI1IOCLKEN : 1;          /*!< [5..5] Enable for the MSPI1 io clock through clkgen                       */
      __IOM uint32_t MSPI1IOCLKSEL : 4;         /*!< [9..6] selection for MSPI1 io clock                                       */
      __IOM uint32_t MSPI2IOCLKEN : 1;          /*!< [10..10] Enable for the MSPI2 io clock through clkgen                     */
      __IOM uint32_t MSPI2IOCLKSEL : 4;         /*!< [14..11] selection for MSPI2 io clock                                     */
      __IOM uint32_t MSPI3IOCLKEN : 1;          /*!< [15..15] Enable for the MSPI3 io clock through clkgen                     */
      __IOM uint32_t MSPI3IOCLKSEL : 4;         /*!< [19..16] selection for MSPI3 io clock                                     */
            uint32_t            : 12;
    } MSPIIOCLKCTRL_b;
  } ;
  __IM  uint32_t  RESERVED7[3];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< (@ 0x00000120) Provides ability to select and enable/force the
                                                                    GFX and MCU clocks                                         */

    struct {
      __IOM uint32_t GFXCORECLKEN : 1;          /*!< [0..0] Enable for the GFX CORE clock through clkgen                       */
      __IOM uint32_t GFXCORECLKSEL : 2;         /*!< [2..1] selection for GFX CORE clock                                       */
      __IOM uint32_t STCLKFORCEON : 1;          /*!< [3..3] Force the ST clock to be always on                                 */
      __IOM uint32_t PMUCLKFORCEON : 1;         /*!< [4..4] Force the PMU clock to be always on (unused)                       */
      __IOM uint32_t DBGCLKFORCEON : 1;         /*!< [5..5] Force the DBG clock to be always on (unused)                       */
      __IOM uint32_t IWICCLKFORCEON : 1;        /*!< [6..6] Force the IWIC clock to be always on (unused)                      */
      __IOM uint32_t MCUCLKFORCEON : 1;         /*!< [7..7] Force the MCU clock to be always on (unused)                       */
      __IOM uint32_t DISPCTRLCLKEN : 1;         /*!< [8..8] Enable the 96MHz display controller clock                          */
            uint32_t            : 23;
    } CLKCTRL_b;
  } ;
} CLKGEN_Type;                                  /*!< Size = 292 (0x124)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded security and cryptographic services (CRYPTO)
  */

typedef struct {                                /*!< (@ 0x400C0000) CRYPTO Structure                                           */

  union {
    __IOM uint32_t MEMORYMAP0;                  /*!< (@ 0x00000000) This register maps the virtual register R0 to
                                                                    a physical address in memory.                              */

