AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t DIVIDEVALUE : 6;           /*!< [5..0] Value of first clock divider                                       */
      __IOM uint32_t RSVD06     : 2;            /*!< [7..6] This field is reserved.                                            */
      __IOM uint32_t LINENUM    : 6;            /*!< [13..8] Number of lines to be prefetched before starting the
                                                     frame through DMA. Maximum value is 32                                    */
      __IOM uint32_t RSVD14     : 2;            /*!< [15..14] This field is reserved.                                          */
      __IOM uint32_t PLL        : 8;            /*!< [23..16] Select PLL Clock                                                 */
      __IOM uint32_t RSVD024    : 3;            /*!< [26..24] This field is reserved.                                          */
      __IOM uint32_t SECCLKDIV  : 5;            /*!< [31..27] Value of secondary clock divider                                 */
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t BGCOLOR;                     /*!< (@ 0x00000008) Specifies the main background color.                       */

    struct {
      __IOM uint32_t ALPHACOLOR : 8;            /*!< [7..0] Color alpha is used as background color                            */
      __IOM uint32_t BLUECOLOR  : 8;            /*!< [15..8] Color blue is used as background color                            */
      __IOM uint32_t GREENCOLOR : 8;            /*!< [23..16] Color green is used as background color                          */
      __IOM uint32_t REDCOLOR   : 8;            /*!< [31..24] Color red is used as background color                            */
    } BGCOLOR_b;
  } ;

  union {
    __IOM uint32_t RESXY;                       /*!< (@ 0x0000000C) Specifies the main X and Y resolutions.                    */

    struct {
      __IOM uint32_t YRES       : 16;           /*!< [15..0] Value of Y resolution in pixels                                   */
      __IOM uint32_t XRES       : 16;           /*!< [31..16] Value of X resolution in pixels                                  */
    } RESXY_b;
  } ;

  union {
    __IOM uint32_t REGPLAY;                     /*!< (@ 0x00000010) Write any value to this register at the end of
                                                                    the programming sequence to trigger the
                                                                    NemaDC                                                     */

    struct {
      __IOM uint32_t PLAY       : 32;           /*!< [31..0] Trigger the frame generation process                              */
    } REGPLAY_b;
  } ;

  union {
    __IOM uint32_t FRONTPORCHXY;                /*!< (@ 0x00000014) Specifies the X and Y dimensions for the Front
                                                                    Porch.                                                     */

    struct {
      __IOM uint32_t FLINES     : 16;           /*!< [15..0] Specify the number of lines for the front porch Y dimension       */
      __IOM uint32_t FPCLKCYCLES : 16;          /*!< [31..16] Specify the pixel clock cycles for the front porch
                                                     X dimension                                                               */
    } FRONTPORCHXY_b;
  } ;

  union {
    __IOM uint32_t BLANKINGXY;                  /*!< (@ 0x00000018) Specifies the X and Y dimensions for the Blanking
                                                                    Period.                                                    */

    struct {
      __IOM uint32_t VSYNCLINES : 16;           /*!< [15..0] Specify the VSYNC lines for the Y dimension blanking
                                                     period                                                                    */
      __IOM uint32_t HSYNCPULSE : 16;           /*!< [31..16] Specify the HSYNC pulse length for the X dimension
                                                     blanking period                                                           */
    } BLANKINGXY_b;
  } ;

  union {
    __IOM uint32_t BACKPORCHXY;                 /*!< (@ 0x0000001C) Specifies the X and Y dimensions for the Back
                                                                    Porch.                                                     */

    struct {
      __IOM uint32_t BLINES     : 16;           /*!< [15..0] Specify the number of lines for the back porch Y dimension        */
      __IOM uint32_t BPCLKCYCLES : 16;          /*!< [31..16] Specify the pixel clock cycles for the back porch X
                                                     dimension                                                                 */
    } BACKPORCHXY_b;
  } ;

  union {
    __IOM uint32_t CURSORXY;                    /*!< (@ 0x00000020) Specifies the cursor's start X and Y coordinates.          */

    struct {
      __IOM uint32_t CURSORY    : 16;           /*!< [15..0] Specify cursor's Y dimension                                      */
      __IOM uint32_t CURSORX    : 16;           /*!< [31..16] Specify cursor's X dimension                                     */
    } CURSORXY_b;
  } ;

  union {
    __IOM uint32_t STARTXY;                     /*!< (@ 0x00000024) Specifies the start position of the very first
                                                                    frame                                                      */

    struct {
      __IOM uint32_t STARTY     : 16;           /*!< [15..0] Specify frames's Y dimension                                      */
      __IOM uint32_t STARTX     : 16;           /*!< [31..16] Specify frames's X dimension                                     */
    } STARTXY_b;
  } ;

  union {
    __IOM uint32_t DBICFG;                      /*!< (@ 0x00000028) Register for the configuration DBI Type-B interface
                                                                    and the activation of SPI 3-/4-wire interfaces.            */

