AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t DBICOLORFMT : 3;           /*!< [2..0] Set the color format for DBI interface                             */
      __IOM uint32_t DATAWDORDER : 3;           /*!< [5..3] Set the data order of the 8-bit data word:                         */
      __IOM uint32_t TYPEBWIDTH : 2;            /*!< [7..6] Set DBI Type-B interface width (8, 9 or 16 bits) and
                                                     the serial interface:                                                     */
      __IOM uint32_t RSVD08     : 3;            /*!< [10..8] This field is reserved.                                           */
      __IOM uint32_t BACKPRESSUREEN : 1;        /*!< [11..11] When set to 1, back pressure support is enabled (not
                                                     currently supported)                                                      */
      __IOM uint32_t RSVD12     : 4;            /*!< [15..12] This field is reserved.                                          */
      __IOM uint32_t INVHRZLINE : 1;            /*!< [16..16] When set to 1, inverts the bit-order of the horizontal
                                                     line address (used along with DBI_CFG[17] register bit)                   */
      __IOM uint32_t BINDCMDS   : 1;            /*!< [17..17] When set to 1, binds the store commands with the RGB
                                                     data and two-byte address is sent with each horizontal
                                                     line                                                                      */
      __IOM uint32_t RSVD18     : 4;            /*!< [21..18] This field is reserved.                                          */
      __IOM uint32_t SPI4       : 1;            /*!< [22..22] When set to 1, SPI 4-wire interface is enabled                   */
      __IOM uint32_t SPI3       : 1;            /*!< [23..23] When set to 1, SPI 3-wire interface is enabled                   */
      __IOM uint32_t RSVD2401   : 1;            /*!< [24..24] This field is reserved.                                          */
      __IOM uint32_t RESXLOW    : 1;            /*!< [25..25] When set to 1, drives RESX signal low to reset DBI
                                                     Type-B interface                                                          */
      __IOM uint32_t RSVD26     : 2;            /*!< [27..26] This field is reserved.                                          */
      __IOM uint32_t DBIBTEDIS  : 1;            /*!< [28..28] When set to 1, the DBIB_TE signal is disabled                    */
      __IOM uint32_t CSXSET     : 1;            /*!< [29..29] Sets the value of DBIB_CSX signal:                               */
      __IOM uint32_t CSXCFG     : 1;            /*!< [30..30] When set to 1, the value of the CSX signal of the DBI
                                                     interface can be configured from the DBI_CFG[29] register
                                                     bit                                                                       */
      __IOM uint32_t DBIINTACT  : 1;            /*!< [31..31] When set to 1, the DBI interface is activated                    */
    } DBICFG_b;
  } ;

  union {
    __IOM uint32_t DCGPIO;                      /*!< (@ 0x0000002C) General Purpose register: read/write GPIO external
                                                                    pins. This is accumulated as- {CGBYPASS_in,13'd0,ADVANCE_A
                                                                    YWAY_in,5'd0,GPIO_in}                                      */

    struct {
      __IOM uint32_t RWPINS     : 2;            /*!< [1..0] These are not implemented                                          */
      __IOM uint32_t RSVD0      : 5;            /*!< [6..2] This field is reserved.                                            */
      __IOM uint32_t ADVANCEANYWAY : 2;         /*!< [8..7] No idea what this is                                               */
      __IOM uint32_t RSVD09     : 13;           /*!< [21..9] This field is reserved.                                           */
      __IOM uint32_t CGBYPASS   : 10;           /*!< [31..22] No idea what this is                                             */
    } DCGPIO_b;
  } ;

  union {
    __IOM uint32_t LAYER0MODE;                  /*!< (@ 0x00000030) LAYER0_MODE: Activate and set-up layer 0.                  */

    struct {
      __IOM uint32_t LAYER0COLMODE : 5;         /*!< [4..0] Color mode                                                         */
      __IOM uint32_t MODElayerregisterprotect : 1;/*!< [5..5] Enable Register Protection for NemaDC layer registers.
                                                     When Register Protection is enabled the layer registers
                                                     take effect in the design only when frame end occurs.Register
                                                     reading functionality from register file remains the same.                */
      __IOM uint32_t FlipXenable : 1;           /*!< [6..6] Enables the FlipX functionality                                    */
      __IOM uint32_t FlipYenable : 1;           /*!< [7..7] Enables the FlipY functionality                                    */
      __IOM uint32_t LAYER0SBLEND : 4;          /*!< [11..8] Source blending function                                          */
      __IOM uint32_t LAYER0DBLEND : 4;          /*!< [15..12] Destination blending function                                    */
      __IOM uint32_t LAYER0ALPHA : 8;           /*!< [23..16] Alpha layer global value (0x00-0xFF range)                       */
      __IOM uint32_t RSVD24     : 2;            /*!< [25..24] This field is reserved.                                          */
      __IOM uint32_t LAYER0GAMMA : 1;           /*!< [26..26] When set to 1, Gamma Look Up Table is enabled                    */
      __IOM uint32_t RSVD27     : 1;            /*!< [27..27] Reserved field.                                                  */
      __IOM uint32_t LAYER0PREMULT : 1;         /*!< [28..28] When set to 1, premultiply image alpha is enabled                */
      __IOM uint32_t LAYER0DISMECHANISM : 1;    /*!< [29..29] When set to 1, it disables the mechanism that prevent
                                                     the underflow in certain interface(SPI/DBIB)                              */
      __IOM uint32_t LAYER0FORCE : 1;           /*!< [30..30] When set to 1, force alpha with global alpha is enabled          */
      __IOM uint32_t LAYER0EN   : 1;            /*!< [31..31] When set to 1, layer n is enabled                                */
    } LAYER0MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER0STARTXY;               /*!< (@ 0x00000034) X and Y start dimensions of layer 0.                       */

