AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t LAYER0YOFF : 16;           /*!< [15..0] Specify the pixel offset of the starting Y dimension
                                                     of layer 0                                                                */
      __IOM uint32_t LAYER0XOFF : 16;           /*!< [31..16] Specify the pixel offset of the starting X dimension
                                                     of layer 0                                                                */
    } LAYER0STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0SIZEXY;                /*!< (@ 0x00000038) X and Y size of layer 0.                                   */

    struct {
      __IOM uint32_t LAYER0PIXSZEY : 16;        /*!< [15..0] Specify the pixel size of the layer 0 in the Y dimension          */
      __IOM uint32_t LAYER0PIXSZEX : 16;        /*!< [31..16] Specify the pixel size of the layer 0 in the X dimension         */
    } LAYER0SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0ADDR;                  /*!< (@ 0x0000003C) The start address of the framebuffer to be accessed
                                                                    by layer 0.                                                */

    struct {
      __IOM uint32_t LAYER0STARTADDRFBUF : 32;  /*!< [31..0] Specify the start address of framebuffer for each layer
                                                     0.                                                                        */
    } LAYER0ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER0STRIDE;                /*!< (@ 0x00000040) Specify the stride and the AXI bus burst of layer
                                                                    0.                                                         */

    struct {
      __IOM uint32_t LAYER0STRIDEDIST : 16;     /*!< [15..0] Specify the stride, which is the distance from line
                                                     to line in bytes for each layer 0 memory                                  */
      __IOM uint32_t LAYER0AXIBURSTBITS : 3;    /*!< [18..16] Specify the AXI bits per burst in layer 0                        */
      __IOM uint32_t LAYER0AXIFIFOTHLD : 2;     /*!< [20..19] Specify the AXI fifo threshold burst start in layer
                                                     0                                                                         */
      __IOM uint32_t RSVD021    : 11;           /*!< [31..21] This field is reserved.                                          */
    } LAYER0STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER0RESXY;                 /*!< (@ 0x00000044) X and Y dimensions for the resolution of layer
                                                                    0.                                                         */

    struct {
      __IOM uint32_t LAYER0PIXRESY : 16;        /*!< [15..0] Specify the layer n pixel resolution in the Y dimension           */
      __IOM uint32_t LAYER0PIXRESX : 16;        /*!< [31..16] Specify the layer n pixel resolution in the X dimension          */
    } LAYER0RESXY_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t LAYER1MODE;                  /*!< (@ 0x00000050) Activate and set-up layer 1.                               */

    struct {
      __IOM uint32_t LAYER1COLORMODE : 5;       /*!< [4..0] Color mode                                                         */
      __IOM uint32_t RSVD05     : 3;            /*!< [7..5] This field is reserved.                                            */
      __IOM uint32_t LAYER1SBLEND : 4;          /*!< [11..8] Source blending function                                          */
      __IOM uint32_t LAYER1DBLEND : 4;          /*!< [15..12] Destination blending function                                    */
      __IOM uint32_t LAYER1ALPHA : 8;           /*!< [23..16] Alpha layer global value (0x00-0xFF range)                       */
      __IOM uint32_t RSVD242    : 2;            /*!< [25..24] This field is reserved.                                          */
      __IOM uint32_t LAYER1GAMMA : 1;           /*!< [26..26] When set to 1, Gamma Look Up Table is enabled                    */
      __IOM uint32_t LAYER1HLOCK : 1;           /*!< [27..27] When set to 1, HLOCK signal on AHB DMAs is asserted              */
      __IOM uint32_t LAYER1PREMULT : 1;         /*!< [28..28] When set to 1, premultiply image alpha is enabled                */
      __IOM uint32_t LAYER1BFILTER : 1;         /*!< [29..29] When set to 1, bilinear filtering is enabled                     */
      __IOM uint32_t LAYER1FORCE : 1;           /*!< [30..30] When set to 1, force alpha with global alpha is enabled          */
      __IOM uint32_t LAYER1EN   : 1;            /*!< [31..31] When set to 1, layer n is enabled                                */
    } LAYER1MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER1STARTXY;               /*!< (@ 0x00000054) X and Y start dimensions of layer 1.                       */

    struct {
      __IOM uint32_t LAYER1YOFF : 16;           /*!< [15..0] Specify the pixel offset of the starting Y dimension
                                                     of layer 1                                                                */
      __IOM uint32_t LAYER1XOFF : 16;           /*!< [31..16] Specify the pixel offset of the starting X dimension
                                                     of layer 1                                                                */
    } LAYER1STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER1SIZEXY;                /*!< (@ 0x00000058) X and Y size of layer 1.                                   */

    struct {
      __IOM uint32_t LAYER1PIXSZEY : 16;        /*!< [15..0] Specify the pixel size of the layer 1 in the Y dimension          */
      __IOM uint32_t LAYER1PIXSZEX : 16;        /*!< [31..16] Specify the pixel size of the layer 1 in the X dimension         */
    } LAYER1SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER1ADDR;                  /*!< (@ 0x0000005C) The start address of the framebuffer to be accessed
                                                                    by layer 1.                                                */

