AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t LAYER1STARTADDRFBUF : 32;  /*!< [31..0] Specify the start address of framebuffer for each layer
                                                     1.                                                                        */
    } LAYER1ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER1STRIDE;                /*!< (@ 0x00000060) Specify the stride and the AXI bus burst of layer
                                                                    1.                                                         */

    struct {
      __IOM uint32_t LAYER1STRIDEDIST : 16;     /*!< [15..0] Specify the stride, which is the distance from line
                                                     to line in bytes for each layer 1 memory                                  */
      __IOM uint32_t LAYER1AXIBURSTBITS : 3;    /*!< [18..16] Specify the AXI bits per burst in layer 1                        */
      __IOM uint32_t LAYER1AXIFIFOTHLD : 2;     /*!< [20..19] Specify the AXI fifo threshold burst start in layer
                                                     1                                                                         */
      __IOM uint32_t RSVD121    : 11;           /*!< [31..21] This field is reserved.                                          */
    } LAYER1STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER1RESXY;                 /*!< (@ 0x00000064) X and Y dimensions for the resolution of layer
                                                                    1.                                                         */

    struct {
      __IOM uint32_t LAYER1PIXRESY : 16;        /*!< [15..0] Specify the layer n pixel resolution in the Y dimension           */
      __IOM uint32_t LAYER1PIXRESX : 16;        /*!< [31..16] Specify the layer n pixel resolution in the X dimension          */
    } LAYER1RESXY_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t LAYER2MODE;                  /*!< (@ 0x00000070) Activate and set-up layer 2.                               */

    struct {
      __IOM uint32_t LAYER2COLORMODE : 5;       /*!< [4..0] Color mode                                                         */
      __IOM uint32_t RSVD5      : 3;            /*!< [7..5] This field is reserved.                                            */
      __IOM uint32_t LAYER2SBLEND : 4;          /*!< [11..8] Source blending function                                          */
      __IOM uint32_t LAYER2DBLEND : 4;          /*!< [15..12] Destination blending function                                    */
      __IOM uint32_t LAYER2ALPHA : 8;           /*!< [23..16] Alpha layer global value (0x00-0xFF range)                       */
      __IOM uint32_t RSVD2402   : 2;            /*!< [25..24] This field is reserved.                                          */
      __IOM uint32_t LAYER2GAMMA : 1;           /*!< [26..26] When set to 1, Gamma Look Up Table is enabled                    */
      __IOM uint32_t LAYER2HLOCK : 1;           /*!< [27..27] When set to 1, HLOCK signal on AHB DMAs is asserted              */
      __IOM uint32_t LAYER2PREMULT : 1;         /*!< [28..28] When set to 1, premultiply image alpha is enabled                */
      __IOM uint32_t LAYER2BFILTER : 1;         /*!< [29..29] When set to 1, bilinear filtering is enabled                     */
      __IOM uint32_t LAYER2FORCE : 1;           /*!< [30..30] When set to 1, force alpha with global alpha is enabled          */
      __IOM uint32_t LAYER2EN   : 1;            /*!< [31..31] When set to 1, layer n is enabled                                */
    } LAYER2MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER2STARTXY;               /*!< (@ 0x00000074) X and Y start dimensions of layer 2.                       */

    struct {
      __IOM uint32_t LAYER2YOFF : 16;           /*!< [15..0] Specify the pixel offset of the starting Y dimension
                                                     of layer 2                                                                */
      __IOM uint32_t LAYER2XOFF : 16;           /*!< [31..16] Specify the pixel offset of the starting X dimension
                                                     of layer 2                                                                */
    } LAYER2STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER2SIZEXY;                /*!< (@ 0x00000078) X and Y size of layer 2.                                   */

    struct {
      __IOM uint32_t LAYER2PIXSZEY : 16;        /*!< [15..0] Specify the pixel size of the layer 2 in the Y dimension          */
      __IOM uint32_t LAYER2PIXSZEX : 16;        /*!< [31..16] Specify the pixel size of the layer 2 in the X dimension         */
    } LAYER2SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER2ADDR;                  /*!< (@ 0x0000007C) The start address of the framebuffer to be accessed
                                                                    by layer 2.                                                */

    struct {
      __IOM uint32_t LAYER2STARTADDRFBUF : 32;  /*!< [31..0] Specify the start address of framebuffer for each layer
                                                     2.                                                                        */
    } LAYER2ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER2STRIDE;                /*!< (@ 0x00000080) Specify the stride and the AXI bus burst of layer
                                                                    2.                                                         */

    struct {
      __IOM uint32_t LAYER2STRIDEDIST : 16;     /*!< [15..0] Specify the stride, which is the distance from line
                                                     to line in bytes for each layer 2 memory                                  */
      __IOM uint32_t LAYER2AXIBURSTBITS : 3;    /*!< [18..16] Specify the AXI bits per burst in layer 2                        */
      __IOM uint32_t LAYER2AXIFIFOTHLD : 2;     /*!< [20..19] Specify the AXI fifo threshold burst start in layer
                                                     2                                                                         */
      __IOM uint32_t RSVD221    : 11;           /*!< [31..21] This field is reserved.                                          */
    } LAYER2STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER2RESXY;                 /*!< (@ 0x00000084) X and Y dimensions for the resolution of layer
                                                                    2.                                                         */

