AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t RSVD0017   : 17;           /*!< [16..0] This field is reserved.                                           */
      __IOM uint32_t TSC4       : 1;            /*!< [17..17] Indicates that TSC4 is enabled                                   */
      __IOM uint32_t TSC6       : 1;            /*!< [18..18] Indicates that TS6 is enabled                                    */
      __IOM uint32_t DBIBEXTERNAL : 1;          /*!< [19..19] Indicate DBIB external control is enabled                        */
      __IOM uint32_t RSVD20     : 3;            /*!< [22..20] This field is reserved                                           */
      __IOM uint32_t LAYER0FLIPX : 1;           /*!< [23..23] Indicate that FlipX is equiped for layer0                        */
      __IOM uint32_t LAYER1FLIPX : 1;           /*!< [24..24] Indicate that FlipX is equiped for layer1                        */
      __IOM uint32_t LAYER2FLIPX : 1;           /*!< [25..25] Indicate that FlipX is equiped for layer2                        */
      __IOM uint32_t LAYER3FLIPX : 1;           /*!< [26..26] Indicate that FlipX is equiped for layer3                        */
      __IOM uint32_t FLIPY      : 1;            /*!< [27..27] Indicate that FlipY is equiped                                   */
      __IOM uint32_t RSVD28     : 1;            /*!< [28..28] This field is reserved                                           */
      __IOM uint32_t JDI        : 1;            /*!< [29..29] Indicates that NemaDC is equiped JDI                             */
      __IOM uint32_t RSVD30     : 2;            /*!< [31..30] This field is reserved                                           */
    } COLMOD_b;
  } ;

  union {
    __IOM uint32_t LAYER0COLORDECSTARTXY;       /*!< (@ 0x00000104) X and Y stat of dimensions of colordec in layer0           */

    struct {
      __IOM uint32_t COCLORDECSTARTX : 16;      /*!< [15..0] Specify the pixel offset of the starting X dimension
                                                     of colordec in layer0                                                     */
      __IOM uint32_t COCLORDECSTARTY : 16;      /*!< [31..16] Specify the pixel offset of the starting Y dimension
                                                     of colordec in layer0                                                     */
    } LAYER0COLORDECSTARTXY_b;
  } ;
  __IM  uint32_t  RESERVED4[31];

  union {
    __IOM uint32_t CRC;                         /*!< (@ 0x00000184) if cyclic redundancy errors occur, they are written
                                                                    in the CRC register.                                       */

    struct {
      __IOM uint32_t CRCREG     : 32;           /*!< [31..0] CRC value if CRC error exists                                     */
    } CRC_b;
  } ;
  __IM  uint32_t  RESERVED5[158];

  union {
    __IOM uint32_t GLLUT;                       /*!< (@ 0x00000400) R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette,
                                                                    gamma correction memory region where x starts
                                                                    at 0 thru 255.Access to all 256 registers
                                                                    is best accomplished by passing an index
                                                                    via a macro. e.g. pseudocode #define DC_L0LUT(n)
                                                                    (*((volatile uint32_t*)(&L0LUT + (4*n))))                  */

    struct {
      __IOM uint32_t GLLUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t GLLUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t GLLUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t RSVD2408   : 8;            /*!< [31..24] This field is reserved.                                          */
    } GLLUT_b;
  } ;
  __IM  uint32_t  RESERVED6[767];

  union {
    __IOM uint32_t L0LUT;                       /*!< (@ 0x00001000) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255].
                                                                    Layer 0 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.                       */

    struct {
      __IOM uint32_t L0LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L0LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L0LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L0LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L0LUT_b;
  } ;
  __IM  uint32_t  RESERVED7[255];

  union {
    __IOM uint32_t L1LUT;                       /*!< (@ 0x00001400) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 1 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L1LUT(n) (*((volatile uint32_t*)(&L1LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L1LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L1LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L1LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L1LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L1LUT_b;
  } ;
  __IM  uint32_t  RESERVED8[255];

  union {
    __IOM uint32_t L2LUT0;                      /*!< (@ 0x00001800) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 2 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L2LUT(n) (*((volatile uint32_t*)(&L2LUT
                                                                    + (4*n))))                                                 */

