AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t RD2        : 32;           /*!< [31..0] GPIO95-64 Reads pin state - read only. Returns the pad
                                                     pin state for pins 95-64 if the PINCFG's input enable (INPEN)
                                                     is active and RDZERO is inactive.                                         */
    } RD2_b;
  } ;

  union {
    __IOM uint32_t RD3;                         /*!< (@ 0x0000000C) GPIO Input 3 (127-96)                                      */

    struct {
      __IOM uint32_t RD3        : 32;           /*!< [31..0] GPIO127-96 Reads pin state - read only. Returns the
                                                     pad pin state for pins 127-96 if the PINCFG's input enable
                                                     (INPEN) is active and RDZERO is inactive.                                 */
    } RD3_b;
  } ;

  union {
    __IOM uint32_t RD4;                         /*!< (@ 0x00000010) GPIO Input 4 (159-128)                                     */

    struct {
      __IOM uint32_t RD4        : 32;           /*!< [31..0] GPIO159-128 Reads pin state - read only. Returns the
                                                     pad pin state for pins 159-128 if the PINCFG's input enable
                                                     (INPEN) is active and RDZERO is inactive.                                 */
    } RD4_b;
  } ;

  union {
    __IOM uint32_t RD5;                         /*!< (@ 0x00000014) GPIO Input 5 (191-160)                                     */

    struct {
      __IOM uint32_t RD5        : 32;           /*!< [31..0] GPIO191-160 Reads pin state - read only. Returns the
                                                     pad pin state for pins 191-160 if the PINCFG's input enable
                                                     (INPEN) is active and RDZERO is inactive.                                 */
    } RD5_b;
  } ;

  union {
    __IOM uint32_t RD6;                         /*!< (@ 0x00000018) GPIO Input 6 (223-192)                                     */

    struct {
      __IOM uint32_t RD6        : 32;           /*!< [31..0] GPIO223-192 Reads pin state - read only. Returns the
                                                     pad pin state for pins 223-192 if the PINCFG's input enable
                                                     (INPEN) is active and RDZERO is inactive.                                 */
    } RD6_b;
  } ;

  union {
    __IOM uint32_t WT0;                         /*!< (@ 0x0000001C) GPIO Output 0 (31-0)                                       */

    struct {
      __IOM uint32_t WT0        : 32;           /*!< [31..0] GPIO31-0 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT0_b;
  } ;

  union {
    __IOM uint32_t WT1;                         /*!< (@ 0x00000020) GPIO Output 1 (63-32)                                      */

    struct {
      __IOM uint32_t WT1        : 32;           /*!< [31..0] GPIO63-32 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT1_b;
  } ;

  union {
    __IOM uint32_t WT2;                         /*!< (@ 0x00000024) GPIO Output 2 (95-64)                                      */

    struct {
      __IOM uint32_t WT2        : 32;           /*!< [31..0] GPIO95-64 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT2_b;
  } ;

  union {
    __IOM uint32_t WT3;                         /*!< (@ 0x00000028) GPIO Output 3 (127-96)                                     */

    struct {
      __IOM uint32_t WT3        : 32;           /*!< [31..0] GPIO127-96 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT3_b;
  } ;

  union {
    __IOM uint32_t WT4;                         /*!< (@ 0x0000002C) GPIO Output 4 (159-128)                                    */

    struct {
      __IOM uint32_t WT4        : 32;           /*!< [31..0] GPIO159-128 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT4_b;
  } ;

  union {
    __IOM uint32_t WT5;                         /*!< (@ 0x00000030) GPIO Output 5 (191-160)                                    */

    struct {
      __IOM uint32_t WT5        : 32;           /*!< [31..0] GPIO191-160 Reads or writes pin state. Writes of 1 bits
                                                     set output pad signal if the GPIO is enabled for output.
                                                     Reads return status, including sets/clears through the
                                                     WTS and WTC registers.                                                    */
    } WT5_b;
  } ;

  union {
    __IOM uint32_t WT6;                         /*!< (@ 0x00000034) GPIO Output 6 (223-192)                                    */

