AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL107  : 4;            /*!< [3..0] Function select for GPIO pin 107                                   */
      __IOM uint32_t INPEN107   : 1;            /*!< [4..4] Input enable for GPIO 107                                          */
      __IOM uint32_t RDZERO107  : 1;            /*!< [5..5] Return 0 for read data on GPIO 107                                 */
      __IOM uint32_t IRPTEN107  : 2;            /*!< [7..6] Interrupt enable for GPIO 107                                      */
      __IOM uint32_t OUTCFG107  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 107                             */
      __IOM uint32_t DS107      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 107                 */
      __IOM uint32_t SR107      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG107 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 107                       */
      __IOM uint32_t NCESRC107  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 107, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL107  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 107                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN107    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN107    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG107_b;
  } ;

  union {
    __IOM uint32_t PINCFG108;                   /*!< (@ 0x000001B0) Controls the operation of GPIO pin 108.                    */

    struct {
      __IOM uint32_t FNCSEL108  : 4;            /*!< [3..0] Function select for GPIO pin 108                                   */
      __IOM uint32_t INPEN108   : 1;            /*!< [4..4] Input enable for GPIO 108                                          */
      __IOM uint32_t RDZERO108  : 1;            /*!< [5..5] Return 0 for read data on GPIO 108                                 */
      __IOM uint32_t IRPTEN108  : 2;            /*!< [7..6] Interrupt enable for GPIO 108                                      */
      __IOM uint32_t OUTCFG108  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 108                             */
      __IOM uint32_t DS108      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 108                 */
      __IOM uint32_t SR108      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG108 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 108                       */
      __IOM uint32_t NCESRC108  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 108, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL108  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 108                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN108    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN108    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG108_b;
  } ;

  union {
    __IOM uint32_t PINCFG109;                   /*!< (@ 0x000001B4) Controls the operation of GPIO pin 109.                    */

    struct {
      __IOM uint32_t FNCSEL109  : 4;            /*!< [3..0] Function select for GPIO pin 109                                   */
      __IOM uint32_t INPEN109   : 1;            /*!< [4..4] Input enable for GPIO 109                                          */
      __IOM uint32_t RDZERO109  : 1;            /*!< [5..5] Return 0 for read data on GPIO 109                                 */
      __IOM uint32_t IRPTEN109  : 2;            /*!< [7..6] Interrupt enable for GPIO 109                                      */
      __IOM uint32_t OUTCFG109  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 109                             */
      __IOM uint32_t DS109      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 109                 */
      __IOM uint32_t SR109      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG109 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 109                       */
      __IOM uint32_t NCESRC109  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 109, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL109  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 109                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN109    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN109    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG109_b;
  } ;

  union {
    __IOM uint32_t PINCFG110;                   /*!< (@ 0x000001B8) Controls the operation of GPIO pin 110.                    */

