AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL113  : 4;            /*!< [3..0] Function select for GPIO pin 113                                   */
      __IOM uint32_t INPEN113   : 1;            /*!< [4..4] Input enable for GPIO 113                                          */
      __IOM uint32_t RDZERO113  : 1;            /*!< [5..5] Return 0 for read data on GPIO 113                                 */
      __IOM uint32_t IRPTEN113  : 2;            /*!< [7..6] Interrupt enable for GPIO 113                                      */
      __IOM uint32_t OUTCFG113  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 113                             */
      __IOM uint32_t DS113      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 113                 */
      __IOM uint32_t SR113      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG113 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 113                       */
      __IOM uint32_t NCESRC113  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 113, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL113  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 113                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN113    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN113    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG113_b;
  } ;

  union {
    __IOM uint32_t PINCFG114;                   /*!< (@ 0x000001C8) Controls the operation of GPIO pin 114.                    */

    struct {
      __IOM uint32_t FNCSEL114  : 4;            /*!< [3..0] Function select for GPIO pin 114                                   */
      __IOM uint32_t INPEN114   : 1;            /*!< [4..4] Input enable for GPIO 114                                          */
      __IOM uint32_t RDZERO114  : 1;            /*!< [5..5] Return 0 for read data on GPIO 114                                 */
      __IOM uint32_t IRPTEN114  : 2;            /*!< [7..6] Interrupt enable for GPIO 114                                      */
      __IOM uint32_t OUTCFG114  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 114                             */
      __IOM uint32_t DS114      : 2;            /*!< [11..10] Drive strength selection for GPIO 114                            */
      __IOM uint32_t SR114      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG114 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 114                       */
      __IOM uint32_t NCESRC114  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 114, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL114  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 114                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN114    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN114    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG114_b;
  } ;

  union {
    __IOM uint32_t PINCFG115;                   /*!< (@ 0x000001CC) Controls the operation of GPIO pin 115.                    */

    struct {
      __IOM uint32_t FNCSEL115  : 4;            /*!< [3..0] Function select for GPIO pin 115                                   */
      __IOM uint32_t INPEN115   : 1;            /*!< [4..4] Input enable for GPIO 115                                          */
      __IOM uint32_t RDZERO115  : 1;            /*!< [5..5] Return 0 for read data on GPIO 115                                 */
      __IOM uint32_t IRPTEN115  : 2;            /*!< [7..6] Interrupt enable for GPIO 115                                      */
      __IOM uint32_t OUTCFG115  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 115                             */
      __IOM uint32_t DS115      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 115                 */
      __IOM uint32_t SR115      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG115 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 115                       */
      __IOM uint32_t NCESRC115  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 115, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL115  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 115                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN115    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN115    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG115_b;
  } ;

  union {
    __IOM uint32_t PINCFG116;                   /*!< (@ 0x000001D0) Controls the operation of GPIO pin 116.                    */

