AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL119  : 4;            /*!< [3..0] Function select for GPIO pin 119                                   */
      __IOM uint32_t INPEN119   : 1;            /*!< [4..4] Input enable for GPIO 119                                          */
      __IOM uint32_t RDZERO119  : 1;            /*!< [5..5] Return 0 for read data on GPIO 119                                 */
      __IOM uint32_t IRPTEN119  : 2;            /*!< [7..6] Interrupt enable for GPIO 119                                      */
      __IOM uint32_t OUTCFG119  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 119                             */
      __IOM uint32_t DS119      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 119                 */
      __IOM uint32_t SR119      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG119 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 119                       */
      __IOM uint32_t NCESRC119  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 119, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL119  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 119                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN119    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN119    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG119_b;
  } ;

  union {
    __IOM uint32_t PINCFG120;                   /*!< (@ 0x000001E0) Controls the operation of GPIO pin 120.                    */

    struct {
      __IOM uint32_t FNCSEL120  : 4;            /*!< [3..0] Function select for GPIO pin 120                                   */
      __IOM uint32_t INPEN120   : 1;            /*!< [4..4] Input enable for GPIO 120                                          */
      __IOM uint32_t RDZERO120  : 1;            /*!< [5..5] Return 0 for read data on GPIO 120                                 */
      __IOM uint32_t IRPTEN120  : 2;            /*!< [7..6] Interrupt enable for GPIO 120                                      */
      __IOM uint32_t OUTCFG120  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 120                             */
      __IOM uint32_t DS120      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 120                 */
      __IOM uint32_t SR120      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG120 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 120                       */
      __IOM uint32_t NCESRC120  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 120, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL120  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 120                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN120    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN120    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG120_b;
  } ;

  union {
    __IOM uint32_t PINCFG121;                   /*!< (@ 0x000001E4) Controls the operation of GPIO pin 121.                    */

    struct {
      __IOM uint32_t FNCSEL121  : 4;            /*!< [3..0] Function select for GPIO pin 121                                   */
      __IOM uint32_t INPEN121   : 1;            /*!< [4..4] Input enable for GPIO 121                                          */
      __IOM uint32_t RDZERO121  : 1;            /*!< [5..5] Return 0 for read data on GPIO 121                                 */
      __IOM uint32_t IRPTEN121  : 2;            /*!< [7..6] Interrupt enable for GPIO 121                                      */
      __IOM uint32_t OUTCFG121  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 121                             */
      __IOM uint32_t DS121      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 121                 */
      __IOM uint32_t SR121      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG121 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 121                       */
      __IOM uint32_t NCESRC121  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 121, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL121  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 121                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN121    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN121    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG121_b;
  } ;

  union {
    __IOM uint32_t PINCFG122;                   /*!< (@ 0x000001E8) Controls the operation of GPIO pin 122.                    */

