AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL125  : 4;            /*!< [3..0] Function select for GPIO pin 125                                   */
      __IOM uint32_t INPEN125   : 1;            /*!< [4..4] Input enable for GPIO 125                                          */
      __IOM uint32_t RDZERO125  : 1;            /*!< [5..5] Return 0 for read data on GPIO 125                                 */
      __IOM uint32_t IRPTEN125  : 2;            /*!< [7..6] Interrupt enable for GPIO 125                                      */
      __IOM uint32_t OUTCFG125  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 125                             */
      __IOM uint32_t DS125      : 2;            /*!< [11..10] Drive strength selection for GPIO 125                            */
      __IOM uint32_t SR125      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG125 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 125                       */
      __IOM uint32_t NCESRC125  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 125, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL125  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 125                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN125    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN125    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG125_b;
  } ;

  union {
    __IOM uint32_t PINCFG126;                   /*!< (@ 0x000001F8) Controls the operation of GPIO pin 126.                    */

    struct {
      __IOM uint32_t FNCSEL126  : 4;            /*!< [3..0] Function select for GPIO pin 126                                   */
      __IOM uint32_t INPEN126   : 1;            /*!< [4..4] Input enable for GPIO 126                                          */
      __IOM uint32_t RDZERO126  : 1;            /*!< [5..5] Return 0 for read data on GPIO 126                                 */
      __IOM uint32_t IRPTEN126  : 2;            /*!< [7..6] Interrupt enable for GPIO 126                                      */
      __IOM uint32_t OUTCFG126  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 126                             */
      __IOM uint32_t DS126      : 2;            /*!< [11..10] Drive strength selection for GPIO 126                            */
      __IOM uint32_t SR126      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG126 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 126                       */
      __IOM uint32_t NCESRC126  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 126, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL126  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 126                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN126    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN126    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG126_b;
  } ;

  union {
    __IOM uint32_t PINCFG127;                   /*!< (@ 0x000001FC) Controls the operation of GPIO pin 127.                    */

    struct {
      __IOM uint32_t FNCSEL127  : 4;            /*!< [3..0] Function select for GPIO pin 127                                   */
      __IOM uint32_t INPEN127   : 1;            /*!< [4..4] Input enable for GPIO 127                                          */
      __IOM uint32_t RDZERO127  : 1;            /*!< [5..5] Return 0 for read data on GPIO 127                                 */
      __IOM uint32_t IRPTEN127  : 2;            /*!< [7..6] Interrupt enable for GPIO 127                                      */
      __IOM uint32_t OUTCFG127  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 127                             */
      __IOM uint32_t DS127      : 2;            /*!< [11..10] Drive strength selection for GPIO 127                            */
      __IOM uint32_t SR127      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG127 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 127                       */
      __IOM uint32_t NCESRC127  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 127, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL127  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 127                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN127    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN127    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG127_b;
  } ;

  union {
    __IOM uint32_t PINCFG128;                   /*!< (@ 0x00000200) Controls the operation of GPIO pin 128.                    */

