AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL128  : 4;            /*!< [3..0] Function select for GPIO pin 128                                   */
      __IOM uint32_t INPEN128   : 1;            /*!< [4..4] Input enable for GPIO 128                                          */
      __IOM uint32_t RDZERO128  : 1;            /*!< [5..5] Return 0 for read data on GPIO 128                                 */
      __IOM uint32_t IRPTEN128  : 2;            /*!< [7..6] Interrupt enable for GPIO 128                                      */
      __IOM uint32_t OUTCFG128  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 128                             */
      __IOM uint32_t DS128      : 2;            /*!< [11..10] Drive strength selection for GPIO 128                            */
      __IOM uint32_t SR128      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG128 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 128                       */
      __IOM uint32_t NCESRC128  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 128, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL128  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 128                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN128    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN128    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG128_b;
  } ;

  union {
    __IOM uint32_t PINCFG129;                   /*!< (@ 0x00000204) Controls the operation of GPIO pin 129.                    */

    struct {
      __IOM uint32_t FNCSEL129  : 4;            /*!< [3..0] Function select for GPIO pin 129                                   */
      __IOM uint32_t INPEN129   : 1;            /*!< [4..4] Input enable for GPIO 129                                          */
      __IOM uint32_t RDZERO129  : 1;            /*!< [5..5] Return 0 for read data on GPIO 129                                 */
      __IOM uint32_t IRPTEN129  : 2;            /*!< [7..6] Interrupt enable for GPIO 129                                      */
      __IOM uint32_t OUTCFG129  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 129                             */
      __IOM uint32_t DS129      : 2;            /*!< [11..10] Drive strength selection for GPIO 129                            */
      __IOM uint32_t SR129      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG129 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 129                       */
      __IOM uint32_t NCESRC129  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 129, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL129  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 129                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN129    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN129    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG129_b;
  } ;

  union {
    __IOM uint32_t PINCFG130;                   /*!< (@ 0x00000208) Controls the operation of GPIO pin 130.                    */

    struct {
      __IOM uint32_t FNCSEL130  : 4;            /*!< [3..0] Function select for GPIO pin 130                                   */
      __IOM uint32_t INPEN130   : 1;            /*!< [4..4] Input enable for GPIO 130                                          */
      __IOM uint32_t RDZERO130  : 1;            /*!< [5..5] Return 0 for read data on GPIO 130                                 */
      __IOM uint32_t IRPTEN130  : 2;            /*!< [7..6] Interrupt enable for GPIO 130                                      */
      __IOM uint32_t OUTCFG130  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 130                             */
      __IOM uint32_t DS130      : 2;            /*!< [11..10] Drive strength selection for GPIO 130                            */
      __IOM uint32_t SR130      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG130 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 130                       */
      __IOM uint32_t NCESRC130  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 130, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL130  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 130                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN130    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN130    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG130_b;
  } ;

  union {
    __IOM uint32_t PINCFG131;                   /*!< (@ 0x0000020C) Controls the operation of GPIO pin 131.                    */

