AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL131  : 4;            /*!< [3..0] Function select for GPIO pin 131                                   */
      __IOM uint32_t INPEN131   : 1;            /*!< [4..4] Input enable for GPIO 131                                          */
      __IOM uint32_t RDZERO131  : 1;            /*!< [5..5] Return 0 for read data on GPIO 131                                 */
      __IOM uint32_t IRPTEN131  : 2;            /*!< [7..6] Interrupt enable for GPIO 131                                      */
      __IOM uint32_t OUTCFG131  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 131                             */
      __IOM uint32_t DS131      : 2;            /*!< [11..10] Drive strength selection for GPIO 131                            */
      __IOM uint32_t SR131      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG131 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 131                       */
      __IOM uint32_t NCESRC131  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 131, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL131  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 131                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN131    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN131    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG131_b;
  } ;

  union {
    __IOM uint32_t PINCFG132;                   /*!< (@ 0x00000210) Controls the operation of GPIO pin 132.                    */

    struct {
      __IOM uint32_t FNCSEL132  : 4;            /*!< [3..0] Function select for GPIO pin 132                                   */
      __IOM uint32_t INPEN132   : 1;            /*!< [4..4] Input enable for GPIO 132                                          */
      __IOM uint32_t RDZERO132  : 1;            /*!< [5..5] Return 0 for read data on GPIO 132                                 */
      __IOM uint32_t IRPTEN132  : 2;            /*!< [7..6] Interrupt enable for GPIO 132                                      */
      __IOM uint32_t OUTCFG132  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 132                             */
      __IOM uint32_t DS132      : 2;            /*!< [11..10] Drive strength selection for GPIO 132                            */
      __IOM uint32_t SR132      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG132 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 132                       */
      __IOM uint32_t NCESRC132  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 132, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL132  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 132                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN132    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN132    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG132_b;
  } ;

  union {
    __IOM uint32_t PINCFG133;                   /*!< (@ 0x00000214) Controls the operation of GPIO pin 133.                    */

    struct {
      __IOM uint32_t FNCSEL133  : 4;            /*!< [3..0] Function select for GPIO pin 133                                   */
      __IOM uint32_t INPEN133   : 1;            /*!< [4..4] Input enable for GPIO 133                                          */
      __IOM uint32_t RDZERO133  : 1;            /*!< [5..5] Return 0 for read data on GPIO 133                                 */
      __IOM uint32_t IRPTEN133  : 2;            /*!< [7..6] Interrupt enable for GPIO 133                                      */
      __IOM uint32_t OUTCFG133  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 133                             */
      __IOM uint32_t DS133      : 2;            /*!< [11..10] Drive strength selection for GPIO 133                            */
      __IOM uint32_t SR133      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG133 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 133                       */
      __IOM uint32_t NCESRC133  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 133, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL133  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 133                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN133    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN133    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG133_b;
  } ;

  union {
    __IOM uint32_t PINCFG134;                   /*!< (@ 0x00000218) Controls the operation of GPIO pin 134.                    */

