AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL134  : 4;            /*!< [3..0] Function select for GPIO pin 134                                   */
      __IOM uint32_t INPEN134   : 1;            /*!< [4..4] Input enable for GPIO 134                                          */
      __IOM uint32_t RDZERO134  : 1;            /*!< [5..5] Return 0 for read data on GPIO 134                                 */
      __IOM uint32_t IRPTEN134  : 2;            /*!< [7..6] Interrupt enable for GPIO 134                                      */
      __IOM uint32_t OUTCFG134  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 134                             */
      __IOM uint32_t DS134      : 2;            /*!< [11..10] Drive strength selection for GPIO 134                            */
      __IOM uint32_t SR134      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG134 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 134                       */
      __IOM uint32_t NCESRC134  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 134, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL134  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 134                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN134    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN134    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG134_b;
  } ;

  union {
    __IOM uint32_t PINCFG135;                   /*!< (@ 0x0000021C) Controls the operation of GPIO pin 135.                    */

    struct {
      __IOM uint32_t FNCSEL135  : 4;            /*!< [3..0] Function select for GPIO pin 135                                   */
      __IOM uint32_t INPEN135   : 1;            /*!< [4..4] Input enable for GPIO 135                                          */
      __IOM uint32_t RDZERO135  : 1;            /*!< [5..5] Return 0 for read data on GPIO 135                                 */
      __IOM uint32_t IRPTEN135  : 2;            /*!< [7..6] Interrupt enable for GPIO 135                                      */
      __IOM uint32_t OUTCFG135  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 135                             */
      __IOM uint32_t DS135      : 2;            /*!< [11..10] Drive strength selection for GPIO 135                            */
      __IOM uint32_t SR135      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG135 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 135                       */
      __IOM uint32_t NCESRC135  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 135, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL135  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 135                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN135    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN135    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG135_b;
  } ;

  union {
    __IOM uint32_t PINCFG136;                   /*!< (@ 0x00000220) Controls the operation of GPIO pin 136.                    */

    struct {
      __IOM uint32_t FNCSEL136  : 4;            /*!< [3..0] Function select for GPIO pin 136                                   */
      __IOM uint32_t INPEN136   : 1;            /*!< [4..4] Input enable for GPIO 136                                          */
      __IOM uint32_t RDZERO136  : 1;            /*!< [5..5] Return 0 for read data on GPIO 136                                 */
      __IOM uint32_t IRPTEN136  : 2;            /*!< [7..6] Interrupt enable for GPIO 136                                      */
      __IOM uint32_t OUTCFG136  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 136                             */
      __IOM uint32_t DS136      : 2;            /*!< [11..10] Drive strength selection for GPIO 136                            */
      __IOM uint32_t SR136      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG136 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 136                       */
      __IOM uint32_t NCESRC136  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 136, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL136  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 136                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN136    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN136    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG136_b;
  } ;

  union {
    __IOM uint32_t PINCFG137;                   /*!< (@ 0x00000224) Controls the operation of GPIO pin 137.                    */

