AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL137  : 4;            /*!< [3..0] Function select for GPIO pin 137                                   */
      __IOM uint32_t INPEN137   : 1;            /*!< [4..4] Input enable for GPIO 137                                          */
      __IOM uint32_t RDZERO137  : 1;            /*!< [5..5] Return 0 for read data on GPIO 137                                 */
      __IOM uint32_t IRPTEN137  : 2;            /*!< [7..6] Interrupt enable for GPIO 137                                      */
      __IOM uint32_t OUTCFG137  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 137                             */
      __IOM uint32_t DS137      : 2;            /*!< [11..10] Drive strength selection for GPIO 137                            */
      __IOM uint32_t SR137      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG137 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 137                       */
      __IOM uint32_t NCESRC137  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 137, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL137  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 137                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN137    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN137    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG137_b;
  } ;

  union {
    __IOM uint32_t PINCFG138;                   /*!< (@ 0x00000228) Controls the operation of GPIO pin 138.                    */

    struct {
      __IOM uint32_t FNCSEL138  : 4;            /*!< [3..0] Function select for GPIO pin 138                                   */
      __IOM uint32_t INPEN138   : 1;            /*!< [4..4] Input enable for GPIO 138                                          */
      __IOM uint32_t RDZERO138  : 1;            /*!< [5..5] Return 0 for read data on GPIO 138                                 */
      __IOM uint32_t IRPTEN138  : 2;            /*!< [7..6] Interrupt enable for GPIO 138                                      */
      __IOM uint32_t OUTCFG138  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 138                             */
      __IOM uint32_t DS138      : 2;            /*!< [11..10] Drive strength selection for GPIO 138                            */
      __IOM uint32_t SR138      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG138 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 138                       */
      __IOM uint32_t NCESRC138  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 138, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL138  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 138                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN138    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN138    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG138_b;
  } ;

  union {
    __IOM uint32_t PINCFG139;                   /*!< (@ 0x0000022C) Controls the operation of GPIO pin 139.                    */

    struct {
      __IOM uint32_t FNCSEL139  : 4;            /*!< [3..0] Function select for GPIO pin 139                                   */
      __IOM uint32_t INPEN139   : 1;            /*!< [4..4] Input enable for GPIO 139                                          */
      __IOM uint32_t RDZERO139  : 1;            /*!< [5..5] Return 0 for read data on GPIO 139                                 */
      __IOM uint32_t IRPTEN139  : 2;            /*!< [7..6] Interrupt enable for GPIO 139                                      */
      __IOM uint32_t OUTCFG139  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 139                             */
      __IOM uint32_t DS139      : 2;            /*!< [11..10] Drive strength selection for GPIO 139                            */
      __IOM uint32_t SR139      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG139 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 139                       */
      __IOM uint32_t NCESRC139  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 139, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL139  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 139                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN139    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN139    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG139_b;
  } ;

  union {
    __IOM uint32_t PINCFG140;                   /*!< (@ 0x00000230) Controls the operation of GPIO pin 140.                    */

