AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL140  : 4;            /*!< [3..0] Function select for GPIO pin 140                                   */
      __IOM uint32_t INPEN140   : 1;            /*!< [4..4] Input enable for GPIO 140                                          */
      __IOM uint32_t RDZERO140  : 1;            /*!< [5..5] Return 0 for read data on GPIO 140                                 */
      __IOM uint32_t IRPTEN140  : 2;            /*!< [7..6] Interrupt enable for GPIO 140                                      */
      __IOM uint32_t OUTCFG140  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 140                             */
      __IOM uint32_t DS140      : 2;            /*!< [11..10] Drive strength selection for GPIO 140                            */
      __IOM uint32_t SR140      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG140 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 140                       */
      __IOM uint32_t NCESRC140  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 140, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL140  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 140                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN140    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN140    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG140_b;
  } ;

  union {
    __IOM uint32_t PINCFG141;                   /*!< (@ 0x00000234) Controls the operation of GPIO pin 141.                    */

    struct {
      __IOM uint32_t FNCSEL141  : 4;            /*!< [3..0] Function select for GPIO pin 141                                   */
      __IOM uint32_t INPEN141   : 1;            /*!< [4..4] Input enable for GPIO 141                                          */
      __IOM uint32_t RDZERO141  : 1;            /*!< [5..5] Return 0 for read data on GPIO 141                                 */
      __IOM uint32_t IRPTEN141  : 2;            /*!< [7..6] Interrupt enable for GPIO 141                                      */
      __IOM uint32_t OUTCFG141  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 141                             */
      __IOM uint32_t DS141      : 2;            /*!< [11..10] Drive strength selection for GPIO 141                            */
      __IOM uint32_t SR141      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG141 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 141                       */
      __IOM uint32_t NCESRC141  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 141, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL141  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 141                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN141    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN141    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG141_b;
  } ;

  union {
    __IOM uint32_t PINCFG142;                   /*!< (@ 0x00000238) Controls the operation of GPIO pin 142.                    */

    struct {
      __IOM uint32_t FNCSEL142  : 4;            /*!< [3..0] Function select for GPIO pin 142                                   */
      __IOM uint32_t INPEN142   : 1;            /*!< [4..4] Input enable for GPIO 142                                          */
      __IOM uint32_t RDZERO142  : 1;            /*!< [5..5] Return 0 for read data on GPIO 142                                 */
      __IOM uint32_t IRPTEN142  : 2;            /*!< [7..6] Interrupt enable for GPIO 142                                      */
      __IOM uint32_t OUTCFG142  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 142                             */
      __IOM uint32_t DS142      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 142                 */
      __IOM uint32_t SR142      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG142 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 142                       */
      __IOM uint32_t NCESRC142  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 142, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL142  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 142                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN142    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN142    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG142_b;
  } ;

  union {
    __IOM uint32_t PINCFG143;                   /*!< (@ 0x0000023C) Controls the operation of GPIO pin 143.                    */

