AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL143  : 4;            /*!< [3..0] Function select for GPIO pin 143                                   */
      __IOM uint32_t INPEN143   : 1;            /*!< [4..4] Input enable for GPIO 143                                          */
      __IOM uint32_t RDZERO143  : 1;            /*!< [5..5] Return 0 for read data on GPIO 143                                 */
      __IOM uint32_t IRPTEN143  : 2;            /*!< [7..6] Interrupt enable for GPIO 143                                      */
      __IOM uint32_t OUTCFG143  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 143                             */
      __IOM uint32_t DS143      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 143                 */
      __IOM uint32_t SR143      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG143 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 143                       */
      __IOM uint32_t NCESRC143  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 143, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL143  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 143                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN143    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN143    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG143_b;
  } ;

  union {
    __IOM uint32_t PINCFG144;                   /*!< (@ 0x00000240) Controls the operation of GPIO pin 144.                    */

    struct {
      __IOM uint32_t FNCSEL144  : 4;            /*!< [3..0] Function select for GPIO pin 144                                   */
      __IOM uint32_t INPEN144   : 1;            /*!< [4..4] Input enable for GPIO 144                                          */
      __IOM uint32_t RDZERO144  : 1;            /*!< [5..5] Return 0 for read data on GPIO 144                                 */
      __IOM uint32_t IRPTEN144  : 2;            /*!< [7..6] Interrupt enable for GPIO 144                                      */
      __IOM uint32_t OUTCFG144  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 144                             */
      __IOM uint32_t DS144      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 144                 */
      __IOM uint32_t SR144      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG144 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 144                       */
      __IOM uint32_t NCESRC144  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 144, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL144  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 144                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN144    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN144    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG144_b;
  } ;

  union {
    __IOM uint32_t PINCFG145;                   /*!< (@ 0x00000244) Controls the operation of GPIO pin 145.                    */

    struct {
      __IOM uint32_t FNCSEL145  : 4;            /*!< [3..0] Function select for GPIO pin 145                                   */
      __IOM uint32_t INPEN145   : 1;            /*!< [4..4] Input enable for GPIO 145                                          */
      __IOM uint32_t RDZERO145  : 1;            /*!< [5..5] Return 0 for read data on GPIO 145                                 */
      __IOM uint32_t IRPTEN145  : 2;            /*!< [7..6] Interrupt enable for GPIO 145                                      */
      __IOM uint32_t OUTCFG145  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 145                             */
      __IOM uint32_t DS145      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 145                 */
      __IOM uint32_t SR145      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG145 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 145                       */
      __IOM uint32_t NCESRC145  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 145, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL145  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 145                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN145    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN145    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG145_b;
  } ;

  union {
    __IOM uint32_t PINCFG146;                   /*!< (@ 0x00000248) Controls the operation of GPIO pin 146.                    */

