AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL146  : 4;            /*!< [3..0] Function select for GPIO pin 146                                   */
      __IOM uint32_t INPEN146   : 1;            /*!< [4..4] Input enable for GPIO 146                                          */
      __IOM uint32_t RDZERO146  : 1;            /*!< [5..5] Return 0 for read data on GPIO 146                                 */
      __IOM uint32_t IRPTEN146  : 2;            /*!< [7..6] Interrupt enable for GPIO 146                                      */
      __IOM uint32_t OUTCFG146  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 146                             */
      __IOM uint32_t DS146      : 2;            /*!< [11..10] Drive strength selection for High Speed GPIO 146                 */
      __IOM uint32_t SR146      : 1;            /*!< [12..12] Configure high or low drive strength                             */
      __IOM uint32_t PULLCFG146 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 146                       */
      __IOM uint32_t NCESRC146  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 146, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL146  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 146                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN146    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN146    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG146_b;
  } ;

  union {
    __IOM uint32_t PINCFG147;                   /*!< (@ 0x0000024C) Controls the operation of GPIO pin 147.                    */

    struct {
      __IOM uint32_t FNCSEL147  : 4;            /*!< [3..0] Function select for GPIO pin 147                                   */
      __IOM uint32_t INPEN147   : 1;            /*!< [4..4] Input enable for GPIO 147                                          */
      __IOM uint32_t RDZERO147  : 1;            /*!< [5..5] Return 0 for read data on GPIO 147                                 */
      __IOM uint32_t IRPTEN147  : 2;            /*!< [7..6] Interrupt enable for GPIO 147                                      */
      __IOM uint32_t OUTCFG147  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 147                             */
      __IOM uint32_t DS147      : 2;            /*!< [11..10] Drive strength selection for GPIO 147                            */
      __IOM uint32_t SR147      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG147 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 147                       */
      __IOM uint32_t NCESRC147  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 147, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL147  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 147                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN147    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN147    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG147_b;
  } ;

  union {
    __IOM uint32_t PINCFG148;                   /*!< (@ 0x00000250) Controls the operation of GPIO pin 148.                    */

    struct {
      __IOM uint32_t FNCSEL148  : 4;            /*!< [3..0] Function select for GPIO pin 148                                   */
      __IOM uint32_t INPEN148   : 1;            /*!< [4..4] Input enable for GPIO 148                                          */
      __IOM uint32_t RDZERO148  : 1;            /*!< [5..5] Return 0 for read data on GPIO 148                                 */
      __IOM uint32_t IRPTEN148  : 2;            /*!< [7..6] Interrupt enable for GPIO 148                                      */
      __IOM uint32_t OUTCFG148  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 148                             */
      __IOM uint32_t DS148      : 2;            /*!< [11..10] Drive strength selection for GPIO 148                            */
      __IOM uint32_t SR148      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG148 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 148                       */
      __IOM uint32_t NCESRC148  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 148, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL148  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 148                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN148    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN148    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG148_b;
  } ;

  union {
    __IOM uint32_t PINCFG149;                   /*!< (@ 0x00000254) Controls the operation of GPIO pin 149.                    */

