AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL149  : 4;            /*!< [3..0] Function select for GPIO pin 149                                   */
      __IOM uint32_t INPEN149   : 1;            /*!< [4..4] Input enable for GPIO 149                                          */
      __IOM uint32_t RDZERO149  : 1;            /*!< [5..5] Return 0 for read data on GPIO 149                                 */
      __IOM uint32_t IRPTEN149  : 2;            /*!< [7..6] Interrupt enable for GPIO 149                                      */
      __IOM uint32_t OUTCFG149  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 149                             */
      __IOM uint32_t DS149      : 2;            /*!< [11..10] Drive strength selection for GPIO 149                            */
      __IOM uint32_t SR149      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG149 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 149                       */
      __IOM uint32_t NCESRC149  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 149, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL149  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 149                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN149    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN149    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG149_b;
  } ;

  union {
    __IOM uint32_t PINCFG150;                   /*!< (@ 0x00000258) Controls the operation of GPIO pin 150.                    */

    struct {
      __IOM uint32_t FNCSEL150  : 4;            /*!< [3..0] Function select for GPIO pin 150                                   */
      __IOM uint32_t INPEN150   : 1;            /*!< [4..4] Input enable for GPIO 150                                          */
      __IOM uint32_t RDZERO150  : 1;            /*!< [5..5] Return 0 for read data on GPIO 150                                 */
      __IOM uint32_t IRPTEN150  : 2;            /*!< [7..6] Interrupt enable for GPIO 150                                      */
      __IOM uint32_t OUTCFG150  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 150                             */
      __IOM uint32_t DS150      : 2;            /*!< [11..10] Drive strength selection for GPIO 150                            */
      __IOM uint32_t SR150      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG150 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 150                       */
      __IOM uint32_t NCESRC150  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 150, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL150  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 150                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN150    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN150    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG150_b;
  } ;

  union {
    __IOM uint32_t PINCFG151;                   /*!< (@ 0x0000025C) Controls the operation of GPIO pin 151.                    */

    struct {
      __IOM uint32_t FNCSEL151  : 4;            /*!< [3..0] Function select for GPIO pin 151                                   */
      __IOM uint32_t INPEN151   : 1;            /*!< [4..4] Input enable for GPIO 151                                          */
      __IOM uint32_t RDZERO151  : 1;            /*!< [5..5] Return 0 for read data on GPIO 151                                 */
      __IOM uint32_t IRPTEN151  : 2;            /*!< [7..6] Interrupt enable for GPIO 151                                      */
      __IOM uint32_t OUTCFG151  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 151                             */
      __IOM uint32_t DS151      : 2;            /*!< [11..10] Drive strength selection for GPIO 151                            */
      __IOM uint32_t SR151      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG151 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 151                       */
      __IOM uint32_t NCESRC151  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 151, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL151  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 151                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN151    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN151    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG151_b;
  } ;

  union {
    __IOM uint32_t PINCFG152;                   /*!< (@ 0x00000260) Controls the operation of GPIO pin 152.                    */

