AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL152  : 4;            /*!< [3..0] Function select for GPIO pin 152                                   */
      __IOM uint32_t INPEN152   : 1;            /*!< [4..4] Input enable for GPIO 152                                          */
      __IOM uint32_t RDZERO152  : 1;            /*!< [5..5] Return 0 for read data on GPIO 152                                 */
      __IOM uint32_t IRPTEN152  : 2;            /*!< [7..6] Interrupt enable for GPIO 152                                      */
      __IOM uint32_t OUTCFG152  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 152                             */
      __IOM uint32_t DS152      : 2;            /*!< [11..10] Drive strength selection for GPIO 152                            */
      __IOM uint32_t SR152      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG152 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 152                       */
      __IOM uint32_t NCESRC152  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 152, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL152  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 152                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN152    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN152    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG152_b;
  } ;

  union {
    __IOM uint32_t PINCFG153;                   /*!< (@ 0x00000264) Controls the operation of GPIO pin 153.                    */

    struct {
      __IOM uint32_t FNCSEL153  : 4;            /*!< [3..0] Function select for GPIO pin 153                                   */
      __IOM uint32_t INPEN153   : 1;            /*!< [4..4] Input enable for GPIO 153                                          */
      __IOM uint32_t RDZERO153  : 1;            /*!< [5..5] Return 0 for read data on GPIO 153                                 */
      __IOM uint32_t IRPTEN153  : 2;            /*!< [7..6] Interrupt enable for GPIO 153                                      */
      __IOM uint32_t OUTCFG153  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 153                             */
      __IOM uint32_t DS153      : 2;            /*!< [11..10] Drive strength selection for GPIO 153                            */
      __IOM uint32_t SR153      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG153 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 153                       */
      __IOM uint32_t NCESRC153  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 153, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL153  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 153                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN153    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN153    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG153_b;
  } ;

  union {
    __IOM uint32_t PINCFG154;                   /*!< (@ 0x00000268) Controls the operation of GPIO pin 154.                    */

    struct {
      __IOM uint32_t FNCSEL154  : 4;            /*!< [3..0] Function select for GPIO pin 154                                   */
      __IOM uint32_t INPEN154   : 1;            /*!< [4..4] Input enable for GPIO 154                                          */
      __IOM uint32_t RDZERO154  : 1;            /*!< [5..5] Return 0 for read data on GPIO 154                                 */
      __IOM uint32_t IRPTEN154  : 2;            /*!< [7..6] Interrupt enable for GPIO 154                                      */
      __IOM uint32_t OUTCFG154  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 154                             */
      __IOM uint32_t DS154      : 2;            /*!< [11..10] Drive strength selection for GPIO 154                            */
      __IOM uint32_t SR154      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG154 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 154                       */
      __IOM uint32_t NCESRC154  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 154, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL154  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 154                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN154    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN154    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG154_b;
  } ;

  union {
    __IOM uint32_t PINCFG155;                   /*!< (@ 0x0000026C) Controls the operation of GPIO pin 155.                    */

