AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL155  : 4;            /*!< [3..0] Function select for GPIO pin 155                                   */
      __IOM uint32_t INPEN155   : 1;            /*!< [4..4] Input enable for GPIO 155                                          */
      __IOM uint32_t RDZERO155  : 1;            /*!< [5..5] Return 0 for read data on GPIO 155                                 */
      __IOM uint32_t IRPTEN155  : 2;            /*!< [7..6] Interrupt enable for GPIO 155                                      */
      __IOM uint32_t OUTCFG155  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 155                             */
      __IOM uint32_t DS155      : 2;            /*!< [11..10] Drive strength selection for GPIO 155                            */
      __IOM uint32_t SR155      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG155 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 155                       */
      __IOM uint32_t NCESRC155  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 155, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL155  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 155                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN155    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN155    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG155_b;
  } ;

  union {
    __IOM uint32_t PINCFG156;                   /*!< (@ 0x00000270) Controls the operation of GPIO pin 156.                    */

    struct {
      __IOM uint32_t FNCSEL156  : 4;            /*!< [3..0] Function select for GPIO pin 156                                   */
      __IOM uint32_t INPEN156   : 1;            /*!< [4..4] Input enable for GPIO 156                                          */
      __IOM uint32_t RDZERO156  : 1;            /*!< [5..5] Return 0 for read data on GPIO 156                                 */
      __IOM uint32_t IRPTEN156  : 2;            /*!< [7..6] Interrupt enable for GPIO 156                                      */
      __IOM uint32_t OUTCFG156  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 156                             */
      __IOM uint32_t DS156      : 2;            /*!< [11..10] Drive strength selection for GPIO 156                            */
      __IOM uint32_t SR156      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG156 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 156                       */
      __IOM uint32_t NCESRC156  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 156, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL156  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 156                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN156    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN156    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG156_b;
  } ;

  union {
    __IOM uint32_t PINCFG157;                   /*!< (@ 0x00000274) Controls the operation of GPIO pin 157.                    */

    struct {
      __IOM uint32_t FNCSEL157  : 4;            /*!< [3..0] Function select for GPIO pin 157                                   */
      __IOM uint32_t INPEN157   : 1;            /*!< [4..4] Input enable for GPIO 157                                          */
      __IOM uint32_t RDZERO157  : 1;            /*!< [5..5] Return 0 for read data on GPIO 157                                 */
      __IOM uint32_t IRPTEN157  : 2;            /*!< [7..6] Interrupt enable for GPIO 157                                      */
      __IOM uint32_t OUTCFG157  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 157                             */
      __IOM uint32_t DS157      : 2;            /*!< [11..10] Drive strength selection for GPIO 157                            */
      __IOM uint32_t SR157      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG157 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 157                       */
      __IOM uint32_t NCESRC157  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 157, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL157  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 157                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN157    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN157    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG157_b;
  } ;

  union {
    __IOM uint32_t PINCFG158;                   /*!< (@ 0x00000278) Controls the operation of GPIO pin 158.                    */

