AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL158  : 4;            /*!< [3..0] Function select for GPIO pin 158                                   */
      __IOM uint32_t INPEN158   : 1;            /*!< [4..4] Input enable for GPIO 158                                          */
      __IOM uint32_t RDZERO158  : 1;            /*!< [5..5] Return 0 for read data on GPIO 158                                 */
      __IOM uint32_t IRPTEN158  : 2;            /*!< [7..6] Interrupt enable for GPIO 158                                      */
      __IOM uint32_t OUTCFG158  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 158                             */
      __IOM uint32_t DS158      : 2;            /*!< [11..10] Drive strength selection for GPIO 158                            */
      __IOM uint32_t SR158      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG158 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 158                       */
      __IOM uint32_t NCESRC158  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 158, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL158  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 158                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN158    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN158    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG158_b;
  } ;

  union {
    __IOM uint32_t PINCFG159;                   /*!< (@ 0x0000027C) Controls the operation of GPIO pin 159.                    */

    struct {
      __IOM uint32_t FNCSEL159  : 4;            /*!< [3..0] Function select for GPIO pin 159                                   */
      __IOM uint32_t INPEN159   : 1;            /*!< [4..4] Input enable for GPIO 159                                          */
      __IOM uint32_t RDZERO159  : 1;            /*!< [5..5] Return 0 for read data on GPIO 159                                 */
      __IOM uint32_t IRPTEN159  : 2;            /*!< [7..6] Interrupt enable for GPIO 159                                      */
      __IOM uint32_t OUTCFG159  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 159                             */
      __IOM uint32_t DS159      : 2;            /*!< [11..10] Drive strength selection for GPIO 159                            */
      __IOM uint32_t SR159      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG159 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 159                       */
      __IOM uint32_t NCESRC159  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 159, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL159  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 159                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN159    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN159    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG159_b;
  } ;

  union {
    __IOM uint32_t PINCFG160;                   /*!< (@ 0x00000280) Controls the operation of GPIO pin 160.                    */

    struct {
      __IOM uint32_t FNCSEL160  : 4;            /*!< [3..0] Function select for GPIO pin 160                                   */
      __IOM uint32_t INPEN160   : 1;            /*!< [4..4] Input enable for GPIO 160                                          */
      __IOM uint32_t RDZERO160  : 1;            /*!< [5..5] Return 0 for read data on GPIO 160                                 */
      __IOM uint32_t IRPTEN160  : 2;            /*!< [7..6] Interrupt enable for GPIO 160                                      */
      __IOM uint32_t OUTCFG160  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 160                             */
      __IOM uint32_t DS160      : 2;            /*!< [11..10] Drive strength selection for GPIO 160                            */
      __IOM uint32_t SR160      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG160 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 160                       */
      __IOM uint32_t NCESRC160  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 160, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL160  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 160                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN160    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN160    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG160_b;
  } ;

  union {
    __IOM uint32_t PINCFG161;                   /*!< (@ 0x00000284) Controls the operation of GPIO pin 161.                    */

