AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL161  : 4;            /*!< [3..0] Function select for GPIO pin 161                                   */
      __IOM uint32_t INPEN161   : 1;            /*!< [4..4] Input enable for GPIO 161                                          */
      __IOM uint32_t RDZERO161  : 1;            /*!< [5..5] Return 0 for read data on GPIO 161                                 */
      __IOM uint32_t IRPTEN161  : 2;            /*!< [7..6] Interrupt enable for GPIO 161                                      */
      __IOM uint32_t OUTCFG161  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 161                             */
      __IOM uint32_t DS161      : 2;            /*!< [11..10] Drive strength selection for GPIO 161                            */
      __IOM uint32_t SR161      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG161 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 161                       */
      __IOM uint32_t NCESRC161  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 161, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL161  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 161                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN161    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN161    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG161_b;
  } ;

  union {
    __IOM uint32_t PINCFG162;                   /*!< (@ 0x00000288) Controls the operation of GPIO pin 162.                    */

    struct {
      __IOM uint32_t FNCSEL162  : 4;            /*!< [3..0] Function select for GPIO pin 162                                   */
      __IOM uint32_t INPEN162   : 1;            /*!< [4..4] Input enable for GPIO 162                                          */
      __IOM uint32_t RDZERO162  : 1;            /*!< [5..5] Return 0 for read data on GPIO 162                                 */
      __IOM uint32_t IRPTEN162  : 2;            /*!< [7..6] Interrupt enable for GPIO 162                                      */
      __IOM uint32_t OUTCFG162  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 162                             */
      __IOM uint32_t DS162      : 2;            /*!< [11..10] Drive strength selection for GPIO 162                            */
      __IOM uint32_t SR162      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG162 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 162                       */
      __IOM uint32_t NCESRC162  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 162, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL162  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 162                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN162    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN162    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG162_b;
  } ;

  union {
    __IOM uint32_t PINCFG163;                   /*!< (@ 0x0000028C) Controls the operation of GPIO pin 163.                    */

    struct {
      __IOM uint32_t FNCSEL163  : 4;            /*!< [3..0] Function select for GPIO pin 163                                   */
      __IOM uint32_t INPEN163   : 1;            /*!< [4..4] Input enable for GPIO 163                                          */
      __IOM uint32_t RDZERO163  : 1;            /*!< [5..5] Return 0 for read data on GPIO 163                                 */
      __IOM uint32_t IRPTEN163  : 2;            /*!< [7..6] Interrupt enable for GPIO 163                                      */
      __IOM uint32_t OUTCFG163  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 163                             */
      __IOM uint32_t DS163      : 2;            /*!< [11..10] Drive strength selection for GPIO 163                            */
      __IOM uint32_t SR163      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG163 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 163                       */
      __IOM uint32_t NCESRC163  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 163, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL163  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 163                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN163    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN163    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG163_b;
  } ;

  union {
    __IOM uint32_t PINCFG164;                   /*!< (@ 0x00000290) Controls the operation of GPIO pin 164.                    */

