AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL164  : 4;            /*!< [3..0] Function select for GPIO pin 164                                   */
      __IOM uint32_t INPEN164   : 1;            /*!< [4..4] Input enable for GPIO 164                                          */
      __IOM uint32_t RDZERO164  : 1;            /*!< [5..5] Return 0 for read data on GPIO 164                                 */
      __IOM uint32_t IRPTEN164  : 2;            /*!< [7..6] Interrupt enable for GPIO 164                                      */
      __IOM uint32_t OUTCFG164  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 164                             */
      __IOM uint32_t DS164      : 2;            /*!< [11..10] Drive strength selection for GPIO 164                            */
      __IOM uint32_t SR164      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG164 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 164                       */
      __IOM uint32_t NCESRC164  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 164, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL164  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 164                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN164    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN164    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG164_b;
  } ;

  union {
    __IOM uint32_t PINCFG165;                   /*!< (@ 0x00000294) Controls the operation of GPIO pin 165.                    */

    struct {
      __IOM uint32_t FNCSEL165  : 4;            /*!< [3..0] Function select for GPIO pin 165                                   */
      __IOM uint32_t INPEN165   : 1;            /*!< [4..4] Input enable for GPIO 165                                          */
      __IOM uint32_t RDZERO165  : 1;            /*!< [5..5] Return 0 for read data on GPIO 165                                 */
      __IOM uint32_t IRPTEN165  : 2;            /*!< [7..6] Interrupt enable for GPIO 165                                      */
      __IOM uint32_t OUTCFG165  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 165                             */
      __IOM uint32_t DS165      : 2;            /*!< [11..10] Drive strength selection for GPIO 165                            */
      __IOM uint32_t SR165      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG165 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 165                       */
      __IOM uint32_t NCESRC165  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 165, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL165  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 165                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN165    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN165    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG165_b;
  } ;

  union {
    __IOM uint32_t PINCFG166;                   /*!< (@ 0x00000298) Controls the operation of GPIO pin 166.                    */

    struct {
      __IOM uint32_t FNCSEL166  : 4;            /*!< [3..0] Function select for GPIO pin 166                                   */
      __IOM uint32_t INPEN166   : 1;            /*!< [4..4] Input enable for GPIO 166                                          */
      __IOM uint32_t RDZERO166  : 1;            /*!< [5..5] Return 0 for read data on GPIO 166                                 */
      __IOM uint32_t IRPTEN166  : 2;            /*!< [7..6] Interrupt enable for GPIO 166                                      */
      __IOM uint32_t OUTCFG166  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 166                             */
      __IOM uint32_t DS166      : 2;            /*!< [11..10] Drive strength selection for GPIO 166                            */
      __IOM uint32_t SR166      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG166 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 166                       */
      __IOM uint32_t NCESRC166  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 166, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL166  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 166                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN166    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN166    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG166_b;
  } ;

  union {
    __IOM uint32_t PINCFG167;                   /*!< (@ 0x0000029C) Controls the operation of GPIO pin 167.                    */

