AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL167  : 4;            /*!< [3..0] Function select for GPIO pin 167                                   */
      __IOM uint32_t INPEN167   : 1;            /*!< [4..4] Input enable for GPIO 167                                          */
      __IOM uint32_t RDZERO167  : 1;            /*!< [5..5] Return 0 for read data on GPIO 167                                 */
      __IOM uint32_t IRPTEN167  : 2;            /*!< [7..6] Interrupt enable for GPIO 167                                      */
      __IOM uint32_t OUTCFG167  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 167                             */
      __IOM uint32_t DS167      : 2;            /*!< [11..10] Drive strength selection for GPIO 167                            */
      __IOM uint32_t SR167      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG167 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 167                       */
      __IOM uint32_t NCESRC167  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 167, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL167  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 167                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN167    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN167    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG167_b;
  } ;

  union {
    __IOM uint32_t PINCFG168;                   /*!< (@ 0x000002A0) Controls the operation of GPIO pin 168.                    */

    struct {
      __IOM uint32_t FNCSEL168  : 4;            /*!< [3..0] Function select for GPIO pin 168                                   */
      __IOM uint32_t INPEN168   : 1;            /*!< [4..4] Input enable for GPIO 168                                          */
      __IOM uint32_t RDZERO168  : 1;            /*!< [5..5] Return 0 for read data on GPIO 168                                 */
      __IOM uint32_t IRPTEN168  : 2;            /*!< [7..6] Interrupt enable for GPIO 168                                      */
      __IOM uint32_t OUTCFG168  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 168                             */
      __IOM uint32_t DS168      : 2;            /*!< [11..10] Drive strength selection for GPIO 168                            */
      __IOM uint32_t SR168      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG168 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 168                       */
      __IOM uint32_t NCESRC168  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 168, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL168  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 168                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN168    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN168    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG168_b;
  } ;

  union {
    __IOM uint32_t PINCFG169;                   /*!< (@ 0x000002A4) Controls the operation of GPIO pin 169.                    */

    struct {
      __IOM uint32_t FNCSEL169  : 4;            /*!< [3..0] Function select for GPIO pin 169                                   */
      __IOM uint32_t INPEN169   : 1;            /*!< [4..4] Input enable for GPIO 169                                          */
      __IOM uint32_t RDZERO169  : 1;            /*!< [5..5] Return 0 for read data on GPIO 169                                 */
      __IOM uint32_t IRPTEN169  : 2;            /*!< [7..6] Interrupt enable for GPIO 169                                      */
      __IOM uint32_t OUTCFG169  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 169                             */
      __IOM uint32_t DS169      : 2;            /*!< [11..10] Drive strength selection for GPIO 169                            */
      __IOM uint32_t SR169      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG169 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 169                       */
      __IOM uint32_t NCESRC169  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 169, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL169  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 169                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN169    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN169    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG169_b;
  } ;

  union {
    __IOM uint32_t PINCFG170;                   /*!< (@ 0x000002A8) Controls the operation of GPIO pin 170.                    */

