AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL170  : 4;            /*!< [3..0] Function select for GPIO pin 170                                   */
      __IOM uint32_t INPEN170   : 1;            /*!< [4..4] Input enable for GPIO 170                                          */
      __IOM uint32_t RDZERO170  : 1;            /*!< [5..5] Return 0 for read data on GPIO 170                                 */
      __IOM uint32_t IRPTEN170  : 2;            /*!< [7..6] Interrupt enable for GPIO 170                                      */
      __IOM uint32_t OUTCFG170  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 170                             */
      __IOM uint32_t DS170      : 2;            /*!< [11..10] Drive strength selection for GPIO 170                            */
      __IOM uint32_t SR170      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG170 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 170                       */
      __IOM uint32_t NCESRC170  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 170, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL170  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 170                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN170    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN170    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG170_b;
  } ;

  union {
    __IOM uint32_t PINCFG171;                   /*!< (@ 0x000002AC) Controls the operation of GPIO pin 171.                    */

    struct {
      __IOM uint32_t FNCSEL171  : 4;            /*!< [3..0] Function select for GPIO pin 171                                   */
      __IOM uint32_t INPEN171   : 1;            /*!< [4..4] Input enable for GPIO 171                                          */
      __IOM uint32_t RDZERO171  : 1;            /*!< [5..5] Return 0 for read data on GPIO 171                                 */
      __IOM uint32_t IRPTEN171  : 2;            /*!< [7..6] Interrupt enable for GPIO 171                                      */
      __IOM uint32_t OUTCFG171  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 171                             */
      __IOM uint32_t DS171      : 2;            /*!< [11..10] Drive strength selection for GPIO 171                            */
      __IOM uint32_t SR171      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG171 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 171                       */
      __IOM uint32_t NCESRC171  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 171, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL171  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 171                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN171    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN171    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG171_b;
  } ;

  union {
    __IOM uint32_t PINCFG172;                   /*!< (@ 0x000002B0) Controls the operation of GPIO pin 172.                    */

    struct {
      __IOM uint32_t FNCSEL172  : 4;            /*!< [3..0] Function select for GPIO pin 172                                   */
      __IOM uint32_t INPEN172   : 1;            /*!< [4..4] Input enable for GPIO 172                                          */
      __IOM uint32_t RDZERO172  : 1;            /*!< [5..5] Return 0 for read data on GPIO 172                                 */
      __IOM uint32_t IRPTEN172  : 2;            /*!< [7..6] Interrupt enable for GPIO 172                                      */
      __IOM uint32_t OUTCFG172  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 172                             */
      __IOM uint32_t DS172      : 2;            /*!< [11..10] Drive strength selection for GPIO 172                            */
      __IOM uint32_t SR172      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG172 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 172                       */
      __IOM uint32_t NCESRC172  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 172, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL172  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 172                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN172    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN172    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG172_b;
  } ;

  union {
    __IOM uint32_t PINCFG173;                   /*!< (@ 0x000002B4) Controls the operation of GPIO pin 173.                    */

