AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL173  : 4;            /*!< [3..0] Function select for GPIO pin 173                                   */
      __IOM uint32_t INPEN173   : 1;            /*!< [4..4] Input enable for GPIO 173                                          */
      __IOM uint32_t RDZERO173  : 1;            /*!< [5..5] Return 0 for read data on GPIO 173                                 */
      __IOM uint32_t IRPTEN173  : 2;            /*!< [7..6] Interrupt enable for GPIO 173                                      */
      __IOM uint32_t OUTCFG173  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 173                             */
      __IOM uint32_t DS173      : 2;            /*!< [11..10] Drive strength selection for GPIO 173                            */
      __IOM uint32_t SR173      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG173 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 173                       */
      __IOM uint32_t NCESRC173  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 173, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL173  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 173                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN173    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN173    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG173_b;
  } ;

  union {
    __IOM uint32_t PINCFG174;                   /*!< (@ 0x000002B8) Controls the operation of GPIO pin 174.                    */

    struct {
      __IOM uint32_t FNCSEL174  : 4;            /*!< [3..0] Function select for GPIO pin 174                                   */
      __IOM uint32_t INPEN174   : 1;            /*!< [4..4] Input enable for GPIO 174                                          */
      __IOM uint32_t RDZERO174  : 1;            /*!< [5..5] Return 0 for read data on GPIO 174                                 */
      __IOM uint32_t IRPTEN174  : 2;            /*!< [7..6] Interrupt enable for GPIO 174                                      */
      __IOM uint32_t OUTCFG174  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 174                             */
      __IOM uint32_t DS174      : 2;            /*!< [11..10] Drive strength selection for GPIO 174                            */
      __IOM uint32_t SR174      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG174 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 174                       */
      __IOM uint32_t NCESRC174  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 174, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL174  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 174                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN174    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN174    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG174_b;
  } ;

  union {
    __IOM uint32_t PINCFG175;                   /*!< (@ 0x000002BC) Controls the operation of GPIO pin 175.                    */

    struct {
      __IOM uint32_t FNCSEL175  : 4;            /*!< [3..0] Function select for GPIO pin 175                                   */
      __IOM uint32_t INPEN175   : 1;            /*!< [4..4] Input enable for GPIO 175                                          */
      __IOM uint32_t RDZERO175  : 1;            /*!< [5..5] Return 0 for read data on GPIO 175                                 */
      __IOM uint32_t IRPTEN175  : 2;            /*!< [7..6] Interrupt enable for GPIO 175                                      */
      __IOM uint32_t OUTCFG175  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 175                             */
      __IOM uint32_t DS175      : 2;            /*!< [11..10] Drive strength selection for GPIO 175                            */
      __IOM uint32_t SR175      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG175 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 175                       */
      __IOM uint32_t NCESRC175  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 175, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL175  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 175                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN175    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN175    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG175_b;
  } ;

  union {
    __IOM uint32_t PINCFG176;                   /*!< (@ 0x000002C0) Controls the operation of GPIO pin 176.                    */

