AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL176  : 4;            /*!< [3..0] Function select for GPIO pin 176                                   */
      __IOM uint32_t INPEN176   : 1;            /*!< [4..4] Input enable for GPIO 176                                          */
      __IOM uint32_t RDZERO176  : 1;            /*!< [5..5] Return 0 for read data on GPIO 176                                 */
      __IOM uint32_t IRPTEN176  : 2;            /*!< [7..6] Interrupt enable for GPIO 176                                      */
      __IOM uint32_t OUTCFG176  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 176                             */
      __IOM uint32_t DS176      : 2;            /*!< [11..10] Drive strength selection for GPIO 176                            */
      __IOM uint32_t SR176      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG176 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 176                       */
      __IOM uint32_t NCESRC176  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 176, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL176  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 176                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN176    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN176    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG176_b;
  } ;

  union {
    __IOM uint32_t PINCFG177;                   /*!< (@ 0x000002C4) Controls the operation of GPIO pin 177.                    */

    struct {
      __IOM uint32_t FNCSEL177  : 4;            /*!< [3..0] Function select for GPIO pin 177                                   */
      __IOM uint32_t INPEN177   : 1;            /*!< [4..4] Input enable for GPIO 177                                          */
      __IOM uint32_t RDZERO177  : 1;            /*!< [5..5] Return 0 for read data on GPIO 177                                 */
      __IOM uint32_t IRPTEN177  : 2;            /*!< [7..6] Interrupt enable for GPIO 177                                      */
      __IOM uint32_t OUTCFG177  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 177                             */
      __IOM uint32_t DS177      : 2;            /*!< [11..10] Drive strength selection for GPIO 177                            */
      __IOM uint32_t SR177      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG177 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 177                       */
      __IOM uint32_t NCESRC177  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 177, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL177  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 177                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN177    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN177    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG177_b;
  } ;

  union {
    __IOM uint32_t PINCFG178;                   /*!< (@ 0x000002C8) Controls the operation of GPIO pin 178.                    */

    struct {
      __IOM uint32_t FNCSEL178  : 4;            /*!< [3..0] Function select for GPIO pin 178                                   */
      __IOM uint32_t INPEN178   : 1;            /*!< [4..4] Input enable for GPIO 178                                          */
      __IOM uint32_t RDZERO178  : 1;            /*!< [5..5] Return 0 for read data on GPIO 178                                 */
      __IOM uint32_t IRPTEN178  : 2;            /*!< [7..6] Interrupt enable for GPIO 178                                      */
      __IOM uint32_t OUTCFG178  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 178                             */
      __IOM uint32_t DS178      : 2;            /*!< [11..10] Drive strength selection for GPIO 178                            */
      __IOM uint32_t SR178      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG178 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 178                       */
      __IOM uint32_t NCESRC178  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 178, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL178  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 178                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN178    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN178    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG178_b;
  } ;

  union {
    __IOM uint32_t PINCFG179;                   /*!< (@ 0x000002CC) Controls the operation of GPIO pin 179.                    */

