AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL179  : 4;            /*!< [3..0] Function select for GPIO pin 179                                   */
      __IOM uint32_t INPEN179   : 1;            /*!< [4..4] Input enable for GPIO 179                                          */
      __IOM uint32_t RDZERO179  : 1;            /*!< [5..5] Return 0 for read data on GPIO 179                                 */
      __IOM uint32_t IRPTEN179  : 2;            /*!< [7..6] Interrupt enable for GPIO 179                                      */
      __IOM uint32_t OUTCFG179  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 179                             */
      __IOM uint32_t DS179      : 2;            /*!< [11..10] Drive strength selection for GPIO 179                            */
      __IOM uint32_t SR179      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG179 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 179                       */
      __IOM uint32_t NCESRC179  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 179, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL179  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 179                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN179    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN179    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG179_b;
  } ;

  union {
    __IOM uint32_t PINCFG180;                   /*!< (@ 0x000002D0) Controls the operation of GPIO pin 180.                    */

    struct {
      __IOM uint32_t FNCSEL180  : 4;            /*!< [3..0] Function select for GPIO pin 180                                   */
      __IOM uint32_t INPEN180   : 1;            /*!< [4..4] Input enable for GPIO 180                                          */
      __IOM uint32_t RDZERO180  : 1;            /*!< [5..5] Return 0 for read data on GPIO 180                                 */
      __IOM uint32_t IRPTEN180  : 2;            /*!< [7..6] Interrupt enable for GPIO 180                                      */
      __IOM uint32_t OUTCFG180  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 180                             */
      __IOM uint32_t DS180      : 2;            /*!< [11..10] Drive strength selection for GPIO 180                            */
      __IOM uint32_t SR180      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG180 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 180                       */
      __IOM uint32_t NCESRC180  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 180, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL180  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 180                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN180    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN180    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG180_b;
  } ;

  union {
    __IOM uint32_t PINCFG181;                   /*!< (@ 0x000002D4) Controls the operation of GPIO pin 181.                    */

    struct {
      __IOM uint32_t FNCSEL181  : 4;            /*!< [3..0] Function select for GPIO pin 181                                   */
      __IOM uint32_t INPEN181   : 1;            /*!< [4..4] Input enable for GPIO 181                                          */
      __IOM uint32_t RDZERO181  : 1;            /*!< [5..5] Return 0 for read data on GPIO 181                                 */
      __IOM uint32_t IRPTEN181  : 2;            /*!< [7..6] Interrupt enable for GPIO 181                                      */
      __IOM uint32_t OUTCFG181  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 181                             */
      __IOM uint32_t DS181      : 2;            /*!< [11..10] Drive strength selection for GPIO 181                            */
      __IOM uint32_t SR181      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG181 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 181                       */
      __IOM uint32_t NCESRC181  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 181, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL181  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 181                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN181    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN181    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG181_b;
  } ;

  union {
    __IOM uint32_t PINCFG182;                   /*!< (@ 0x000002D8) Controls the operation of GPIO pin 182.                    */

