AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL182  : 4;            /*!< [3..0] Function select for GPIO pin 182                                   */
      __IOM uint32_t INPEN182   : 1;            /*!< [4..4] Input enable for GPIO 182                                          */
      __IOM uint32_t RDZERO182  : 1;            /*!< [5..5] Return 0 for read data on GPIO 182                                 */
      __IOM uint32_t IRPTEN182  : 2;            /*!< [7..6] Interrupt enable for GPIO 182                                      */
      __IOM uint32_t OUTCFG182  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 182                             */
      __IOM uint32_t DS182      : 2;            /*!< [11..10] Drive strength selection for GPIO 182                            */
      __IOM uint32_t SR182      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG182 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 182                       */
      __IOM uint32_t NCESRC182  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 182, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL182  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 182                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN182    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN182    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG182_b;
  } ;

  union {
    __IOM uint32_t PINCFG183;                   /*!< (@ 0x000002DC) Controls the operation of GPIO pin 183.                    */

    struct {
      __IOM uint32_t FNCSEL183  : 4;            /*!< [3..0] Function select for GPIO pin 183                                   */
      __IOM uint32_t INPEN183   : 1;            /*!< [4..4] Input enable for GPIO 183                                          */
      __IOM uint32_t RDZERO183  : 1;            /*!< [5..5] Return 0 for read data on GPIO 183                                 */
      __IOM uint32_t IRPTEN183  : 2;            /*!< [7..6] Interrupt enable for GPIO 183                                      */
      __IOM uint32_t OUTCFG183  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 183                             */
      __IOM uint32_t DS183      : 2;            /*!< [11..10] Drive strength selection for GPIO 183                            */
      __IOM uint32_t SR183      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG183 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 183                       */
      __IOM uint32_t NCESRC183  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 183, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL183  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 183                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN183    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN183    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG183_b;
  } ;

  union {
    __IOM uint32_t PINCFG184;                   /*!< (@ 0x000002E0) Controls the operation of GPIO pin 184.                    */

    struct {
      __IOM uint32_t FNCSEL184  : 4;            /*!< [3..0] Function select for GPIO pin 184                                   */
      __IOM uint32_t INPEN184   : 1;            /*!< [4..4] Input enable for GPIO 184                                          */
      __IOM uint32_t RDZERO184  : 1;            /*!< [5..5] Return 0 for read data on GPIO 184                                 */
      __IOM uint32_t IRPTEN184  : 2;            /*!< [7..6] Interrupt enable for GPIO 184                                      */
      __IOM uint32_t OUTCFG184  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 184                             */
      __IOM uint32_t DS184      : 2;            /*!< [11..10] Drive strength selection for GPIO 184                            */
      __IOM uint32_t SR184      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG184 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 184                       */
      __IOM uint32_t NCESRC184  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 184, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL184  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 184                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN184    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN184    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG184_b;
  } ;

  union {
    __IOM uint32_t PINCFG185;                   /*!< (@ 0x000002E4) Controls the operation of GPIO pin 185.                    */

