AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL185  : 4;            /*!< [3..0] Function select for GPIO pin 185                                   */
      __IOM uint32_t INPEN185   : 1;            /*!< [4..4] Input enable for GPIO 185                                          */
      __IOM uint32_t RDZERO185  : 1;            /*!< [5..5] Return 0 for read data on GPIO 185                                 */
      __IOM uint32_t IRPTEN185  : 2;            /*!< [7..6] Interrupt enable for GPIO 185                                      */
      __IOM uint32_t OUTCFG185  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 185                             */
      __IOM uint32_t DS185      : 2;            /*!< [11..10] Drive strength selection for GPIO 185                            */
      __IOM uint32_t SR185      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG185 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 185                       */
      __IOM uint32_t NCESRC185  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 185, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL185  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 185                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN185    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN185    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG185_b;
  } ;

  union {
    __IOM uint32_t PINCFG186;                   /*!< (@ 0x000002E8) Controls the operation of GPIO pin 186.                    */

    struct {
      __IOM uint32_t FNCSEL186  : 4;            /*!< [3..0] Function select for GPIO pin 186                                   */
      __IOM uint32_t INPEN186   : 1;            /*!< [4..4] Input enable for GPIO 186                                          */
      __IOM uint32_t RDZERO186  : 1;            /*!< [5..5] Return 0 for read data on GPIO 186                                 */
      __IOM uint32_t IRPTEN186  : 2;            /*!< [7..6] Interrupt enable for GPIO 186                                      */
      __IOM uint32_t OUTCFG186  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 186                             */
      __IOM uint32_t DS186      : 2;            /*!< [11..10] Drive strength selection for GPIO 186                            */
      __IOM uint32_t SR186      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG186 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 186                       */
      __IOM uint32_t NCESRC186  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 186, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL186  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 186                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN186    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN186    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG186_b;
  } ;

  union {
    __IOM uint32_t PINCFG187;                   /*!< (@ 0x000002EC) Controls the operation of GPIO pin 187.                    */

    struct {
      __IOM uint32_t FNCSEL187  : 4;            /*!< [3..0] Function select for GPIO pin 187                                   */
      __IOM uint32_t INPEN187   : 1;            /*!< [4..4] Input enable for GPIO 187                                          */
      __IOM uint32_t RDZERO187  : 1;            /*!< [5..5] Return 0 for read data on GPIO 187                                 */
      __IOM uint32_t IRPTEN187  : 2;            /*!< [7..6] Interrupt enable for GPIO 187                                      */
      __IOM uint32_t OUTCFG187  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 187                             */
      __IOM uint32_t DS187      : 2;            /*!< [11..10] Drive strength selection for GPIO 187                            */
      __IOM uint32_t SR187      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG187 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 187                       */
      __IOM uint32_t NCESRC187  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 187, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL187  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 187                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN187    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN187    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG187_b;
  } ;

  union {
    __IOM uint32_t PINCFG188;                   /*!< (@ 0x000002F0) Controls the operation of GPIO pin 188.                    */

