AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL188  : 4;            /*!< [3..0] Function select for GPIO pin 188                                   */
      __IOM uint32_t INPEN188   : 1;            /*!< [4..4] Input enable for GPIO 188                                          */
      __IOM uint32_t RDZERO188  : 1;            /*!< [5..5] Return 0 for read data on GPIO 188                                 */
      __IOM uint32_t IRPTEN188  : 2;            /*!< [7..6] Interrupt enable for GPIO 188                                      */
      __IOM uint32_t OUTCFG188  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 188                             */
      __IOM uint32_t DS188      : 2;            /*!< [11..10] Drive strength selection for GPIO 188                            */
      __IOM uint32_t SR188      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG188 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 188                       */
      __IOM uint32_t NCESRC188  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 188, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL188  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 188                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN188    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN188    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG188_b;
  } ;

  union {
    __IOM uint32_t PINCFG189;                   /*!< (@ 0x000002F4) Controls the operation of GPIO pin 189.                    */

    struct {
      __IOM uint32_t FNCSEL189  : 4;            /*!< [3..0] Function select for GPIO pin 189                                   */
      __IOM uint32_t INPEN189   : 1;            /*!< [4..4] Input enable for GPIO 189                                          */
      __IOM uint32_t RDZERO189  : 1;            /*!< [5..5] Return 0 for read data on GPIO 189                                 */
      __IOM uint32_t IRPTEN189  : 2;            /*!< [7..6] Interrupt enable for GPIO 189                                      */
      __IOM uint32_t OUTCFG189  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 189                             */
      __IOM uint32_t DS189      : 2;            /*!< [11..10] Drive strength selection for GPIO 189                            */
      __IOM uint32_t SR189      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG189 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 189                       */
      __IOM uint32_t NCESRC189  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 189, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL189  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 189                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN189    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN189    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG189_b;
  } ;

  union {
    __IOM uint32_t PINCFG190;                   /*!< (@ 0x000002F8) Controls the operation of GPIO pin 190.                    */

    struct {
      __IOM uint32_t FNCSEL190  : 4;            /*!< [3..0] Function select for GPIO pin 190                                   */
      __IOM uint32_t INPEN190   : 1;            /*!< [4..4] Input enable for GPIO 190                                          */
      __IOM uint32_t RDZERO190  : 1;            /*!< [5..5] Return 0 for read data on GPIO 190                                 */
      __IOM uint32_t IRPTEN190  : 2;            /*!< [7..6] Interrupt enable for GPIO 190                                      */
      __IOM uint32_t OUTCFG190  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 190                             */
      __IOM uint32_t DS190      : 2;            /*!< [11..10] Drive strength selection for GPIO 190                            */
      __IOM uint32_t SR190      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG190 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 190                       */
      __IOM uint32_t NCESRC190  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 190, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL190  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 190                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN190    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN190    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG190_b;
  } ;

  union {
    __IOM uint32_t PINCFG191;                   /*!< (@ 0x000002FC) Controls the operation of GPIO pin 191.                    */

