AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL191  : 4;            /*!< [3..0] Function select for GPIO pin 191                                   */
      __IOM uint32_t INPEN191   : 1;            /*!< [4..4] Input enable for GPIO 191                                          */
      __IOM uint32_t RDZERO191  : 1;            /*!< [5..5] Return 0 for read data on GPIO 191                                 */
      __IOM uint32_t IRPTEN191  : 2;            /*!< [7..6] Interrupt enable for GPIO 191                                      */
      __IOM uint32_t OUTCFG191  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 191                             */
      __IOM uint32_t DS191      : 2;            /*!< [11..10] Drive strength selection for GPIO 191                            */
      __IOM uint32_t SR191      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG191 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 191                       */
      __IOM uint32_t NCESRC191  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 191, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL191  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 191                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN191    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN191    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG191_b;
  } ;

  union {
    __IOM uint32_t PINCFG192;                   /*!< (@ 0x00000300) Controls the operation of GPIO pin 192.                    */

    struct {
      __IOM uint32_t FNCSEL192  : 4;            /*!< [3..0] Function select for GPIO pin 192                                   */
      __IOM uint32_t INPEN192   : 1;            /*!< [4..4] Input enable for GPIO 192                                          */
      __IOM uint32_t RDZERO192  : 1;            /*!< [5..5] Return 0 for read data on GPIO 192                                 */
      __IOM uint32_t IRPTEN192  : 2;            /*!< [7..6] Interrupt enable for GPIO 192                                      */
      __IOM uint32_t OUTCFG192  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 192                             */
      __IOM uint32_t DS192      : 2;            /*!< [11..10] Drive strength selection for GPIO 192                            */
      __IOM uint32_t SR192      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG192 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 192                       */
      __IOM uint32_t NCESRC192  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 192, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL192  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 192                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN192    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN192    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG192_b;
  } ;

  union {
    __IOM uint32_t PINCFG193;                   /*!< (@ 0x00000304) Controls the operation of GPIO pin 193.                    */

    struct {
      __IOM uint32_t FNCSEL193  : 4;            /*!< [3..0] Function select for GPIO pin 193                                   */
      __IOM uint32_t INPEN193   : 1;            /*!< [4..4] Input enable for GPIO 193                                          */
      __IOM uint32_t RDZERO193  : 1;            /*!< [5..5] Return 0 for read data on GPIO 193                                 */
      __IOM uint32_t IRPTEN193  : 2;            /*!< [7..6] Interrupt enable for GPIO 193                                      */
      __IOM uint32_t OUTCFG193  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 193                             */
      __IOM uint32_t DS193      : 2;            /*!< [11..10] Drive strength selection for GPIO 193                            */
      __IOM uint32_t SR193      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG193 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 193                       */
      __IOM uint32_t NCESRC193  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 193, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL193  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 193                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN193    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN193    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG193_b;
  } ;

  union {
    __IOM uint32_t PINCFG194;                   /*!< (@ 0x00000308) Controls the operation of GPIO pin 194.                    */

