AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL194  : 4;            /*!< [3..0] Function select for GPIO pin 194                                   */
      __IOM uint32_t INPEN194   : 1;            /*!< [4..4] Input enable for GPIO 194                                          */
      __IOM uint32_t RDZERO194  : 1;            /*!< [5..5] Return 0 for read data on GPIO 194                                 */
      __IOM uint32_t IRPTEN194  : 2;            /*!< [7..6] Interrupt enable for GPIO 194                                      */
      __IOM uint32_t OUTCFG194  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 194                             */
      __IOM uint32_t DS194      : 2;            /*!< [11..10] Drive strength selection for GPIO 194                            */
      __IOM uint32_t SR194      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG194 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 194                       */
      __IOM uint32_t NCESRC194  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 194, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL194  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 194                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN194    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN194    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG194_b;
  } ;

  union {
    __IOM uint32_t PINCFG195;                   /*!< (@ 0x0000030C) Controls the operation of GPIO pin 195.                    */

    struct {
      __IOM uint32_t FNCSEL195  : 4;            /*!< [3..0] Function select for GPIO pin 195                                   */
      __IOM uint32_t INPEN195   : 1;            /*!< [4..4] Input enable for GPIO 195                                          */
      __IOM uint32_t RDZERO195  : 1;            /*!< [5..5] Return 0 for read data on GPIO 195                                 */
      __IOM uint32_t IRPTEN195  : 2;            /*!< [7..6] Interrupt enable for GPIO 195                                      */
      __IOM uint32_t OUTCFG195  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 195                             */
      __IOM uint32_t DS195      : 2;            /*!< [11..10] Drive strength selection for GPIO 195                            */
      __IOM uint32_t SR195      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG195 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 195                       */
      __IOM uint32_t NCESRC195  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 195, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL195  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 195                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN195    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN195    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG195_b;
  } ;

  union {
    __IOM uint32_t PINCFG196;                   /*!< (@ 0x00000310) Controls the operation of GPIO pin 196.                    */

    struct {
      __IOM uint32_t FNCSEL196  : 4;            /*!< [3..0] Function select for GPIO pin 196                                   */
      __IOM uint32_t INPEN196   : 1;            /*!< [4..4] Input enable for GPIO 196                                          */
      __IOM uint32_t RDZERO196  : 1;            /*!< [5..5] Return 0 for read data on GPIO 196                                 */
      __IOM uint32_t IRPTEN196  : 2;            /*!< [7..6] Interrupt enable for GPIO 196                                      */
      __IOM uint32_t OUTCFG196  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 196                             */
      __IOM uint32_t DS196      : 2;            /*!< [11..10] Drive strength selection for GPIO 196                            */
      __IOM uint32_t SR196      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG196 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 196                       */
      __IOM uint32_t NCESRC196  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 196, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL196  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 196                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN196    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN196    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG196_b;
  } ;

  union {
    __IOM uint32_t PINCFG197;                   /*!< (@ 0x00000314) Controls the operation of GPIO pin 197.                    */

