AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL197  : 4;            /*!< [3..0] Function select for GPIO pin 197                                   */
      __IOM uint32_t INPEN197   : 1;            /*!< [4..4] Input enable for GPIO 197                                          */
      __IOM uint32_t RDZERO197  : 1;            /*!< [5..5] Return 0 for read data on GPIO 197                                 */
      __IOM uint32_t IRPTEN197  : 2;            /*!< [7..6] Interrupt enable for GPIO 197                                      */
      __IOM uint32_t OUTCFG197  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 197                             */
      __IOM uint32_t DS197      : 2;            /*!< [11..10] Drive strength selection for GPIO 197                            */
      __IOM uint32_t SR197      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG197 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 197                       */
      __IOM uint32_t NCESRC197  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 197, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL197  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 197                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN197    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN197    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG197_b;
  } ;

  union {
    __IOM uint32_t PINCFG198;                   /*!< (@ 0x00000318) Controls the operation of GPIO pin 198.                    */

    struct {
      __IOM uint32_t FNCSEL198  : 4;            /*!< [3..0] Function select for GPIO pin 198                                   */
      __IOM uint32_t INPEN198   : 1;            /*!< [4..4] Input enable for GPIO 198                                          */
      __IOM uint32_t RDZERO198  : 1;            /*!< [5..5] Return 0 for read data on GPIO 198                                 */
      __IOM uint32_t IRPTEN198  : 2;            /*!< [7..6] Interrupt enable for GPIO 198                                      */
      __IOM uint32_t OUTCFG198  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 198                             */
      __IOM uint32_t DS198      : 2;            /*!< [11..10] Drive strength selection for GPIO 198                            */
      __IOM uint32_t SR198      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG198 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 198                       */
      __IOM uint32_t NCESRC198  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 198, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL198  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 198                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN198    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN198    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG198_b;
  } ;

  union {
    __IOM uint32_t PINCFG199;                   /*!< (@ 0x0000031C) Controls the operation of GPIO pin 199.                    */

    struct {
      __IOM uint32_t FNCSEL199  : 4;            /*!< [3..0] Function select for GPIO pin 199                                   */
      __IOM uint32_t INPEN199   : 1;            /*!< [4..4] Input enable for GPIO 199                                          */
      __IOM uint32_t RDZERO199  : 1;            /*!< [5..5] Return 0 for read data on GPIO 199                                 */
      __IOM uint32_t IRPTEN199  : 2;            /*!< [7..6] Interrupt enable for GPIO 199                                      */
      __IOM uint32_t OUTCFG199  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 199                             */
      __IOM uint32_t DS199      : 2;            /*!< [11..10] Drive strength selection for GPIO 199                            */
      __IOM uint32_t SR199      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG199 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 199                       */
      __IOM uint32_t NCESRC199  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 199, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL199  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 199                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN199    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN199    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG199_b;
  } ;

  union {
    __IOM uint32_t PINCFG200;                   /*!< (@ 0x00000320) Controls the operation of GPIO pin 200.                    */

