AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL200  : 4;            /*!< [3..0] Function select for GPIO pin 200                                   */
      __IOM uint32_t INPEN200   : 1;            /*!< [4..4] Input enable for GPIO 200                                          */
      __IOM uint32_t RDZERO200  : 1;            /*!< [5..5] Return 0 for read data on GPIO 200                                 */
      __IOM uint32_t IRPTEN200  : 2;            /*!< [7..6] Interrupt enable for GPIO 200                                      */
      __IOM uint32_t OUTCFG200  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 200                             */
      __IOM uint32_t DS200      : 2;            /*!< [11..10] Drive strength selection for GPIO 200                            */
      __IOM uint32_t SR200      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG200 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 200                       */
      __IOM uint32_t NCESRC200  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 200, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL200  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 200                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN200    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN200    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG200_b;
  } ;

  union {
    __IOM uint32_t PINCFG201;                   /*!< (@ 0x00000324) Controls the operation of GPIO pin 201.                    */

    struct {
      __IOM uint32_t FNCSEL201  : 4;            /*!< [3..0] Function select for GPIO pin 201                                   */
      __IOM uint32_t INPEN201   : 1;            /*!< [4..4] Input enable for GPIO 201                                          */
      __IOM uint32_t RDZERO201  : 1;            /*!< [5..5] Return 0 for read data on GPIO 201                                 */
      __IOM uint32_t IRPTEN201  : 2;            /*!< [7..6] Interrupt enable for GPIO 201                                      */
      __IOM uint32_t OUTCFG201  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 201                             */
      __IOM uint32_t DS201      : 2;            /*!< [11..10] Drive strength selection for GPIO 201                            */
      __IOM uint32_t SR201      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG201 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 201                       */
      __IOM uint32_t NCESRC201  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 201, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL201  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 201                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN201    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN201    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG201_b;
  } ;

  union {
    __IOM uint32_t PINCFG202;                   /*!< (@ 0x00000328) Controls the operation of GPIO pin 202.                    */

    struct {
      __IOM uint32_t FNCSEL202  : 4;            /*!< [3..0] Function select for GPIO pin 202                                   */
      __IOM uint32_t INPEN202   : 1;            /*!< [4..4] Input enable for GPIO 202                                          */
      __IOM uint32_t RDZERO202  : 1;            /*!< [5..5] Return 0 for read data on GPIO 202                                 */
      __IOM uint32_t IRPTEN202  : 2;            /*!< [7..6] Interrupt enable for GPIO 202                                      */
      __IOM uint32_t OUTCFG202  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 202                             */
      __IOM uint32_t DS202      : 2;            /*!< [11..10] Drive strength selection for GPIO 202                            */
      __IOM uint32_t SR202      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG202 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 202                       */
      __IOM uint32_t NCESRC202  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 202, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL202  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 202                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN202    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN202    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG202_b;
  } ;

  union {
    __IOM uint32_t PINCFG203;                   /*!< (@ 0x0000032C) Controls the operation of GPIO pin 203.                    */

