AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL203  : 4;            /*!< [3..0] Function select for GPIO pin 203                                   */
      __IOM uint32_t INPEN203   : 1;            /*!< [4..4] Input enable for GPIO 203                                          */
      __IOM uint32_t RDZERO203  : 1;            /*!< [5..5] Return 0 for read data on GPIO 203                                 */
      __IOM uint32_t IRPTEN203  : 2;            /*!< [7..6] Interrupt enable for GPIO 203                                      */
      __IOM uint32_t OUTCFG203  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 203                             */
      __IOM uint32_t DS203      : 2;            /*!< [11..10] Drive strength selection for GPIO 203                            */
      __IOM uint32_t SR203      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG203 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 203                       */
      __IOM uint32_t NCESRC203  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 203, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL203  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 203                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN203    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN203    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG203_b;
  } ;

  union {
    __IOM uint32_t PINCFG204;                   /*!< (@ 0x00000330) Controls the operation of GPIO pin 204.                    */

    struct {
      __IOM uint32_t FNCSEL204  : 4;            /*!< [3..0] Function select for GPIO pin 204                                   */
      __IOM uint32_t INPEN204   : 1;            /*!< [4..4] Input enable for GPIO 204                                          */
      __IOM uint32_t RDZERO204  : 1;            /*!< [5..5] Return 0 for read data on GPIO 204                                 */
      __IOM uint32_t IRPTEN204  : 2;            /*!< [7..6] Interrupt enable for GPIO 204                                      */
      __IOM uint32_t OUTCFG204  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 204                             */
      __IOM uint32_t DS204      : 2;            /*!< [11..10] Drive strength selection for GPIO 204                            */
      __IOM uint32_t SR204      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG204 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 204                       */
      __IOM uint32_t NCESRC204  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 204, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL204  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 204                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN204    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN204    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG204_b;
  } ;

  union {
    __IOM uint32_t PINCFG205;                   /*!< (@ 0x00000334) Controls the operation of GPIO pin 205.                    */

    struct {
      __IOM uint32_t FNCSEL205  : 4;            /*!< [3..0] Function select for GPIO pin 205                                   */
      __IOM uint32_t INPEN205   : 1;            /*!< [4..4] Input enable for GPIO 205                                          */
      __IOM uint32_t RDZERO205  : 1;            /*!< [5..5] Return 0 for read data on GPIO 205                                 */
      __IOM uint32_t IRPTEN205  : 2;            /*!< [7..6] Interrupt enable for GPIO 205                                      */
      __IOM uint32_t OUTCFG205  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 205                             */
      __IOM uint32_t DS205      : 2;            /*!< [11..10] Drive strength selection for GPIO 205                            */
      __IOM uint32_t SR205      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG205 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 205                       */
      __IOM uint32_t NCESRC205  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 205, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL205  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 205                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN205    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN205    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG205_b;
  } ;

  union {
    __IOM uint32_t PINCFG206;                   /*!< (@ 0x00000338) Controls the operation of GPIO pin 206.                    */

