AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL206  : 4;            /*!< [3..0] Function select for GPIO pin 206                                   */
      __IOM uint32_t INPEN206   : 1;            /*!< [4..4] Input enable for GPIO 206                                          */
      __IOM uint32_t RDZERO206  : 1;            /*!< [5..5] Return 0 for read data on GPIO 206                                 */
      __IOM uint32_t IRPTEN206  : 2;            /*!< [7..6] Interrupt enable for GPIO 206                                      */
      __IOM uint32_t OUTCFG206  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 206                             */
      __IOM uint32_t DS206      : 2;            /*!< [11..10] Drive strength selection for GPIO 206                            */
      __IOM uint32_t SR206      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG206 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 206                       */
      __IOM uint32_t NCESRC206  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 206, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL206  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 206                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN206    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN206    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG206_b;
  } ;

  union {
    __IOM uint32_t PINCFG207;                   /*!< (@ 0x0000033C) Controls the operation of GPIO pin 207.                    */

    struct {
      __IOM uint32_t FNCSEL207  : 4;            /*!< [3..0] Function select for GPIO pin 207                                   */
      __IOM uint32_t INPEN207   : 1;            /*!< [4..4] Input enable for GPIO 207                                          */
      __IOM uint32_t RDZERO207  : 1;            /*!< [5..5] Return 0 for read data on GPIO 207                                 */
      __IOM uint32_t IRPTEN207  : 2;            /*!< [7..6] Interrupt enable for GPIO 207                                      */
      __IOM uint32_t OUTCFG207  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 207                             */
      __IOM uint32_t DS207      : 2;            /*!< [11..10] Drive strength selection for GPIO 207                            */
      __IOM uint32_t SR207      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG207 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 207                       */
      __IOM uint32_t NCESRC207  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 207, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL207  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 207                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN207    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN207    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG207_b;
  } ;

  union {
    __IOM uint32_t PINCFG208;                   /*!< (@ 0x00000340) Controls the operation of GPIO pin 208.                    */

    struct {
      __IOM uint32_t FNCSEL208  : 4;            /*!< [3..0] Function select for GPIO pin 208                                   */
      __IOM uint32_t INPEN208   : 1;            /*!< [4..4] Input enable for GPIO 208                                          */
      __IOM uint32_t RDZERO208  : 1;            /*!< [5..5] Return 0 for read data on GPIO 208                                 */
      __IOM uint32_t IRPTEN208  : 2;            /*!< [7..6] Interrupt enable for GPIO 208                                      */
      __IOM uint32_t OUTCFG208  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 208                             */
      __IOM uint32_t DS208      : 2;            /*!< [11..10] Drive strength selection for GPIO 208                            */
      __IOM uint32_t SR208      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG208 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 208                       */
      __IOM uint32_t NCESRC208  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 208, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL208  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 208                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN208    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN208    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG208_b;
  } ;

  union {
    __IOM uint32_t PINCFG209;                   /*!< (@ 0x00000344) Controls the operation of GPIO pin 209.                    */

