AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL209  : 4;            /*!< [3..0] Function select for GPIO pin 209                                   */
      __IOM uint32_t INPEN209   : 1;            /*!< [4..4] Input enable for GPIO 209                                          */
      __IOM uint32_t RDZERO209  : 1;            /*!< [5..5] Return 0 for read data on GPIO 209                                 */
      __IOM uint32_t IRPTEN209  : 2;            /*!< [7..6] Interrupt enable for GPIO 209                                      */
      __IOM uint32_t OUTCFG209  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 209                             */
      __IOM uint32_t DS209      : 2;            /*!< [11..10] Drive strength selection for GPIO 209                            */
      __IOM uint32_t SR209      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG209 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 209                       */
      __IOM uint32_t NCESRC209  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 209, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL209  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 209                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN209    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN209    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG209_b;
  } ;

  union {
    __IOM uint32_t PINCFG210;                   /*!< (@ 0x00000348) Controls the operation of GPIO pin 210.                    */

    struct {
      __IOM uint32_t FNCSEL210  : 4;            /*!< [3..0] Function select for GPIO pin 210                                   */
      __IOM uint32_t INPEN210   : 1;            /*!< [4..4] Input enable for GPIO 210                                          */
      __IOM uint32_t RDZERO210  : 1;            /*!< [5..5] Return 0 for read data on GPIO 210                                 */
      __IOM uint32_t IRPTEN210  : 2;            /*!< [7..6] Interrupt enable for GPIO 210                                      */
      __IOM uint32_t OUTCFG210  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 210                             */
      __IOM uint32_t DS210      : 2;            /*!< [11..10] Drive strength selection for GPIO 210                            */
      __IOM uint32_t SR210      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG210 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 210                       */
      __IOM uint32_t NCESRC210  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 210, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL210  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 210                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN210    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN210    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG210_b;
  } ;

  union {
    __IOM uint32_t PINCFG211;                   /*!< (@ 0x0000034C) Controls the operation of GPIO pin 211.                    */

    struct {
      __IOM uint32_t FNCSEL211  : 4;            /*!< [3..0] Function select for GPIO pin 211                                   */
      __IOM uint32_t INPEN211   : 1;            /*!< [4..4] Input enable for GPIO 211                                          */
      __IOM uint32_t RDZERO211  : 1;            /*!< [5..5] Return 0 for read data on GPIO 211                                 */
      __IOM uint32_t IRPTEN211  : 2;            /*!< [7..6] Interrupt enable for GPIO 211                                      */
      __IOM uint32_t OUTCFG211  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 211                             */
      __IOM uint32_t DS211      : 2;            /*!< [11..10] Drive strength selection for GPIO 211                            */
      __IOM uint32_t SR211      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG211 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 211                       */
      __IOM uint32_t NCESRC211  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 211, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL211  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 211                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN211    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN211    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG211_b;
  } ;

  union {
    __IOM uint32_t PINCFG212;                   /*!< (@ 0x00000350) Controls the operation of GPIO pin 212.                    */

