AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL212  : 4;            /*!< [3..0] Function select for GPIO pin 212                                   */
      __IOM uint32_t INPEN212   : 1;            /*!< [4..4] Input enable for GPIO 212                                          */
      __IOM uint32_t RDZERO212  : 1;            /*!< [5..5] Return 0 for read data on GPIO 212                                 */
      __IOM uint32_t IRPTEN212  : 2;            /*!< [7..6] Interrupt enable for GPIO 212                                      */
      __IOM uint32_t OUTCFG212  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 212                             */
      __IOM uint32_t DS212      : 2;            /*!< [11..10] Drive strength selection for GPIO 212                            */
      __IOM uint32_t SR212      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG212 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 212                       */
      __IOM uint32_t NCESRC212  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 212, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL212  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 212                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN212    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN212    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG212_b;
  } ;

  union {
    __IOM uint32_t PINCFG213;                   /*!< (@ 0x00000354) Controls the operation of GPIO pin 213.                    */

    struct {
      __IOM uint32_t FNCSEL213  : 4;            /*!< [3..0] Function select for GPIO pin 213                                   */
      __IOM uint32_t INPEN213   : 1;            /*!< [4..4] Input enable for GPIO 213                                          */
      __IOM uint32_t RDZERO213  : 1;            /*!< [5..5] Return 0 for read data on GPIO 213                                 */
      __IOM uint32_t IRPTEN213  : 2;            /*!< [7..6] Interrupt enable for GPIO 213                                      */
      __IOM uint32_t OUTCFG213  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 213                             */
      __IOM uint32_t DS213      : 2;            /*!< [11..10] Drive strength selection for GPIO 213                            */
      __IOM uint32_t SR213      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG213 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 213                       */
      __IOM uint32_t NCESRC213  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 213, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL213  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 213                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN213    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN213    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG213_b;
  } ;

  union {
    __IOM uint32_t PINCFG214;                   /*!< (@ 0x00000358) Controls the operation of GPIO pin 214.                    */

    struct {
      __IOM uint32_t FNCSEL214  : 4;            /*!< [3..0] Function select for GPIO pin 214                                   */
      __IOM uint32_t INPEN214   : 1;            /*!< [4..4] Input enable for GPIO 214                                          */
      __IOM uint32_t RDZERO214  : 1;            /*!< [5..5] Return 0 for read data on GPIO 214                                 */
      __IOM uint32_t IRPTEN214  : 2;            /*!< [7..6] Interrupt enable for GPIO 214                                      */
      __IOM uint32_t OUTCFG214  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 214                             */
      __IOM uint32_t DS214      : 2;            /*!< [11..10] Drive strength selection for GPIO 214                            */
      __IOM uint32_t SR214      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG214 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 214                       */
      __IOM uint32_t NCESRC214  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 214, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL214  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 214                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN214    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN214    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG214_b;
  } ;

  union {
    __IOM uint32_t PINCFG215;                   /*!< (@ 0x0000035C) Controls the operation of GPIO pin 215.                    */

