AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL215  : 4;            /*!< [3..0] Function select for GPIO pin 215                                   */
      __IOM uint32_t INPEN215   : 1;            /*!< [4..4] Input enable for GPIO 215                                          */
      __IOM uint32_t RDZERO215  : 1;            /*!< [5..5] Return 0 for read data on GPIO 215                                 */
      __IOM uint32_t IRPTEN215  : 2;            /*!< [7..6] Interrupt enable for GPIO 215                                      */
      __IOM uint32_t OUTCFG215  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 215                             */
      __IOM uint32_t DS215      : 2;            /*!< [11..10] Drive strength selection for GPIO 215                            */
      __IOM uint32_t SR215      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG215 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 215                       */
      __IOM uint32_t NCESRC215  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 215, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL215  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 215                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN215    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN215    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG215_b;
  } ;

  union {
    __IOM uint32_t PINCFG216;                   /*!< (@ 0x00000360) Controls the operation of GPIO pin 216.                    */

    struct {
      __IOM uint32_t FNCSEL216  : 4;            /*!< [3..0] Function select for GPIO pin 216                                   */
      __IOM uint32_t INPEN216   : 1;            /*!< [4..4] Input enable for GPIO 216                                          */
      __IOM uint32_t RDZERO216  : 1;            /*!< [5..5] Return 0 for read data on GPIO 216                                 */
      __IOM uint32_t IRPTEN216  : 2;            /*!< [7..6] Interrupt enable for GPIO 216                                      */
      __IOM uint32_t OUTCFG216  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 216                             */
      __IOM uint32_t DS216      : 2;            /*!< [11..10] Drive strength selection for GPIO 216                            */
      __IOM uint32_t SR216      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG216 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 216                       */
      __IOM uint32_t NCESRC216  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 216, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL216  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 216                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN216    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN216    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG216_b;
  } ;

  union {
    __IOM uint32_t PINCFG217;                   /*!< (@ 0x00000364) Controls the operation of GPIO pin 217.                    */

    struct {
      __IOM uint32_t FNCSEL217  : 4;            /*!< [3..0] Function select for GPIO pin 217                                   */
      __IOM uint32_t INPEN217   : 1;            /*!< [4..4] Input enable for GPIO 217                                          */
      __IOM uint32_t RDZERO217  : 1;            /*!< [5..5] Return 0 for read data on GPIO 217                                 */
      __IOM uint32_t IRPTEN217  : 2;            /*!< [7..6] Interrupt enable for GPIO 217                                      */
      __IOM uint32_t OUTCFG217  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 217                             */
      __IOM uint32_t DS217      : 2;            /*!< [11..10] Drive strength selection for GPIO 217                            */
      __IOM uint32_t SR217      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG217 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 217                       */
      __IOM uint32_t NCESRC217  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 217, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL217  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 217                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN217    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN217    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG217_b;
  } ;

  union {
    __IOM uint32_t PINCFG218;                   /*!< (@ 0x00000368) Controls the operation of GPIO pin 218.                    */

