AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL218  : 4;            /*!< [3..0] Function select for GPIO pin 218                                   */
      __IOM uint32_t INPEN218   : 1;            /*!< [4..4] Input enable for GPIO 218                                          */
      __IOM uint32_t RDZERO218  : 1;            /*!< [5..5] Return 0 for read data on GPIO 218                                 */
      __IOM uint32_t IRPTEN218  : 2;            /*!< [7..6] Interrupt enable for GPIO 218                                      */
      __IOM uint32_t OUTCFG218  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 218                             */
      __IOM uint32_t DS218      : 2;            /*!< [11..10] Drive strength selection for GPIO 218                            */
      __IOM uint32_t SR218      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG218 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 218                       */
      __IOM uint32_t NCESRC218  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 218, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL218  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 218                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN218    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN218    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG218_b;
  } ;

  union {
    __IOM uint32_t PINCFG219;                   /*!< (@ 0x0000036C) Controls the operation of GPIO pin 219.                    */

    struct {
      __IOM uint32_t FNCSEL219  : 4;            /*!< [3..0] Function select for GPIO pin 219                                   */
      __IOM uint32_t INPEN219   : 1;            /*!< [4..4] Input enable for GPIO 219                                          */
      __IOM uint32_t RDZERO219  : 1;            /*!< [5..5] Return 0 for read data on GPIO 219                                 */
      __IOM uint32_t IRPTEN219  : 2;            /*!< [7..6] Interrupt enable for GPIO 219                                      */
      __IOM uint32_t OUTCFG219  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 219                             */
      __IOM uint32_t DS219      : 2;            /*!< [11..10] Drive strength selection for GPIO 219                            */
      __IOM uint32_t SR219      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG219 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 219                       */
      __IOM uint32_t NCESRC219  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 219, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL219  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 219                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN219    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN219    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG219_b;
  } ;

  union {
    __IOM uint32_t PINCFG220;                   /*!< (@ 0x00000370) Controls the operation of GPIO pin 220.                    */

    struct {
      __IOM uint32_t FNCSEL220  : 4;            /*!< [3..0] Function select for GPIO pin 220                                   */
      __IOM uint32_t INPEN220   : 1;            /*!< [4..4] Input enable for GPIO 220                                          */
      __IOM uint32_t RDZERO220  : 1;            /*!< [5..5] Return 0 for read data on GPIO 220                                 */
      __IOM uint32_t IRPTEN220  : 2;            /*!< [7..6] Interrupt enable for GPIO 220                                      */
      __IOM uint32_t OUTCFG220  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 220                             */
      __IOM uint32_t DS220      : 2;            /*!< [11..10] Drive strength selection for GPIO 220                            */
      __IOM uint32_t SR220      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG220 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 220                       */
      __IOM uint32_t NCESRC220  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 220, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL220  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 220                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN220    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN220    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG220_b;
  } ;

  union {
    __IOM uint32_t PINCFG221;                   /*!< (@ 0x00000374) Controls the operation of GPIO pin 221.                    */

