AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FNCSEL221  : 4;            /*!< [3..0] Function select for GPIO pin 221                                   */
      __IOM uint32_t INPEN221   : 1;            /*!< [4..4] Input enable for GPIO 221                                          */
      __IOM uint32_t RDZERO221  : 1;            /*!< [5..5] Return 0 for read data on GPIO 221                                 */
      __IOM uint32_t IRPTEN221  : 2;            /*!< [7..6] Interrupt enable for GPIO 221                                      */
      __IOM uint32_t OUTCFG221  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 221                             */
      __IOM uint32_t DS221      : 2;            /*!< [11..10] Drive strength selection for GPIO 221                            */
      __IOM uint32_t SR221      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG221 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 221                       */
      __IOM uint32_t NCESRC221  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 221, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL221  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 221                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN221    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN221    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG221_b;
  } ;

  union {
    __IOM uint32_t PINCFG222;                   /*!< (@ 0x00000378) Controls the operation of GPIO pin 222.                    */

    struct {
      __IOM uint32_t FNCSEL222  : 4;            /*!< [3..0] Function select for GPIO pin 222                                   */
      __IOM uint32_t INPEN222   : 1;            /*!< [4..4] Input enable for GPIO 222                                          */
      __IOM uint32_t RDZERO222  : 1;            /*!< [5..5] Return 0 for read data on GPIO 222                                 */
      __IOM uint32_t IRPTEN222  : 2;            /*!< [7..6] Interrupt enable for GPIO 222                                      */
      __IOM uint32_t OUTCFG222  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 222                             */
      __IOM uint32_t DS222      : 2;            /*!< [11..10] Drive strength selection for GPIO 222                            */
      __IOM uint32_t SR222      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG222 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 222                       */
      __IOM uint32_t NCESRC222  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 222, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL222  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 222                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN222    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN222    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG222_b;
  } ;

  union {
    __IOM uint32_t PINCFG223;                   /*!< (@ 0x0000037C) Controls the operation of GPIO pin 223.                    */

    struct {
      __IOM uint32_t FNCSEL223  : 4;            /*!< [3..0] Function select for GPIO pin 223                                   */
      __IOM uint32_t INPEN223   : 1;            /*!< [4..4] Input enable for GPIO 223                                          */
      __IOM uint32_t RDZERO223  : 1;            /*!< [5..5] Return 0 for read data on GPIO 223                                 */
      __IOM uint32_t IRPTEN223  : 2;            /*!< [7..6] Interrupt enable for GPIO 223                                      */
      __IOM uint32_t OUTCFG223  : 2;            /*!< [9..8] Pin IO mode selection for GPIO pin 223                             */
      __IOM uint32_t DS223      : 2;            /*!< [11..10] Drive strength selection for GPIO 223                            */
      __IOM uint32_t SR223      : 1;            /*!< [12..12] Configure the slew rate                                          */
      __IOM uint32_t PULLCFG223 : 3;            /*!< [15..13] Pullup/Pulldown configuration for GPIO 223                       */
      __IOM uint32_t NCESRC223  : 6;            /*!< [21..16] IOMSTR/MSPI N Chip Select 223, DISP control signals
                                                     DE, CSX, and CS. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
      __IOM uint32_t NCEPOL223  : 1;            /*!< [22..22] Polarity select for NCE for GPIO 223                             */
            uint32_t            : 3;
      __IOM uint32_t FIEN223    : 1;            /*!< [26..26] Force input enable active regardless of function selected.
                                                     Otherwise the selected function will enable the input only
                                                     when needed                                                               */
      __IOM uint32_t FOEN223    : 1;            /*!< [27..27] Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG223_b;
  } ;
  __IM  uint32_t  RESERVED[32];

  union {
    __IOM uint32_t PADKEY;                      /*!< (@ 0x00000400) Lock state of the PINCFG and GPIO configuration
                                                                    registers. Write a value of 0x73 to unlock
                                                                    write access to the PAD and GPIO.                          */

