AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ENC4       : 32;           /*!< [31..0] GPIO159-128 Clears pin tri-state output enables. Writing
                                                     a 1 to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC4_b;
  } ;

  union {
    __IOM uint32_t ENC5;                        /*!< (@ 0x000004C0) GPIO Enable Clear 5 (191-160)                              */

    struct {
      __IOM uint32_t ENC5       : 32;           /*!< [31..0] GPIO191-160 Clears pin tri-state output enables. Writing
                                                     a 1 to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC5_b;
  } ;

  union {
    __IOM uint32_t ENC6;                        /*!< (@ 0x000004C4) GPIO Enable Clear 6 (223-192)                              */

    struct {
      __IOM uint32_t ENC6       : 32;           /*!< [31..0] GPIO223-192 Clears pin tri-state output enables. Writing
                                                     a 1 to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC6_b;
  } ;

  union {
    __IOM uint32_t IOM0IRQ;                     /*!< (@ 0x000004C8) IOM0 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM0IRQ    : 8;            /*!< [7..0] IOM0 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM0IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM1IRQ;                     /*!< (@ 0x000004CC) IOM1 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM1IRQ    : 8;            /*!< [7..0] IOM1 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM1IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM2IRQ;                     /*!< (@ 0x000004D0) IOM2 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM2IRQ    : 8;            /*!< [7..0] IOM2 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM2IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM3IRQ;                     /*!< (@ 0x000004D4) IOM3 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM3IRQ    : 8;            /*!< [7..0] IOM3 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM3IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM4IRQ;                     /*!< (@ 0x000004D8) IOM4 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM4IRQ    : 8;            /*!< [7..0] IOM4 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM4IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM5IRQ;                     /*!< (@ 0x000004DC) IOM5 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM5IRQ    : 8;            /*!< [7..0] IOM5 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM5IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM6IRQ;                     /*!< (@ 0x000004E0) IOM6 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM6IRQ    : 8;            /*!< [7..0] IOM6 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM6IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM7IRQ;                     /*!< (@ 0x000004E4) IOM7 IRQ select for flow control.                          */

    struct {
      __IOM uint32_t IOM7IRQ    : 8;            /*!< [7..0] IOM7 IRQ pad select.                                               */
            uint32_t            : 24;
    } IOM7IRQ_b;
  } ;

  union {
    __IOM uint32_t SDIF0CDWP;                   /*!< (@ 0x000004E8) SDIF0 CD and WP Select.                                    */

    struct {
      __IOM uint32_t SDIF0CD    : 8;            /*!< [7..0] SDIF0 CD pad select                                                */
            uint32_t            : 1;
      __IOM uint32_t SDIF0WP    : 8;            /*!< [16..9] SDIF0 WP pad select.                                              */
            uint32_t            : 15;
    } SDIF0CDWP_b;
  } ;

  union {
    __IOM uint32_t SDIF1CDWP;                   /*!< (@ 0x000004EC) SDIF1 CD and WP Select.                                    */

    struct {
      __IOM uint32_t SDIF1CD    : 8;            /*!< [7..0] SDIF1 CD pad select                                                */
            uint32_t            : 1;
      __IOM uint32_t SDIF1WP    : 8;            /*!< [16..9] SDIF1 WP pad select.                                              */
            uint32_t            : 15;
    } SDIF1CDWP_b;
  } ;

  union {
    __IOM uint32_t OBSDATA;                     /*!< (@ 0x000004F0) GPIO Observation mode sample                               */

