AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N0-priority interrupt                                */
    } MCUN0INT4STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4CLR;                /*!< (@ 0x00000578) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N0-priority interrupt                                */
    } MCUN0INT4CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4SET;                /*!< (@ 0x0000057C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

