AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N0-priority interrupt                                */
    } MCUN0INT5STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5CLR;                /*!< (@ 0x00000588) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N0-priority interrupt                                */
    } MCUN0INT5CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5SET;                /*!< (@ 0x0000058C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

