AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< [0..0] GPIO192 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< [1..1] GPIO193 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< [2..2] GPIO194 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< [3..3] GPIO195 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< [4..4] GPIO196 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< [5..5] GPIO197 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< [6..6] GPIO198 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< [7..7] GPIO199 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< [8..8] GPIO200 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< [9..9] GPIO201 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< [10..10] GPIO202 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< [11..11] GPIO203 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< [12..12] GPIO204 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< [13..13] GPIO205 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< [14..14] GPIO206 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< [15..15] GPIO207 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< [16..16] GPIO208 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< [17..17] GPIO209 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< [18..18] GPIO210 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< [19..19] GPIO211 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< [20..20] GPIO212 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< [21..21] GPIO213 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< [22..22] GPIO214 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< [23..23] GPIO215 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< [24..24] GPIO216 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< [25..25] GPIO217 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< [26..26] GPIO218 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< [27..27] GPIO219 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< [28..28] GPIO220 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< [29..29] GPIO221 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< [30..30] GPIO222 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< [31..31] GPIO223 MCU N0-priority interrupt                                */
    } MCUN0INT6STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6CLR;                /*!< (@ 0x00000598) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t MCUN0GPIO192 : 1;          /*!< [0..0] GPIO192 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO193 : 1;          /*!< [1..1] GPIO193 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO194 : 1;          /*!< [2..2] GPIO194 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO195 : 1;          /*!< [3..3] GPIO195 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO196 : 1;          /*!< [4..4] GPIO196 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO197 : 1;          /*!< [5..5] GPIO197 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO198 : 1;          /*!< [6..6] GPIO198 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO199 : 1;          /*!< [7..7] GPIO199 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO200 : 1;          /*!< [8..8] GPIO200 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO201 : 1;          /*!< [9..9] GPIO201 MCU N0-priority interrupt                                  */
      __IOM uint32_t MCUN0GPIO202 : 1;          /*!< [10..10] GPIO202 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO203 : 1;          /*!< [11..11] GPIO203 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO204 : 1;          /*!< [12..12] GPIO204 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO205 : 1;          /*!< [13..13] GPIO205 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO206 : 1;          /*!< [14..14] GPIO206 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO207 : 1;          /*!< [15..15] GPIO207 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO208 : 1;          /*!< [16..16] GPIO208 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO209 : 1;          /*!< [17..17] GPIO209 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO210 : 1;          /*!< [18..18] GPIO210 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO211 : 1;          /*!< [19..19] GPIO211 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO212 : 1;          /*!< [20..20] GPIO212 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO213 : 1;          /*!< [21..21] GPIO213 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO214 : 1;          /*!< [22..22] GPIO214 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO215 : 1;          /*!< [23..23] GPIO215 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO216 : 1;          /*!< [24..24] GPIO216 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO217 : 1;          /*!< [25..25] GPIO217 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO218 : 1;          /*!< [26..26] GPIO218 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO219 : 1;          /*!< [27..27] GPIO219 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO220 : 1;          /*!< [28..28] GPIO220 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO221 : 1;          /*!< [29..29] GPIO221 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO222 : 1;          /*!< [30..30] GPIO222 MCU N0-priority interrupt                                */
      __IOM uint32_t MCUN0GPIO223 : 1;          /*!< [31..31] GPIO223 MCU N0-priority interrupt                                */
    } MCUN0INT6CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT6SET;                /*!< (@ 0x0000059C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

