AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO96 : 1;           /*!< [0..0] GPIO96 MCU N1-priority interrupt                                   */
      __IOM uint32_t MCUN1GPIO97 : 1;           /*!< [1..1] GPIO97 MCU N1-priority interrupt                                   */
      __IOM uint32_t MCUN1GPIO98 : 1;           /*!< [2..2] GPIO98 MCU N1-priority interrupt                                   */
      __IOM uint32_t MCUN1GPIO99 : 1;           /*!< [3..3] GPIO99 MCU N1-priority interrupt                                   */
      __IOM uint32_t MCUN1GPIO100 : 1;          /*!< [4..4] GPIO100 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO101 : 1;          /*!< [5..5] GPIO101 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO102 : 1;          /*!< [6..6] GPIO102 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO103 : 1;          /*!< [7..7] GPIO103 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO104 : 1;          /*!< [8..8] GPIO104 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO105 : 1;          /*!< [9..9] GPIO105 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO106 : 1;          /*!< [10..10] GPIO106 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO107 : 1;          /*!< [11..11] GPIO107 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO108 : 1;          /*!< [12..12] GPIO108 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO109 : 1;          /*!< [13..13] GPIO109 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO110 : 1;          /*!< [14..14] GPIO110 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO111 : 1;          /*!< [15..15] GPIO111 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO112 : 1;          /*!< [16..16] GPIO112 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO113 : 1;          /*!< [17..17] GPIO113 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO114 : 1;          /*!< [18..18] GPIO114 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO115 : 1;          /*!< [19..19] GPIO115 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO116 : 1;          /*!< [20..20] GPIO116 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO117 : 1;          /*!< [21..21] GPIO117 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO118 : 1;          /*!< [22..22] GPIO118 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO119 : 1;          /*!< [23..23] GPIO119 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO120 : 1;          /*!< [24..24] GPIO120 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO121 : 1;          /*!< [25..25] GPIO121 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO122 : 1;          /*!< [26..26] GPIO122 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO123 : 1;          /*!< [27..27] GPIO123 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO124 : 1;          /*!< [28..28] GPIO124 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO125 : 1;          /*!< [29..29] GPIO125 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO126 : 1;          /*!< [30..30] GPIO126 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO127 : 1;          /*!< [31..31] GPIO127 MCU N1-priority interrupt                                */
    } MCUN1INT3SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4EN;                 /*!< (@ 0x000005E0) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N1-priority interrupt                                */
    } MCUN1INT4EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4STAT;               /*!< (@ 0x000005E4) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

