AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N1-priority interrupt                                */
    } MCUN1INT4STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4CLR;                /*!< (@ 0x000005E8) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N1-priority interrupt                                */
    } MCUN1INT4CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4SET;                /*!< (@ 0x000005EC) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

