AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< [0..0] GPIO128 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< [1..1] GPIO129 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< [2..2] GPIO130 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< [3..3] GPIO131 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< [4..4] GPIO132 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< [5..5] GPIO133 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< [6..6] GPIO134 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< [7..7] GPIO135 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< [8..8] GPIO136 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< [9..9] GPIO137 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< [10..10] GPIO138 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< [11..11] GPIO139 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< [12..12] GPIO140 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< [13..13] GPIO141 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< [14..14] GPIO142 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< [15..15] GPIO143 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< [16..16] GPIO144 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< [17..17] GPIO145 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< [18..18] GPIO146 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< [19..19] GPIO147 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< [20..20] GPIO148 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< [21..21] GPIO149 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< [22..22] GPIO150 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< [23..23] GPIO151 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< [24..24] GPIO152 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< [25..25] GPIO153 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< [26..26] GPIO154 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< [27..27] GPIO155 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< [28..28] GPIO156 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< [29..29] GPIO157 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< [30..30] GPIO158 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< [31..31] GPIO159 MCU N1-priority interrupt                                */
    } MCUN1INT4SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5EN;                 /*!< (@ 0x000005F0) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N1-priority interrupt                                */
    } MCUN1INT5EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5STAT;               /*!< (@ 0x000005F4) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

