AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N1-priority interrupt                                */
    } MCUN1INT5STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5CLR;                /*!< (@ 0x000005F8) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N1-priority interrupt                                */
    } MCUN1INT5CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5SET;                /*!< (@ 0x000005FC) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

