AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< [0..0] GPIO160 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< [1..1] GPIO161 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< [2..2] GPIO162 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< [3..3] GPIO163 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< [4..4] GPIO164 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< [5..5] GPIO165 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< [6..6] GPIO166 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< [7..7] GPIO167 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< [8..8] GPIO168 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< [9..9] GPIO169 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< [10..10] GPIO170 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< [11..11] GPIO171 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< [12..12] GPIO172 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< [13..13] GPIO173 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< [14..14] GPIO174 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< [15..15] GPIO175 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< [16..16] GPIO176 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< [17..17] GPIO177 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< [18..18] GPIO178 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< [19..19] GPIO179 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< [20..20] GPIO180 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< [21..21] GPIO181 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< [22..22] GPIO182 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< [23..23] GPIO183 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< [24..24] GPIO184 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< [25..25] GPIO185 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< [26..26] GPIO186 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< [27..27] GPIO187 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< [28..28] GPIO188 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< [29..29] GPIO189 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< [30..30] GPIO190 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< [31..31] GPIO191 MCU N1-priority interrupt                                */
    } MCUN1INT5SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT6EN;                 /*!< (@ 0x00000600) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t MCUN1GPIO192 : 1;          /*!< [0..0] GPIO192 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO193 : 1;          /*!< [1..1] GPIO193 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO194 : 1;          /*!< [2..2] GPIO194 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO195 : 1;          /*!< [3..3] GPIO195 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO196 : 1;          /*!< [4..4] GPIO196 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO197 : 1;          /*!< [5..5] GPIO197 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO198 : 1;          /*!< [6..6] GPIO198 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO199 : 1;          /*!< [7..7] GPIO199 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO200 : 1;          /*!< [8..8] GPIO200 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO201 : 1;          /*!< [9..9] GPIO201 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO202 : 1;          /*!< [10..10] GPIO202 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO203 : 1;          /*!< [11..11] GPIO203 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO204 : 1;          /*!< [12..12] GPIO204 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO205 : 1;          /*!< [13..13] GPIO205 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO206 : 1;          /*!< [14..14] GPIO206 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO207 : 1;          /*!< [15..15] GPIO207 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO208 : 1;          /*!< [16..16] GPIO208 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO209 : 1;          /*!< [17..17] GPIO209 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO210 : 1;          /*!< [18..18] GPIO210 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO211 : 1;          /*!< [19..19] GPIO211 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO212 : 1;          /*!< [20..20] GPIO212 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO213 : 1;          /*!< [21..21] GPIO213 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO214 : 1;          /*!< [22..22] GPIO214 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO215 : 1;          /*!< [23..23] GPIO215 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO216 : 1;          /*!< [24..24] GPIO216 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO217 : 1;          /*!< [25..25] GPIO217 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO218 : 1;          /*!< [26..26] GPIO218 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO219 : 1;          /*!< [27..27] GPIO219 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO220 : 1;          /*!< [28..28] GPIO220 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO221 : 1;          /*!< [29..29] GPIO221 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO222 : 1;          /*!< [30..30] GPIO222 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO223 : 1;          /*!< [31..31] GPIO223 MCU N1-priority interrupt                                */
    } MCUN1INT6EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT6STAT;               /*!< (@ 0x00000604) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

