AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUN1GPIO192 : 1;          /*!< [0..0] GPIO192 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO193 : 1;          /*!< [1..1] GPIO193 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO194 : 1;          /*!< [2..2] GPIO194 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO195 : 1;          /*!< [3..3] GPIO195 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO196 : 1;          /*!< [4..4] GPIO196 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO197 : 1;          /*!< [5..5] GPIO197 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO198 : 1;          /*!< [6..6] GPIO198 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO199 : 1;          /*!< [7..7] GPIO199 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO200 : 1;          /*!< [8..8] GPIO200 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO201 : 1;          /*!< [9..9] GPIO201 MCU N1-priority interrupt                                  */
      __IOM uint32_t MCUN1GPIO202 : 1;          /*!< [10..10] GPIO202 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO203 : 1;          /*!< [11..11] GPIO203 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO204 : 1;          /*!< [12..12] GPIO204 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO205 : 1;          /*!< [13..13] GPIO205 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO206 : 1;          /*!< [14..14] GPIO206 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO207 : 1;          /*!< [15..15] GPIO207 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO208 : 1;          /*!< [16..16] GPIO208 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO209 : 1;          /*!< [17..17] GPIO209 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO210 : 1;          /*!< [18..18] GPIO210 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO211 : 1;          /*!< [19..19] GPIO211 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO212 : 1;          /*!< [20..20] GPIO212 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO213 : 1;          /*!< [21..21] GPIO213 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO214 : 1;          /*!< [22..22] GPIO214 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO215 : 1;          /*!< [23..23] GPIO215 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO216 : 1;          /*!< [24..24] GPIO216 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO217 : 1;          /*!< [25..25] GPIO217 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO218 : 1;          /*!< [26..26] GPIO218 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO219 : 1;          /*!< [27..27] GPIO219 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO220 : 1;          /*!< [28..28] GPIO220 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO221 : 1;          /*!< [29..29] GPIO221 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO222 : 1;          /*!< [30..30] GPIO222 MCU N1-priority interrupt                                */
      __IOM uint32_t MCUN1GPIO223 : 1;          /*!< [31..31] GPIO223 MCU N1-priority interrupt                                */
    } MCUN1INT6SET_b;
  } ;
} GPIO_Type;                                    /*!< Size = 1552 (0x610)                                                       */



/* =========================================================================================================================== */
/* ================                                            GPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Graphics Processing Unit (GPU)
  */

typedef struct {                                /*!< (@ 0x40090000) GPU Structure                                              */

  union {
    __IOM uint32_t TEX0BASE;                    /*!< (@ 0x00000000) Base address of the drawing surface 0 (must be
                                                                    word aligned).                                             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< [31..0] Address 0: base address of the drawing surface 0 (must
                                                     be word aligned).                                                         */
    } TEX0BASE_b;
  } ;

  union {
    __IOM uint32_t TEX0STRIDE;                  /*!< (@ 0x00000004) Image 0 mode and stride.                                   */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< [15..0] image stride (signed) distance in bytes from one scanline
                                                     to another                                                                */
      __IOM uint32_t IMGMODE    : 8;            /*!< [23..16] Image Mode                                                       */
      __IOM uint32_t IMGFMT     : 8;            /*!< [31..24] Image Format                                                     */
    } TEX0STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX0RES;                     /*!< (@ 0x00000008) Image 0 resolution.                                        */

