AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t DRAW0X     : 32;           /*!< [31..0] X coordinate                                                      */
    } DRAWPT0X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0Y;                    /*!< (@ 0x00000124) Y coordinate of Vertex 0 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW0Y     : 32;           /*!< [31..0] Y coordinate                                                      */
    } DRAWPT0Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0Z;                    /*!< (@ 0x00000128) FIXME - register description needed here.                  */

    struct {
      __IOM uint32_t DRAW0Z     : 32;           /*!< [31..0] This bitfield is reserved.                                        */
    } DRAWPT0Z_b;
  } ;

  union {
    __IOM uint32_t DRAWCOLOR;                   /*!< (@ 0x0000012C) FIXME - register description needed here.                  */

    struct {
      __IOM uint32_t RASTPRIM   : 32;           /*!< [31..0] Rasterizer drawing                                                */
    } DRAWCOLOR_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1X;                    /*!< (@ 0x00000130) X coordinate of Vertex 1 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW1X     : 32;           /*!< [31..0] X coordinate                                                      */
    } DRAWPT1X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1Y;                    /*!< (@ 0x00000134) Y coordinate of Vertex 1 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW1Y     : 32;           /*!< [31..0] Y coordinate                                                      */
    } DRAWPT1Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1Z;                    /*!< (@ 0x00000138) FIXME - register description needed here.                  */

    struct {
      __IOM uint32_t DRAW1Z     : 32;           /*!< [31..0] This bitfield is reserved.                                        */
    } DRAWPT1Z_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t DRAWPT2X;                    /*!< (@ 0x00000140) X coordinate of Vertex 2 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW2X     : 32;           /*!< [31..0] X coordinate                                                      */
    } DRAWPT2X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT2Y;                    /*!< (@ 0x00000144) Y coordinate of Vertex 2 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW2Y     : 32;           /*!< [31..0] Y coordinate                                                      */
    } DRAWPT2Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT2Z;                    /*!< (@ 0x00000148) FIXME - register description needed here.                  */

    struct {
      __IOM uint32_t RSVD       : 32;           /*!< [31..0] This bitfield is reserved.                                        */
    } DRAWPT2Z_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t DRAWPT3X;                    /*!< (@ 0x00000150) X coordinate of Vertex 3 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW3X     : 32;           /*!< [31..0] X coordinate                                                      */
    } DRAWPT3X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT3Y;                    /*!< (@ 0x00000154) Y coordinate of Vertex 3 drawing primitive 16,
                                                                    16 fixed point.                                            */

    struct {
      __IOM uint32_t DRAW3Y     : 32;           /*!< [31..0] Y coordinate.                                                     */
    } DRAWPT3Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT3Z;                    /*!< (@ 0x00000158) Fixed value (not accessible). Registers 0x160-0x180
                                                                    are the elements of the 3x3 transformation
                                                                    matrix used for homogeneous conversion from
                                                                    screen coordinates to texture coordinates;
                                                                    the elements are floating points                           */

    struct {
      __IOM uint32_t DRAW3Z     : 32;           /*!< [31..0] Fixed value (not accessible)                                      */
    } DRAWPT3Z_b;
  } ;
  __IM  uint32_t  RESERVED9;

  union {
    __IOM uint32_t MM00;                        /*!< (@ 0x00000160) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (0,0). matrix floating point element.                             */
    } MM00_b;
  } ;

  union {
    __IOM uint32_t MM01;                        /*!< (@ 0x00000164) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (0,1). matrix floating point element.                             */
    } MM01_b;
  } ;

  union {
    __IOM uint32_t MM02;                        /*!< (@ 0x00000168) matrix floating point element; sets to unit matrix
                                                                    if previously written element is MM12.                     */

