AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t RXTOTCNT   : 12;           /*!< [11..0] Number of 32b audio samples to transfer for RX DMA.               */
            uint32_t            : 20;
    } RXDMATOTCNT_b;
  } ;

  union {
    __IOM uint32_t RXDMAADDR;                   /*!< (@ 0x00000208) The address which the DMA operation will store
                                                                    the incoming audio samples. This address
                                                                    is updated as the samples are stored.                      */

    struct {
      __IOM uint32_t RXTARGADDR : 32;           /*!< [31..0] Address bits of the target byte address for source of
                                                     RX write DMA.                                                             */
    } RXDMAADDR_b;
  } ;

  union {
    __IOM uint32_t RXDMASTAT;                   /*!< (@ 0x0000020C) Status of the RX DMA operation currently in progress.      */

    struct {
      __IOM uint32_t RXDMATIP   : 1;            /*!< [0..0] RX DMA Transfer In Progress indicator. 1 will indicate
                                                     that a DMA transfer is active. The DMA transfer may be
                                                     waiting on data, transferring data, or waiting for priority.All
                                                     of these will be indicated with a 1. A 0 will indicate
                                                     that the DMA is fully complete and no further transactions
                                                     will be done. This bit is read only.                                      */
      __IOM uint32_t RXDMACPL   : 1;            /*!< [1..1] RX DMA Transfer Complete. This signals the end of the
                                                     DMA operation. This bit can be cleared by writing to 0,
                                                     and will also be cleared when a new DMA is started.                       */
      __IOM uint32_t RXDMAERR   : 1;            /*!< [2..2] RX DMA Error. This active high bit signals an error was
                                                     encountered during the DMA operation. The bit can be cleared
                                                     by writing to 0. Once set, this bit will remain set until
                                                     cleared by software.                                                      */
            uint32_t            : 29;
    } RXDMASTAT_b;
  } ;

  union {
    __IOM uint32_t TXDMATOTCNT;                 /*!< (@ 0x00000210) Contains the total count of samples to be read
                                                                    and transmitted for the current TX DMA operation.
                                                                    This register is updated as DMA beats complete.            */

    struct {
      __IOM uint32_t TXTOTCNT   : 12;           /*!< [11..0] Number of 32b audio samples to transmit                           */
            uint32_t            : 20;
    } TXDMATOTCNT_b;
  } ;

  union {
    __IOM uint32_t TXDMAADDR;                   /*!< (@ 0x00000214) The address which the DMA operation will fetch
                                                                    the audio samples. This address is updated
                                                                    as the samples are stored.                                 */

    struct {
      __IOM uint32_t TXTARGADDR : 32;           /*!< [31..0] Address bits of the target byte address for source of
                                                     TX write DMA.                                                             */
    } TXDMAADDR_b;
  } ;

  union {
    __IOM uint32_t TXDMASTAT;                   /*!< (@ 0x00000218) Status of the TX DMA operation currently in progress.      */

    struct {
      __IOM uint32_t TXDMATIP   : 1;            /*!< [0..0] TX DMA Transfer In Progress indicator. 1 will indicate
                                                     that a DMA transfer is active. The DMA transfer may be
                                                     waiting on data, transferring data, or waiting for priority.All
                                                     of these will be indicated with a 1. A 0 will indicate
                                                     that the DMA is fully complete and no further transactions
                                                     will be done. This bit is read only.                                      */
      __IOM uint32_t TXDMACPL   : 1;            /*!< [1..1] TX DMA Transfer Complete. This signals the end of the
                                                     DMA operation. This bit can be cleared by writing to 0,
                                                     and will also be cleared when a new DMA is started.                       */
      __IOM uint32_t TXDMAERR   : 1;            /*!< [2..2] TX DMA Error. This active high bit signals an error was
                                                     encountered during the DMA operation. The bit can be cleared
                                                     by writing to 0. Once set, this bit will remain set until
                                                     cleared by software.                                                      */
            uint32_t            : 29;
    } TXDMASTAT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< (@ 0x0000021C) To enable next DMA job                                     */

    struct {
      __IOM uint32_t RXDMAENNEXT : 1;           /*!< [0..0] Indicate to HW the next RX DMA job. RXTARGADDRNEXT and
                                                     RXTOTCNTNEXT needs to be valid before setting this bit.
                                                     HW will autoclear this bit when this job is serviced. SW
                                                     should read back this bit after setting it. If it reads
                                                     back 0, it means SW can load another set of RXTARGADDRNEXT
                                                     and RXTOTCNTNEXT and set this bit again. If it reads back
                                                     1, it means the HW is servicing a DMA job, and the next
                                                     DMA job is yet to be loaded. SW needs to wait for RXDMACPL
                                                     interrupt to setup the next job.                                          */
      __IOM uint32_t TXDMAENNEXT : 1;           /*!< [1..1] Indicate to HW the next TX DMA job. TXTARGADDRNEXT and
                                                     TXTOTCNTNEXT needs to be valid before setting this bit.
                                                     HW will autoclear this bit when this job is serviced. SW
                                                     should read back this bit after setting it. If it reads
                                                     back 0, it means SW can load another set of TXTARGADDRNEXT
                                                     and TXTOTCNTNEXT and set this bit again. If it reads back
                                                     1, it means the HW is servicing a DMA job, and the next
                                                     DMA job is yet to be loaded. SW needs to wait for TXDMACPL
                                                     interrupt to setup the next job.                                          */
            uint32_t            : 30;
    } DMAENNEXTCTRL_b;
  } ;

  union {
    __IOM uint32_t RXDMATOTCNTNEXT;             /*!< (@ 0x00000220) Contains the total count of samples to be stored
                                                                    for the next RX DMA operation.                             */

