AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< [31..0] Register access interrupts.                                       */
    } REGACCINTSET_b;
  } ;
} IOSLAVE_Type;                                 /*!< Size = 544 (0x220)                                                        */



/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Miscellaneous Control Logic (MCUCTRL)
  */

typedef struct {                                /*!< (@ 0x40020000) MCUCTRL Structure                                          */

  union {
    __IOM uint32_t CHIPPN;                      /*!< (@ 0x00000000) Chip Information                                           */

    struct {
      __IOM uint32_t RSVD       : 1;            /*!< [0..0] This field is reserved.                                            */
      __IOM uint32_t TEMP       : 2;            /*!< [2..1] Temperature.                                                       */
      __IOM uint32_t PINS       : 3;            /*!< [5..3] Number of pins for this package.                                   */
      __IOM uint32_t PKG        : 2;            /*!< [7..6] Package type.                                                      */
      __IOM uint32_t REVMIN     : 4;            /*!< [11..8] Minor revision. Please use the CHIPREV register for
                                                     device identification.                                                    */
      __IOM uint32_t REVMAJ     : 4;            /*!< [15..12] Major revision. Please use the CHIPREV register for
                                                     device identification.                                                    */
      __IOM uint32_t SRAMSIZE   : 4;            /*!< [19..16] SRAM size. Please use the SKU register for determining
                                                     memory sizing.                                                            */
      __IOM uint32_t MRAMSIZE   : 4;            /*!< [23..20] MRAM size. Please use the SKU register for determining
                                                     memory sizing.                                                            */
      __IOM uint32_t PN         : 8;            /*!< [31..24] Apollo family device type.                                       */
    } CHIPPN_b;
  } ;

  union {
    __IOM uint32_t CHIPID0;                     /*!< (@ 0x00000004) Unique Chip ID 0                                           */

    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< [31..0] Unique chip ID 0. For APOLLO CHIPID0 value is 0x0                 */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< (@ 0x00000008) Unique Chip ID 1                                           */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< [31..0] Unique chip ID 1. For APOLLO CHIPID1 value is 0x0                 */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< (@ 0x0000000C) Chip Revision                                              */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< [3..0] Minor Revision ID.                                                 */
      __IOM uint32_t REVMAJ     : 4;            /*!< [7..4] Major Revision ID.                                                 */
      __IOM uint32_t SIPART     : 12;           /*!< [19..8] Silicon Part ID                                                   */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< (@ 0x00000010) Unique Vendor ID                                           */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< [31..0] Unique Vendor ID                                                  */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< (@ 0x00000014) Unique Chip SKU                                            */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< [1..0] SRAM SKU dictates the available memory for MCU. All of
                                                     the MCU TCM (384KB) and System SRAM (2MB) available by
                                                     default.                                                                  */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< [3..2] MRAM size SKU. All of 4MB Available by default.                    */
            uint32_t            : 2;
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< [6..6] High performance mode for MCU and DSPs.                            */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< [7..7] MIPI DSI available                                                 */
      __IOM uint32_t SKUGFX     : 1;            /*!< [8..8] GFX available                                                      */
      __IOM uint32_t SKUUSB     : 1;            /*!< [9..9] USB available                                                      */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< [10..10] Secure boot feature                                              */
      __IOM uint32_t SKUITCM    : 4;            /*!< [14..11] ITCM size feature0x6: 32KB0x8: 128KB0x9: 256KB                   */
      __IOM uint32_t SKUDTCM    : 4;            /*!< [18..15] DTCM size feature0x8: 128KB0x9: 256KB0xA: 512KB                  */
      __IOM uint32_t SKUFPU     : 1;            /*!< [19..19] FPU feature0x0: no FPU0x1: Has FPU                               */
      __IOM uint32_t SKUMVE     : 2;            /*!< [21..20] MVE feature0x0: no MVE0x1: Integer MVE only0x2: Integer
                                                     and Floating Point MVE supported (note that with this setting,
                                                     FPU must be enabled)                                                      */
            uint32_t            : 10;
    } SKU_b;
  } ;

  union {
    __IOM uint32_t SKUOVERRIDE;                 /*!< (@ 0x00000018) Override register for Chip SKU                             */

