AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< [1..0] Override for sram size sku                                         */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< [3..2] Override for mram size sku                                         */
            uint32_t            : 2;
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< [6..6] Override for turbo spot sku                                        */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< [7..7] Override for mipi dsi sku                                          */
      __IOM uint32_t SKUGFX     : 1;            /*!< [8..8] Override for gfx sku                                               */
      __IOM uint32_t SKUUSB     : 1;            /*!< [9..9] Override for usb sku                                               */
            uint32_t            : 1;
      __IOM uint32_t CFGITCMSZ  : 4;            /*!< [14..11] ITCM size feature (only 3 ITCM configurations are allowed:
                                                     0x6 - 32K, 0x8 - 128K, 0x9 - 256K)                                        */
      __IOM uint32_t CFGDTCMSZ  : 4;            /*!< [18..15] DTCM size feature (only 3 DTCM configurations are allowed:
                                                     0x8 - 128K, 0x9 - 256K, 0xA - 512K)                                       */
      __IOM uint32_t CFGFPU     : 1;            /*!< [19..19] FPU feature                                                      */
      __IOM uint32_t CFGMVE     : 2;            /*!< [21..20] MVE feature                                                      */
            uint32_t            : 10;
    } SKUOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DEBUGGER;                    /*!< (@ 0x00000020) Debugger Control                                           */

    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< [31..0] Lockout of debugger (SWD).                                        */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< (@ 0x00000028) Active Current Reference Generator Control                 */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< [0..0] Software enablement for ACRG register. A value of 1 will
                                                     allow writes to the register                                              */
      __IOM uint32_t ACRGPWD    : 1;            /*!< [1..1] Power down the ACRG.                                               */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< [2..2] Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE
                                                     must be set for this to take effect. The inversion of this
                                                     register is driven to analog.                                             */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< [7..3] ACRG Trim value                                                    */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< (@ 0x00000044) Voltage Reference Generator 2 Control                      */

    struct {
      __IOM uint32_t TVRGCVREFTRIM : 7;         /*!< [6..0] Calibrated Voltage Reference Generator tc trim (bottom
                                                     transistor)                                                               */
      __IOM uint32_t TVRGCTEMPCOTRIM : 5;       /*!< [11..7] TVRGC tempcompensation trim init value                            */
      __IOM uint32_t TVRGCSELVREF : 1;          /*!< [12..12] TVRGC sel vref init value                                        */
      __IOM uint32_t TVRGCPDNB  : 1;            /*!< [13..13] TVRGC pdnb init value                                            */
      __IOM uint32_t TVRGCHSENRESDIV : 1;       /*!< [14..14] TVRGC hsenable resdiv init value                                 */
      __IOM uint32_t TVRGCCURRENTTRIM : 1;      /*!< [15..15] TVRGC Current trim init value                                    */
            uint32_t            : 16;
    } VREFGEN2_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t VREFGEN4;                    /*!< (@ 0x0000004C) Voltage Reference Generator 4 Control                      */

    struct {
      __IOM uint32_t TVRGFVREFTRIM : 7;         /*!< [6..0] TVRGF Voltage Reference Generator trim (bottom transistor)         */
      __IOM uint32_t TVRGFTEMPCOTRIM : 5;       /*!< [11..7] TVRGF tempo trim init value                                       */
      __IOM uint32_t TVRGFSELVREF : 1;          /*!< [12..12] TVRGF sel vref init value                                        */
      __IOM uint32_t TVRGFPWLTEMPCOTRIM : 5;    /*!< [17..13] Calibrated Voltage Reference Generator pwl tc trim
                                                     (bottom transistor)                                                       */
      __IOM uint32_t TVRGFPDNB  : 1;            /*!< [18..18] TVRGF pdnb init value                                            */
      __IOM uint32_t TVRGFHSENRESDIV : 1;       /*!< [19..19] TVRGF hsenable resdiv init value                                 */
      __IOM uint32_t TVRGFCURRENTTRIM : 1;      /*!< [20..20] TVRGF Current trim init value                                    */
            uint32_t            : 11;
    } VREFGEN4_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t VREFBUF;                     /*!< (@ 0x00000054) Voltage Reference BUF Control                              */

    struct {
      __IOM uint32_t VREFBUFVOLTTRIM : 6;       /*!< [5..0] VREFBUF voltage trim init value                                    */
      __IOM uint32_t VREFBUFPDNB : 1;           /*!< [6..6] VREGBUF pdnb init value                                            */
      __IOM uint32_t VREFBUFMISCTRIM : 6;       /*!< [12..7] VREFBUF MISC trim init value                                      */
      __IOM uint32_t VREFBUFIBIASTRIM : 1;      /*!< [13..13] VREFBUFIBIAS trim init value                                     */
      __IOM uint32_t VREFBUFCCOMPTRIM : 3;      /*!< [16..14] VREFBUF ccomp trim init value                                    */
            uint32_t            : 15;
    } VREFBUF_b;
  } ;
  __IM  uint32_t  RESERVED5[2];

  union {
    __IOM uint32_t VRCTRL;                      /*!< (@ 0x00000060) Overrides for Voltage Regulators Controls                  */

