AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t BATTLOAD   : 1;            /*!< [0..0] Enable the ADC battery load resistor                               */
            uint32_t            : 31;
    } ADCBATTLOAD_b;
  } ;
  __IM  uint32_t  RESERVED11[3];

  union {
    __IOM uint32_t XTALCTRL;                    /*!< (@ 0x00000120) XTAL Oscillator Control                                    */

    struct {
      __IOM uint32_t XTALSWE    : 1;            /*!< [0..0] XTAL Software Override Enable.                                     */
      __IOM uint32_t XTALCOREDISFB : 1;         /*!< [1..1] XTAL Oscillator Disable Feedback.                                  */
      __IOM uint32_t XTALCOMPBYPASS : 1;        /*!< [2..2] XTAL Oscillator Bypass Comparator.                                 */
      __IOM uint32_t XTALPDNB   : 1;            /*!< [3..3] XTAL Oscillator Power Down Core.                                   */
      __IOM uint32_t XTALCOMPPDNB : 1;          /*!< [4..4] XTAL Oscillator Power Down Comparator.                             */
      __IOM uint32_t XTALIBUFTRIM : 2;          /*!< [6..5] XTAL IBUFF trim                                                    */
      __IOM uint32_t XTALICOMPTRIM : 2;         /*!< [8..7] XTAL ICOMP trim                                                    */
            uint32_t            : 23;
    } XTALCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALGENCTRL;                 /*!< (@ 0x00000124) XTAL Oscillator General Control                            */

    struct {
      __IOM uint32_t ACWARMUP   : 2;            /*!< [1..0] Auto-calibration delay control                                     */
      __IOM uint32_t XTALBIASTRIM : 6;          /*!< [7..2] XTAL BIAS trim                                                     */
      __IOM uint32_t XTALKSBIASTRIM : 6;        /*!< [13..8] XTAL IBIAS Kick start trim. This trim value is used
                                                     during the startup process to enable a faster lock.                       */
            uint32_t            : 18;
    } XTALGENCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALHSTRIMS;                 /*!< (@ 0x00000128) XTALHS Trims                                               */

    struct {
      __IOM uint32_t XTALHSCAP2TRIM : 6;        /*!< [5..0] xtalhs_cap2_trim                                                   */
      __IOM uint32_t XTALHSCAPTRIM : 4;         /*!< [9..6] xtalhs_cap_trim                                                    */
      __IOM uint32_t XTALHSDRIVETRIM : 2;       /*!< [11..10] xtalhs_drive_trim                                                */
      __IOM uint32_t XTALHSDRIVERSTRENGTH : 3;  /*!< [14..12] xtalhs_driver_strength                                           */
      __IOM uint32_t XTALHSIBIASCOMP2TRIM : 2;  /*!< [16..15] xtalhs_ibias_comp2_trim                                          */
      __IOM uint32_t XTALHSIBIASCOMPTRIM : 4;   /*!< [20..17] xtalhs_ibias_comp_trim                                           */
      __IOM uint32_t XTALHSIBIASTRIM : 7;       /*!< [27..21] xtalhs_ibias_trim                                                */
      __IOM uint32_t XTALHSRSTRIM : 1;          /*!< [28..28] xtalhs_rs_trim                                                   */
      __IOM uint32_t XTALHSSPARE : 1;           /*!< [29..29] xtalhs_spare                                                     */
            uint32_t            : 2;
    } XTALHSTRIMS_b;
  } ;

  union {
    __IOM uint32_t XTALHSCTRL;                  /*!< (@ 0x0000012C) XTALHS Control                                             */

    struct {
      __IOM uint32_t XTALHSPDNB : 1;            /*!< [0..0] xtalhs_pdnb                                                        */
      __IOM uint32_t XTALHSCOMPPDNB : 1;        /*!< [1..1] xtalhs_comp_pdnb                                                   */
      __IOM uint32_t XTALHSCOMPSEL : 1;         /*!< [2..2] xtalhs_comp_sel                                                    */
      __IOM uint32_t XTALHSIBSTENABLE : 1;      /*!< [3..3] xtalhs_ibst_enable                                                 */
      __IOM uint32_t XTALHSINJECTIONENABLE : 1; /*!< [4..4] xtalhs_injection_enable                                            */
      __IOM uint32_t XTALHSPDNPNIMPROVE : 1;    /*!< [5..5] xtalhs_pdn_pn_improve                                              */
      __IOM uint32_t XTALHSSELRCOM : 1;         /*!< [6..6] xtalhs_sel_rcom                                                    */
      __IOM uint32_t XTALHSPADOUTEN : 1;        /*!< [7..7] xtalhs_padout_en                                                   */
      __IOM uint32_t XTALHSEXTERNALCLOCK : 1;   /*!< [8..8] xtalhs_external_clock                                              */
            uint32_t            : 23;
    } XTALHSCTRL_b;
  } ;
  __IM  uint32_t  RESERVED12;

  union {
    __IOM uint32_t BGTLPCTRL;                   /*!< (@ 0x00000134) LP Bandgap Control                                         */

    struct {
      __IOM uint32_t BGTLPPTATTRIM : 6;         /*!< [5..0] BGTLP ptat trim                                                    */
      __IOM uint32_t BGTLPCTATTRIM : 6;         /*!< [11..6] BGTLP ctat trim                                                   */
      __IOM uint32_t BGTLPVBG2P5TRIM : 6;       /*!< [17..12] BGTLP vbg2p5 trim                                                */
      __IOM uint32_t BGTLPBYPASSB : 1;          /*!< [18..18] bgtlp_bypass_b                                                   */
      __IOM uint32_t BGTLPQUICKCHB : 1;         /*!< [19..19] bgtlp_quickch_b                                                  */
            uint32_t            : 12;
    } BGTLPCTRL_b;
  } ;
  __IM  uint32_t  RESERVED13[18];

  union {
    __IOM uint32_t MRAMCRYPTOPWRCTRL;           /*!< (@ 0x00000180) MRAM Crypto Power Control                                  */

    struct {
      __IOM uint32_t MRAM0LPREN : 1;            /*!< [0..0] MRAM0 low power mode enable                                        */
      __IOM uint32_t MRAM0SLPEN : 1;            /*!< [1..1] MRAM0 sleep mode enable                                            */
      __IOM uint32_t MRAM0PWRCTRL : 1;          /*!< [2..2] MRAM0 low power mode control. When set to 1, tmc_lpr
                                                     and tmc_slp are driven by the value of MRAM0LPREN and MRAM0SLPEN
                                                     of this register.                                                         */
      __IOM uint32_t MRAM1LPREN : 1;            /*!< [3..3] MRAM1 low power mode enable                                        */
      __IOM uint32_t MRAM1SLPEN : 1;            /*!< [4..4] MRAM1 sleep mode enable                                            */
      __IOM uint32_t MRAM1PWRCTRL : 1;          /*!< [5..5] MRAM1 low power mode control. When set to 1, tmc_lpr
                                                     and tmc_slp are driven by the value of MRAM1LPREN and MRAM1SLPEN
                                                     of this register.                                                         */
            uint32_t            : 2;
      __IOM uint32_t CRYPTOPWRDOWREADY : 1;     /*!< [8..8] Crypto power down is ready, sw can pwd down the crypto
                                                     through power ctrl                                                        */
      __IOM uint32_t CRYPTOCLKGATEN : 1;        /*!< [9..9] crypto clk gating enable configuration                             */
            uint32_t            : 22;
    } MRAMCRYPTOPWRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED14[10];

  union {
    __IOM uint32_t BODISABLE;                   /*!< (@ 0x000001AC) Brownout Disable                                           */

