AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t BODLRDE    : 1;            /*!< [0..0] Disable Unregulated 1.8V Brown-out reset.                          */
      __IOM uint32_t BODCREN    : 1;            /*!< [1..1] Disable VDDC Brown Out reset.                                      */
      __IOM uint32_t BODFREN    : 1;            /*!< [2..2] Disable VDDF Brown Out reset.                                      */
      __IOM uint32_t BODSREN    : 1;            /*!< [3..3] Disable VDDS Brown Out reset.                                      */
      __IOM uint32_t BODCLVREN  : 1;            /*!< [4..4] Disable VDDC_LV Brown Out reset.                                   */
            uint32_t            : 27;
    } BODISABLE_b;
  } ;

  union {
    __IOM uint32_t D2ASPARE;                    /*!< (@ 0x000001B0) Spare registers to analog module                           */

    struct {
      __IOM uint32_t D2ASPARE   : 32;           /*!< [31..0] D2A Spare signals (shadow loaded)::D2ASPARE Bit21:pll
                                                     isolation for VDDH, VDDF; Bit22-25:When set, it will force
                                                     uart0/1/2/3_gate.clken to be 1, making uart0/1/2/3.pclk
                                                     to be always-on; Bit31: When set, it will fix CAB-1444
                                                     arbitration logic bug;                                                    */
    } D2ASPARE_b;
  } ;
  __IM  uint32_t  RESERVED15;

  union {
    __IOM uint32_t BOOTLOADER;                  /*!< (@ 0x000001B8) Bootloader and secure boot functions                       */

    struct {
      __IOM uint32_t RSVD0      : 1;            /*!< [0..0] This field is reserved and must not be modified.                   */
      __IOM uint32_t SBRLOCK    : 1;            /*!< [1..1] Secure boot ROM lock. Always resets to 1, write 1 to
                                                     clear. Enables system visibility to bootloader until set.                 */
      __IOM uint32_t PROTLOCK   : 1;            /*!< [2..2] Flash protection lock. Always resets to 1, write 1 to
                                                     clear. Enables writes to flash protection register set.                   */
      __IOM uint32_t SBLLOCK    : 1;            /*!< [3..3] Secure boot loader lock. Always resets to 1, write 1
                                                     to clear. Enables system visibility to bootloader until
                                                     set.                                                                      */
            uint32_t            : 22;
      __IOM uint32_t SECBOOTFEATURE : 2;        /*!< [27..26] Indicates whether the secure boot feature is enabled.            */
      __IOM uint32_t SECBOOT    : 2;            /*!< [29..28] Indicates whether the secure boot on cold reset is
                                                     enabled                                                                   */
      __IOM uint32_t SECBOOTONRST : 2;          /*!< [31..30] Indicates whether the secure boot on warm reset is
                                                     enabled                                                                   */
    } BOOTLOADER_b;
  } ;

  union {
    __IOM uint32_t SHADOWVALID;                 /*!< (@ 0x000001BC) Register to indicate whether the shadow registers
                                                                    have been successfully loaded from the Flash
                                                                    Information Space.                                         */

    struct {
      __IOM uint32_t VALID      : 1;            /*!< [0..0] Indicates whether the shadow registers contain valid
                                                     data from the Flash Information Space.                                    */
            uint32_t            : 2;
      __IOM uint32_t INFO1SELOTP : 1;           /*!< [3..3] Select OTP Info1 or MRAM Info1.                                    */
      __IOM uint32_t INFO0SELOTP : 1;           /*!< [4..4] Select OTP Info0 or MRAM Info0.                                    */
            uint32_t            : 1;
      __IOM uint32_t OTPREADY   : 1;            /*!< [6..6] Whether OTP is ready for access                                    */
      __IOM uint32_t OTPBOOTFAULT : 6;          /*!< [12..7] OTP interrupt status during shadow copy                           */
            uint32_t            : 19;
    } SHADOWVALID_b;
  } ;

  union {
    __IOM uint32_t SCRATCH0;                    /*!< (@ 0x000001C0) Scratch register that is not reset by any reset            */

    struct {
      __IOM uint32_t SCRATCH0   : 32;           /*!< [31..0] Scratch register 0.                                               */
    } SCRATCH0_b;
  } ;

  union {
    __IOM uint32_t SCRATCH1;                    /*!< (@ 0x000001C4) Scratch register that is not reset by any reset            */

    struct {
      __IOM uint32_t SCRATCH1   : 32;           /*!< [31..0] Scratch register 1.                                               */
    } SCRATCH1_b;
  } ;
  __IM  uint32_t  RESERVED16[14];

  union {
    __IOM uint32_t DBGR1;                       /*!< (@ 0x00000200) Read-only debug 1                                          */

    struct {
      __IOM uint32_t ONETO8     : 32;           /*!< [31..0] Read-only register for communication validation                   */
    } DBGR1_b;
  } ;

  union {
    __IOM uint32_t DBGR2;                       /*!< (@ 0x00000204) Read-only debug 2                                          */

    struct {
      __IOM uint32_t COOLCODE   : 32;           /*!< [31..0] Read-only register for communication validation                   */
    } DBGR2_b;
  } ;
  __IM  uint32_t  RESERVED17[5];

  union {
    __IOM uint32_t WICCONTROL;                  /*!< (@ 0x0000021C) This register is responsible for WIC Control
                                                                    and Configuration                                          */

