AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ACTFBEN    : 1;            /*!< [0..0] DEPRECATED                                                         */
      __IOM uint32_t COARSESEL  : 1;            /*!< [1..1] DEPRECATED                                                         */
      __IOM uint32_t DCMMODEEN  : 1;            /*!< [2..2] DEPRECATED                                                         */
      __IOM uint32_t FORCETONCLKEN : 1;         /*!< [3..3] TONCLK is active only when needed to save power. This
                                                     keeps the clock always on (AON). Set before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t LPFBEN     : 1;            /*!< [4..4] DEPRECATED                                                         */
      __IOM uint32_t RXCLKACTSEL : 1;           /*!< [5..5] DEPRECATED                                                         */
      __IOM uint32_t RXCLKACTTRIM : 5;          /*!< [10..6] This divides the 5 MHz refresh clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
      __IOM uint32_t RXCLKLPTRIM : 5;           /*!< [15..11] This divides the 32 kHz low power clock. Even divides
                                                     are supported only. This value represents the division
                                                     amount minus 1.                                                           */
      __IOM uint32_t OBSMODE    : 2;            /*!< [17..16] Choose from 4 modes of operation                                 */
      __IOM uint32_t RXSCHEDULINGCODE : 2;      /*!< [19..18] DEPRECATED                                                       */
      __IOM uint32_t WSELDELAYTRIM : 1;         /*!< [20..20] DEPRECATED                                                       */
      __IOM uint32_t WSELVDDSBSMODE : 1;        /*!< [21..21] DEPRECATED                                                       */
      __IOM uint32_t TONCLKTRIM : 4;            /*!< [25..22] This divides the 100 MHz ton clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
      __IOM uint32_t TPNDTRIM   : 2;            /*!< [27..26] Control delay between primary Pmos and Nmos transitions.         */
      __IOM uint32_t FORCEBUCKOFF : 1;          /*!< [28..28] Control the buck sequence stopping point before snubber
                                                     asserts. Set before simobuck comes up.                                    */
      __IOM uint32_t BUCKMODE   : 1;            /*!< [29..29] The buck sequence can operate in two buck sequence
                                                     modes: default (zxcomp) and backup. Set before simobuck
                                                     comes up.                                                                 */
      __IOM uint32_t SIMOBUCKOBSEN : 1;         /*!< [30..30] Enable the simobuck observation bus output.                      */
      __IOM uint32_t SIMOBUCKHPTRIMEN : 1;      /*!< [31..31] Enable the simobuck HP mode trim                                 */
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< (@ 0x00000344) SIMO Buck Muxed VDDC Active Sequence Trim Control          */

    struct {
      __IOM uint32_t VDDCACTDRVSTRTRIM : 2;     /*!< [1..0] VDDC active trim control for drive strength.                       */
            uint32_t            : 4;
      __IOM uint32_t VDDCACTHIGHTOFFTRIM : 5;   /*!< [10..6] VDDC active high toff trim control for Buck sequence.             */
      __IOM uint32_t VDDCACTHIGHTONTRIM : 5;    /*!< [15..11] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 4;
      __IOM uint32_t VDDCACTLOWTOFFTRIM : 5;    /*!< [24..20] VDDC active low toff trim control for Buck sequence.             */
      __IOM uint32_t VDDCACTLOWTONTRIM : 5;     /*!< [29..25] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 2;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< (@ 0x00000348) SIMO Buck Muxed VDDC low power Sequence Trim
                                                                    Control                                                    */

    struct {
      __IOM uint32_t VDDCLEAKAGETRIM : 2;       /*!< [1..0] DEPRECATED                                                         */
      __IOM uint32_t VDDCLPDRVSTRTRIM : 2;      /*!< [3..2] VDDC LP trim control for drive strength.                           */
      __IOM uint32_t VDDCLPHIGHTOFFTRIMFINE : 4;/*!< [7..4] DEPRECATED.                                                        */
      __IOM uint32_t VDDCLPHIGHTOFFTRIM : 5;    /*!< [12..8] VDDC LP high toff trim control for Buck sequence.                 */
      __IOM uint32_t VDDCLPHIGHTONTRIM : 5;     /*!< [17..13] VDDC LP high ton trim control for Buck sequence.                 */
      __IOM uint32_t VDDCLPLOWTOFFTRIMFINE : 4; /*!< [21..18] DEPRECATED.                                                      */
      __IOM uint32_t VDDCLPLOWTOFFTRIM : 5;     /*!< [26..22] VDDC LP low toff trim control for Buck sequence.                 */
      __IOM uint32_t VDDCLPLOWTONTRIM : 5;      /*!< [31..27] VDDC LP low ton trim control for Buck sequence.                  */
    } SIMOBUCK3_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< (@ 0x0000034C) SIMO Buck Muxed VDDC LV Active Sequence Trim
                                                                    Control                                                    */

