AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t VDDCLVACTDRVSTRTRIM : 2;   /*!< [1..0] VDDC LV active trim control for drive strength.                    */
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIMFINE : 4;/*!< [5..2] DEPRECATED.                                                     */
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIM : 5; /*!< [10..6] VDDC LV active high toff trim control for Buck sequence.          */
      __IOM uint32_t VDDCLVACTHIGHTONTRIM : 5;  /*!< [15..11] VDDC LV active high ton trim control for Buck sequence.          */
      __IOM uint32_t VDDCLVACTLOWTOFFTRIMFINE : 4;/*!< [19..16] DEPRECATED.                                                    */
      __IOM uint32_t VDDCLVACTLOWTOFFTRIM : 5;  /*!< [24..20] VDDC LV active low trim control for a 500 MHz clock
                                                     inside the simobuck analog design.                                        */
      __IOM uint32_t VDDCLVACTLOWTONTRIM : 5;   /*!< [29..25] VDDC LV active low ton trim control for Buck sequence.           */
      __IOM uint32_t VDDCLVINPREFSEL : 1;       /*!< [30..30] DEPRECATED                                                       */
            uint32_t            : 1;
    } SIMOBUCK4_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK5;                   /*!< (@ 0x00000350) SIMO Buck Muxed VDDC LV Low PowerSequence Trim
                                                                    Control                                                    */

    struct {
      __IOM uint32_t VDDCLVLEAKAGETRIM : 2;     /*!< [1..0] DEPRECATED                                                         */
      __IOM uint32_t VDDCLVLPDRVSTRTRIM : 2;    /*!< [3..2] VDDC LV low power trim control for drive strength.                 */
      __IOM uint32_t VDDCLVLPHIGHTOFFTRIMFINE : 4;/*!< [7..4] DEPRECATED.                                                      */
      __IOM uint32_t VDDCLVLPHIGHTOFFTRIM : 5;  /*!< [12..8] VDDC LV low power high toff trim control for Buck sequence.       */
      __IOM uint32_t VDDCLVLPHIGHTONTRIM : 5;   /*!< [17..13] VDDC LV low power high ton trim control for Buck sequence.       */
      __IOM uint32_t VDDCLVLPLOWTOFFTRIMFINE : 4;/*!< [21..18] DEPRECATED.                                                     */
      __IOM uint32_t VDDCLVLPLOWTOFFTRIM : 5;   /*!< [26..22] VDDC LV low power low toff trim control for Buck sequence.       */
      __IOM uint32_t VDDCLVLPLOWTONTRIM : 5;    /*!< [31..27] VDDC LV low power high ton trim control for Buck sequence.       */
    } SIMOBUCK5_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< (@ 0x00000354) SIMO Buck Muxed VDDF Active Sequence Trim Control          */

    struct {
      __IOM uint32_t VDDFACTDRVSTRTRIM : 2;     /*!< [1..0] VDDF active high toff trim for drive strength.                     */
      __IOM uint32_t VDDFACTFBTRIM : 6;         /*!< [7..2] DEPRECATED                                                         */
      __IOM uint32_t VDDFACTHIGHTOFFTRIMFINE : 4;/*!< [11..8] DEPRECATED.                                                      */
      __IOM uint32_t VDDFACTHIGHTOFFTRIM : 5;   /*!< [16..12] VDDF active high toff trim control for Buck sequence.            */
      __IOM uint32_t VDDFACTHIGHTONTRIM : 5;    /*!< [21..17] VDDF active high ton trim control for Buck sequence.             */
      __IOM uint32_t VDDFACTINPREFSEL : 1;      /*!< [22..22] DEPRECATED                                                       */
      __IOM uint32_t VDDFACTTRIM : 6;           /*!< [28..23] VDDF active trim.                                                */
      __IOM uint32_t VDDFINPREFSEL : 1;         /*!< [29..29] DEPRECATED                                                       */
      __IOM uint32_t VDDFLEAKAGETRIM : 2;       /*!< [31..30] DEPRECATED                                                       */
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< (@ 0x00000358) SIMO Buck Muxed VDDF active Sequence Trim Control          */

    struct {
      __IOM uint32_t VDDFACTLOWTOFFTRIMFINE : 3;/*!< [2..0] DEPRECATED.                                                        */
      __IOM uint32_t VDDFACTLOWTOFFTRIM : 5;    /*!< [7..3] VDDF active low toff trim control for Buck sequence.               */
      __IOM uint32_t VDDFACTLOWTONTRIM : 5;     /*!< [12..8] VDDF active low ton trim control for Buck sequence.               */
      __IOM uint32_t VDDFLPDRVSTRTRIM : 2;      /*!< [14..13] VDDF active trim control for drive strength.                     */
      __IOM uint32_t VDDFLPFBCDACEN : 1;        /*!< [15..15] DEPRECATED                                                       */
      __IOM uint32_t VDDFLPFBCDACTRIM : 2;      /*!< [17..16] DEPRECATED                                                       */
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< [22..18] Zxcomp trim. Feedthrough to analog.                              */
      __IOM uint32_t VDDFLPINPREFSEL : 2;       /*!< [24..23] DEPRECATED                                                       */
      __IOM uint32_t VDDFLPTRIM : 6;            /*!< [30..25] VDDF low power trim.                                             */
            uint32_t            : 1;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< (@ 0x0000035C) SIMO Buck Muxed VDDF Low Power Sequence Trim
                                                                    Control                                                    */

    struct {
      __IOM uint32_t VDDFLPHIGHTOFFTRIMFINE : 4;/*!< [3..0] DEPRECATED.                                                        */
      __IOM uint32_t VDDFLPHIGHTOFFTRIM : 5;    /*!< [8..4] VDDF low power high toff trim control for Buck sequence.           */
      __IOM uint32_t VDDFLPHIGHTONTRIM : 5;     /*!< [13..9] VDDF low power high ton trim control for Buck sequence.           */
      __IOM uint32_t VDDFLPLOWTOFFTRIMFINE : 4; /*!< [17..14] DEPRECATED.                                                      */
      __IOM uint32_t VDDFLPLOWTOFFTRIM : 5;     /*!< [22..18] VDDF low power low toff trim control for Buck sequence.          */
      __IOM uint32_t VDDFLPLOWTONTRIM : 5;      /*!< [27..23] VDDF low power low ton trim control for Buck sequence.           */
            uint32_t            : 4;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< (@ 0x00000360) SIMO Buck Muxed VDDS Active Sequence Trim Control          */

