AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t VDDSACTDRVSTRTRIM : 2;     /*!< [1..0] simobuck_vdds_act_drvstr_trim                                      */
      __IOM uint32_t VDDSACTFBTRIM : 6;         /*!< [7..2] DEPRECATED                                                         */
      __IOM uint32_t VDDSACTHIGHTOFFTRIMFINE : 4;/*!< [11..8] DEPRECATED.                                                      */
      __IOM uint32_t VDDSACTHIGHTOFFTRIM : 5;   /*!< [16..12] VDDS active high toff trim control for Buck sequence.            */
      __IOM uint32_t VDDSACTHIGHTONTRIM : 5;    /*!< [21..17] VDDS active high ton trim control for Buck sequence.             */
      __IOM uint32_t VDDSACTINPREFSEL : 1;      /*!< [22..22] DEPRECATED                                                       */
      __IOM uint32_t VDDSACTLOWTONTRIM : 5;     /*!< [27..23] VDDS active low ton trim control for Buck sequence.              */
      __IOM uint32_t VDDSLEAKAGETRIM : 1;       /*!< [28..28] DEPRECATED                                                       */
            uint32_t            : 3;
    } SIMOBUCK9_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK10;                  /*!< (@ 0x00000364) SIMO Buck Muxed VDDS active Sequence Trim Control          */

    struct {
      __IOM uint32_t VDDSACTLOWTOFFTRIMFINE : 4;/*!< [3..0] DEPRECATED.                                                        */
      __IOM uint32_t VDDSACTLOWTOFFTRIM : 5;    /*!< [8..4] VDDS active low toff trim control for Buck sequence.               */
      __IOM uint32_t VDDSLPDRVSTRTRIM : 2;      /*!< [10..9] VDDS low power trim control for drive strength.                   */
      __IOM uint32_t VDDSLPFBCDACEN : 1;        /*!< [11..11] DEPRECATED                                                       */
      __IOM uint32_t VDDSLPFBCDACTRIM : 2;      /*!< [13..12] DEPRECATED                                                       */
      __IOM uint32_t VDDSLPFBTRIM : 6;          /*!< [19..14] DEPRECATED                                                       */
      __IOM uint32_t VDDSLPHIGHTOFFTRIMFINE : 4;/*!< [23..20] DEPRECATED.                                                      */
      __IOM uint32_t VDDSLPHIGHTOFFTRIM : 5;    /*!< [28..24] VDDS low power high toff trim control for a Buck sequence.       */
            uint32_t            : 3;
    } SIMOBUCK10_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK11;                  /*!< (@ 0x00000368) SIMO Buck Muxed Sequence Trim Control                      */

    struct {
      __IOM uint32_t VDDSLPHIGHTONTRIM : 5;     /*!< [4..0] VDDS low power high ton trim control for a Buck sequence.          */
      __IOM uint32_t VDDSLPINPREFSEL : 1;       /*!< [5..5] DEPRECATED                                                         */
      __IOM uint32_t VDDSLPLOWTOFFTRIMFINE : 4; /*!< [9..6] DEPRECATED.                                                        */
      __IOM uint32_t VDDSLPLOWTOFFTRIM : 5;     /*!< [14..10] VDDS low power low toff trim control for a Buck sequence.        */
      __IOM uint32_t VDDSLPLOWTONTRIM : 5;      /*!< [19..15] VDDS low power low ton trim control for a Buck sequence.         */
      __IOM uint32_t TRIMCHANGEDLYPRE : 2;      /*!< [21..20] Delay used on the trims valid de-assertion before trims
                                                     are changed.                                                              */
      __IOM uint32_t TRIMCHANGEDLYPOST : 2;     /*!< [23..22] Delay used on the trims valid assertion after trims
                                                     are changed.                                                              */
      __IOM uint32_t ENBRNOUT   : 4;            /*!< [27..24] Enable each individual rail counter.                             */
            uint32_t            : 4;
    } SIMOBUCK11_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< (@ 0x0000036C) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
      __IOM uint32_t VDDCLVCOMPTRIMMINUS : 5;   /*!< [4..0] Static trim to allow separation between low power and
                                                     active rail.                                                              */
      __IOM uint32_t VDDCLVCOMPTRIMPLUS : 5;    /*!< [9..5] Static trim to allow separation when low power GT active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCLVBRNOUTTRIM : 10;     /*!< [19..10] Digital brown out max counter value for VDDC LV rail.            */
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< [25..20] Active VDDF trim.                                                */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< [31..26] Low power VDDF trim.                                             */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< (@ 0x00000370) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
      __IOM uint32_t VDDSCOMPTRIMMINUS : 5;     /*!< [4..0] Static trim to allow separation between low power and
                                                     active rail.                                                              */
      __IOM uint32_t VDDSCOMPTRIMPLUS : 5;      /*!< [9..5] Static trim to allow separation when low power GT active
                                                     rail.                                                                     */
      __IOM uint32_t VDDSBRNOUTTRIM : 10;       /*!< [19..10] Digital brown out max counter value for VDDS rail.               */
      __IOM uint32_t ACTTRIMVDDS : 6;           /*!< [25..20] Active VDDS trim.                                                */
      __IOM uint32_t LPTRIMVDDS : 6;            /*!< [31..26] Low power VDDS trim.                                             */
    } SIMOBUCK13_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK14;                  /*!< (@ 0x00000374) SIMO Buck Compare, Brown out, Active, Low power
                                                                    and Leakage Trim Control                                   */

