AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t SRAMWPROT1 : 32;           /*!< [31..0] Write protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu writes,
                                                     when set to 0, DMA may write the region.                                  */
    } SRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT2;                  /*!< (@ 0x000003D0) These bits write-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMWPROT2 : 32;           /*!< [31..0] Write protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu writes,
                                                     when set to 0, DMA may write the region.                                  */
    } SRAMWPROT2_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT3;                  /*!< (@ 0x000003D4) These bits write-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMWPROT3 : 32;           /*!< [31..0] Write protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu writes,
                                                     when set to 0, DMA may write the region.                                  */
    } SRAMWPROT3_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT4;                  /*!< (@ 0x000003D8) These bits write-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMWPROT4 : 32;           /*!< [31..0] Write protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu writes,
                                                     when set to 0, DMA may write the region.                                  */
    } SRAMWPROT4_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT5;                  /*!< (@ 0x000003DC) These bits write-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMWPROT5 : 32;           /*!< [31..0] Write protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu writes,
                                                     when set to 0, DMA may write the region.                                  */
    } SRAMWPROT5_b;
  } ;
  __IM  uint32_t  RESERVED24[4];

  union {
    __IOM uint32_t SRAMRPROT0;                  /*!< (@ 0x000003F0) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMRPROT0 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT1;                  /*!< (@ 0x000003F4) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMRPROT1 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT1_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT2;                  /*!< (@ 0x000003F8) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMRPROT2 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT2_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT3;                  /*!< (@ 0x000003FC) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

