AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t SRAMRPROT3 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT3_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT4;                  /*!< (@ 0x00000400) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMRPROT4 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT4_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT5;                  /*!< (@ 0x00000404) These bits read-protect system SRAM from non-cpu
                                                                    access in 16KB chunks.                                     */

    struct {
      __IOM uint32_t SRAMRPROT5 : 32;           /*!< [31..0] Read protect SRAM from non-cpu access. Each bit provides
                                                     write protection for an 16KB region of memory. When set
                                                     to 1, the region will be protected from non-cpu reads,
                                                     when set to 0, DMA may read the region.                                   */
    } SRAMRPROT5_b;
  } ;
  __IM  uint32_t  RESERVED25[10];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< (@ 0x00000430) Audio ADC Power Control                                    */

    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< [0..0] Audio ADC Power Control Software Override Enable                   */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< [1..1] Enable the Global audio ADC Power Switch on when set
                                                     to 1 if the AUDADCPWRCTRLSWE bit is set.                                  */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< [2..2] Enable the Analog, IO and SAR Digital logic Power Switch
                                                     on when set to 1 if the AUDADCPWRCTRLSWE bit is set.                      */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< [3..3] Bandgap and Temperature Sensor Power Switch Enable                 */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< [4..4] Reference Buffer Power Switch Enable                               */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< [5..5] Reference Buffer Keeper Power Switch Enable                        */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< [8..8] ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN
                                                     is switched off )                                                         */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< [9..9] ISOLATE signal for audio ADC Digital Contoller ( when
                                                     AUDADCAPSEN is switched off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< [10..10] RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< [12..12] Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< [15..14] Audio ADC input buffer mux select                                */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< [16..16] Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< [17..17] Audio ADC reference buffer slew enable                           */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< [18..18] Audio ADC reference keeper out en                                */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< (@ 0x00000434) Audio trims 1                                              */

    struct {
      __IOM uint32_t MICBIASMISCTRIM : 6;       /*!< [5..0] micbias_misc_trim                                                  */
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< [11..6] micbias_voltage_trim                                              */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< [12..12] micbias_pdnb                                                     */
            uint32_t            : 3;
      __IOM uint32_t PGAADCIFIBIASINTRIM : 1;   /*!< [16..16] pgaadcif_ibias_in_trim                                           */
      __IOM uint32_t PGAADCIFIBIASOUTTRIM : 3;  /*!< [19..17] pgaadcif_ibias_out_trim                                          */
      __IOM uint32_t PGAADCIFCCOMPTRIM : 2;     /*!< [21..20] pgaadcif_ccomp_trim                                              */
            uint32_t            : 10;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED26;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< (@ 0x0000043C) PGA ADCIF control                                          */

