AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< [1..0] pgaadcif_chA_active                                                */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< [3..2] pgaadcif_chA_pdnb                                                  */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< [5..4] pgaadcif_chB_active                                                */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< [7..6] pgaadcif_chB_pdnb                                                  */
      __IOM uint32_t PGAADCIFTESTPADEN : 1;     /*!< [8..8] pgaadcif_testpad_en                                                */
      __IOM uint32_t PGAADCIFTESTPADSEL : 3;    /*!< [11..9] pgaadcif_testpad_sel                                              */
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< [12..12] pgaadcif_vcomp_en                                                */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< [14..13] pgaadcif_vcomp_sel                                               */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< (@ 0x00000440) PGA control 1                                              */

    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< [2..0] d2a_pga_chA0_gain1_sel_vddh                                        */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< [3..3] d2a_pga_chA0_gain2_div2_sel_vddh                                   */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< [8..4] d2a_pga_chA0_gain2_sel_vddh                                        */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< [11..9] d2a_pga_chA1_gain1_sel_vddh                                       */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< [12..12] d2a_pga_chA1_gain2_div2_sel_vddh                                 */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< [17..13] d2a_pga_chA1_gain2_sel_vddh                                      */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< [19..18] d2a_pga_chA_bypass_en_vddh                                       */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< [21..20] d2a_pga_chA_opamp_in_pdnb_vddh                                   */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< [23..22] d2a_pga_chA_opamp_out_pdnb_vddh                                  */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< [24..24] d2a_pga_chA_vcmgen_pdnb_vddh                                     */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< [25..25] d2a_pga_chA_vcmgen_qcharge_en_vddh                               */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< [26..26] d2a_pga_irefgen_pdnb_vddh                                        */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< [27..27] d2a_pga_vrefgen_pdnb_vddh                                        */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< [28..28] d2a_pga_vrefgen_quickstart_en_vddh                               */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< [29..29] d2a_vcomp_sel_pga_vddh                                           */
            uint32_t            : 1;
      __IOM uint32_t PGAGAINAOVRD : 1;          /*!< [31..31] Apply BYPASS and GAIN bits from this register (for
                                                     channel A) instead of automatically via audio ADC. Note
                                                     that audio ADC FIFO meta data will not reflect dB gain
                                                     as used when configuring audio ADC.                                       */
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< (@ 0x00000444) PGA control 2                                              */

    struct {
      __IOM uint32_t PGACHB0GAIN1SEL : 3;       /*!< [2..0] d2a_pga_chB0_gain1_sel_vddh                                        */
      __IOM uint32_t PGACHB0GAIN2DIV2SEL : 1;   /*!< [3..3] d2a_pga_chB0_gain2_div2_sel_vddh                                   */
      __IOM uint32_t PGACHB0GAIN2SEL : 5;       /*!< [8..4] d2a_pga_chB0_gain2_sel_vddh                                        */
      __IOM uint32_t PGACHB1GAIN1SEL : 3;       /*!< [11..9] d2a_pga_chB1_gain1_sel_vddh                                       */
      __IOM uint32_t PGACHB1GAIN2DIV2SEL : 1;   /*!< [12..12] d2a_pga_chB1_gain2_div2_sel_vddh                                 */
      __IOM uint32_t PGACHB1GAIN2SEL : 5;       /*!< [17..13] d2a_pga_chB1_gain2_sel_vddh                                      */
      __IOM uint32_t PGACHBBYPASSEN : 2;        /*!< [19..18] d2a_pga_chB_bypass_en_vddh                                       */
      __IOM uint32_t PGACHBOPAMPINPDNB : 2;     /*!< [21..20] d2a_pga_chB_opamp_in_pdnb_vddh                                   */
      __IOM uint32_t PGACHBOPAMPOUTPDNB : 2;    /*!< [23..22] d2a_pga_chB_opamp_out_pdnb_vddh                                  */
      __IOM uint32_t PGACHBVCMGENPDNB : 1;      /*!< [24..24] d2a_pga_chB_vcmgen_pdnb_vddh                                     */
      __IOM uint32_t PGACHBVCMGENQCHARGEEN : 1; /*!< [25..25] d2a_pga_chB_vcmgen_qcharge_en_vddh                               */
            uint32_t            : 5;
      __IOM uint32_t PGAGAINBOVRD : 1;          /*!< [31..31] Apply BYPASS and GAIN bits from this register (for
                                                     channel B) instead of automatically via audio ADC. Note
                                                     that audio ADC FIFO meta data will not reflect dB gain
                                                     as used when configuring audio ADC.                                       */
    } PGACTRL2_b;
  } ;

  union {
    __IOM uint32_t AUDADCPWRDLY;                /*!< (@ 0x00000448) Audio ADC Power Up Delay Control                           */

    struct {
      __IOM uint32_t AUDADCPWR0 : 8;            /*!< [7..0] ADC Reference Buffer Power Enable delay in 64 ADC CLK
                                                     increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments
                                                     for ADC_CLKSEL = 0x2.                                                     */
      __IOM uint32_t AUDADCPWR1 : 8;            /*!< [15..8] ADC Reference Keeper enable delay in 16 ADC CLK increments
                                                     for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL
                                                     = 0x2.                                                                    */
            uint32_t            : 16;
    } AUDADCPWRDLY_b;
  } ;
  __IM  uint32_t  RESERVED27[2];

  union {
    __IOM uint32_t SDIO0CTRL;                   /*!< (@ 0x00000454) SDIO0/eMMC Control                                         */

