AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t PDMGLOBALEN : 1;           /*!< [0..0] PDM global enable to allow all PDMs to have synchronized
                                                     interface clocks and FIFO sampling.                                       */
            uint32_t            : 31;
    } PDMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED28[16];

  union {
    __IOM uint32_t DSIBIST;                     /*!< (@ 0x000004A0) DPHY BIST register for the Analog testing                  */

    struct {
      __IOM uint32_t DSIBISTLP  : 1;            /*!< [0..0] To enable the BIST this bit (dln_loop_back in hardware)
                                                     needs to be set to 1. This signal internally asserts the
                                                     clock for the BIST modules.                                               */
      __IOM uint32_t DSIBISTFORCEERR : 1;       /*!< [1..1] bist_force_error in hardware                                       */
      __IOM uint32_t DSIBISTMODE : 2;           /*!< [3..2] {bist_en_esc_lp, bist_en_esc_hs} in hardware.                      */
            uint32_t            : 4;
      __IOM uint32_t DSIBISTSEED : 8;           /*!< [15..8] bist_seed in hardware                                             */
            uint32_t            : 11;
      __IOM uint32_t DSIBISTERRRXHSSYNC : 1;    /*!< [27..27] Indicates the sync error conditions in HS mode.                  */
      __IOM uint32_t DSIBISTERRRXHS : 1;        /*!< [28..28] Indicates the normal error conditions in HS mode.                */
      __IOM uint32_t DSIBISTERRRXESCSYNC : 1;   /*!< [29..29] Indicates the sync error conditions in LP mode.                  */
      __IOM uint32_t DSIBISTERRRXESC : 1;       /*!< [30..30] Indicates the normal error conditions in LP mode. Also
                                                     indicates the RxClkEsc mode error.                                        */
      __IOM uint32_t DSIBISTDONE : 1;           /*!< [31..31] Status of the BIST engine, indicates the completion
                                                     as well as error conditions.                                              */
    } DSIBIST_b;
  } ;

  union {
    __IOM uint32_t MMSMISCCTRL;                 /*!< (@ 0x000004A4) MM Sytem Miscellaneous Control                             */

    struct {
      __IOM uint32_t GFXSRAMCHK : 1;            /*!< [0..0] Control bit for the sram power domain checking in GFX.             */
      __IOM uint32_t DISPSRAMCHK : 1;           /*!< [1..1] Control bit for the sram power domain checking in DC.              */
            uint32_t            : 30;
    } MMSMISCCTRL_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT4;                 /*!< (@ 0x000004A8) These bits write-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FW4BITS    : 32;           /*!< [31..0] Write protect flash 0x00200000 - 0x0027FFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT4_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT5;                 /*!< (@ 0x000004AC) These bits write-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FW5BITS    : 32;           /*!< [31..0] Write protect flash 0x00280000 - 0x002FFFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT5_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT6;                 /*!< (@ 0x000004B0) These bits write-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FW6BITS    : 32;           /*!< [31..0] Write protect flash 0x00300000 - 0x0037FFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT6_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT7;                 /*!< (@ 0x000004B4) These bits write-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

