AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FW7BITS    : 32;           /*!< [31..0] Write protect flash 0x00380000 - 0x004FFFFF. Each bit
                                                     provides write protection for 16KB chunks of flash data
                                                     space. Bits are cleared by writing a 1 to the bit. When
                                                     read, 0 indicates the region is protected. Bits are sticky
                                                     (can be set when PROTLOCK is 1, but only cleared by reset)                */
    } FLASHWPROT7_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT4;                 /*!< (@ 0x000004B8) These bits read-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FR4BITS    : 32;           /*!< [31..0] Copy (read) protect flash 0x00200000 - 0x0027FFFF. Each
                                                     bit provides read protection for 16KB chunks of flash.
                                                     Bits are cleared by writing a 1 to the bit. When read,
                                                     0 indicates the region is protected. Bits are sticky (can
                                                     be set when PROTLOCK is 1, but only cleared by reset)                     */
    } FLASHRPROT4_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT5;                 /*!< (@ 0x000004BC) These bits read-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FR5BITS    : 32;           /*!< [31..0] Copy (read) protect flash 0x00280000 - 0x002FFFFF. Each
                                                     bit provides read protection for 16KB chunks of flash.
                                                     Bits are cleared by writing a 1 to the bit. When read,
                                                     0 indicates the region is protected. Bits are sticky (can
                                                     be set when PROTLOCK is 1, but only cleared by reset)                     */
    } FLASHRPROT5_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT6;                 /*!< (@ 0x000004C0) These bits read-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FR6BITS    : 32;           /*!< [31..0] Copy (read) protect flash 0x00300000 - 0x0037FFFF. Each
                                                     bit provides read protection for 16KB chunks of flash.
                                                     Bits are cleared by writing a 1 to the bit. When read,
                                                     0 indicates the region is protected. Bits are sticky (can
                                                     be set when PROTLOCK is 1, but only cleared by reset)                     */
    } FLASHRPROT6_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT7;                 /*!< (@ 0x000004C4) These bits read-protect flash in 16KB chunks,
                                                                    but cpu still can excute from that that
                                                                    memory.                                                    */

    struct {
      __IOM uint32_t FR7BITS    : 32;           /*!< [31..0] Copy (read) protect flash 0x00380000 - 0x003FFFFF. Each
                                                     bit provides read protection for 16KB chunks of flash.
                                                     Bits are cleared by writing a 1 to the bit. When read,
                                                     0 indicates the region is protected. Bits are sticky (can
                                                     be set when PROTLOCK is 1, but only cleared by reset)                     */
    } FLASHRPROT7_b;
  } ;

  union {
    __IOM uint32_t PWRSW2;                      /*!< (@ 0x000004C8) PWRSW Control 2                                            */

    struct {
      __IOM uint32_t PWRSWVDDGFXDYNSEL : 1;     /*!< [0..0] override value for pwrsw_vddgfx_dynsel                             */
      __IOM uint32_t PWRSWVDDGFXSTATSEL : 1;    /*!< [1..1] override value for pwrsw_vddgfx_statsel                            */
      __IOM uint32_t PWRSWVDDGFXOVERRIDE : 1;   /*!< [2..2] override enable for pwrsw_vddgfx_dynsel and pgn                    */
            uint32_t            : 29;
    } PWRSW2_b;
  } ;

  union {
    __IOM uint32_t CPUCFG;                      /*!< (@ 0x000004CC) CPU config                                                 */

    struct {
      __IOM uint32_t INITTCMDIS : 2;            /*!< [1..0] INIT TCM disable                                                   */
      __IOM uint32_t INITPAHBDIS : 1;           /*!< [2..2] InitPAHB disable                                                   */
      __IOM uint32_t INITL1RSTDIS : 1;          /*!< [3..3] Init L1 reset diable                                               */
      __IOM uint32_t CFGNSSTCALIB : 26;         /*!< [29..4] CFGNSST calib value                                               */
            uint32_t            : 2;
    } CPUCFG_b;
  } ;
  __IM  uint32_t  RESERVED29[2];

  union {
    __IOM uint32_t PLLCTL0;                     /*!< (@ 0x000004D8) This register controls power down and enable
                                                                    for various features of the system PLL                     */

