AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FOUTVCOPD  : 1;            /*!< [0..0] System PLL VCO rate output clock power down, connected
                                                     to PLL pin FOUTVCOPD                                                      */
      __IOM uint32_t FOUTPOSTDIVPD : 1;         /*!< [1..1] System PLL post divider power down, connected to PLL
                                                     pin FOUTPOSTDIVPD. Must enable when using 4-phase outputs                 */
      __IOM uint32_t FOUT4PHASEPD : 1;          /*!< [2..2] System PLL 4-phase clock generator power down, connected
                                                     to PLL pin FOUT4PHASEPD                                                   */
      __IOM uint32_t DSMPD      : 1;            /*!< [3..3] System PLL DSM (delta-sigma modulator) power down, connected
                                                     to PLL pin DSMPD                                                          */
      __IOM uint32_t DACPD      : 1;            /*!< [4..4] System PLL noise canceling DAC power down, connected
                                                     to PLL pin DACPD                                                          */
      __IOM uint32_t FREFSEL    : 1;            /*!< [5..5] System PLL reference clock select, connected to PLL pin
                                                     FREF                                                                      */
            uint32_t            : 2;
      __IOM uint32_t BYPASS     : 1;            /*!< [8..8] System PLL bypass, connected to PLL pin BYPASS                     */
      __IOM uint32_t VCOSELECT  : 1;            /*!< [9..9] System PLL VCO range select, connected to PLL pin VCOSEL           */
            uint32_t            : 19;
      __IOM uint32_t SYSPLLPDB  : 1;            /*!< [29..29] System PLL enable. When the PLL is enabled, SW must
                                                     ensure that the PLL receives adequate current by forcing
                                                     the LDO to be in active mode: SIMOBUCKACTIVE = 1 (in BUCK
                                                     mode), MEMLDOACTIVE = 1 (in LDO mode).                                    */
      __IOM uint32_t SYSPLLVDDHPDNB : 1;        /*!< [30..30] System PLL VDDH enable                                           */
      __IOM uint32_t SYSPLLVDDFPDNB : 1;        /*!< [31..31] System PLL VDDF enable                                           */
    } PLLCTL0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV0;                     /*!< (@ 0x000004DC) This register sets the fractional portion of
                                                                    the feedback divider when the system PLL
                                                                    is in fractional mode. Refer to the PLLTS22ULPHVLPFRACA
                                                                    datasheet for more details                                 */

    struct {
      __IOM uint32_t FRAC       : 24;           /*!< [23..0] System PLL feedback divide value (fractional portion),
                                                     connected to PLL pin FRAC[23:0]. Do not change FRAC while
                                                     the clock is in use as it can make the clock unstable.
                                                     First disable the clock, change FRAC, and then enable the
                                                     clock                                                                     */
            uint32_t            : 8;
    } PLLDIV0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV1;                     /*!< (@ 0x000004E0) This register sets the integer portion of the
                                                                    feedback divider along with the other dividers
                                                                    in the system PLL. Refer to the PLLTS22ULPHVLPFRACA
                                                                    datasheet for more details                                 */

    struct {
      __IOM uint32_t REFDIV     : 6;            /*!< [5..0] System PLL reference divide value, connnected to PLL
                                                     pin REFDIV[5:0]. Valid range is 1 to 63. A setting of 0
                                                     will send 1 to the PLL                                                    */
            uint32_t            : 2;
      __IOM uint32_t POSTDIV2   : 3;            /*!< [10..8] System PLL post divide 2 setting, connected to PLL pin
                                                     POSTDIV2[2:0]. Valid range is 1 to 7. A setting of 0 will
                                                     send 1 to the PLL. Total post divide is POSTDIV1*POSTDIV2.
                                                     The value of POSTDIV1 should be maximized before enabling
                                                     POSTDIV2.                                                                 */
            uint32_t            : 1;
      __IOM uint32_t POSTDIV1   : 3;            /*!< [14..12] System PLL post divide 1 setting, connected to PLL
                                                     pin POSTDIV1[2:0]. Valid range is 1 to 7. A setting of
                                                     0 will send 1 to the PLL. Total post divide is POSTDIV1*POSTDIV2          */
            uint32_t            : 1;
      __IOM uint32_t FBDIV      : 12;           /*!< [27..16] System PLL feedback divide value, connected to PLL
                                                     pin FBDIV[11:0]. Valid range is 4 to 960 in integer mode,
                                                     10 to 96 in fractional mode. Do not change FBDIV while
                                                     the clock is in use as it can make the clock unstable.
                                                     First disable the clock, change FBDIV, and then enable
                                                     the clock                                                                 */
            uint32_t            : 4;
    } PLLDIV1_b;
  } ;

  union {
    __IOM uint32_t PLLSTAT;                     /*!< (@ 0x000004E4) This register indicates the system PLL status              */

