AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t LOCK       : 1;            /*!< [0..0] System PLL lock signal, connected to PLL pin LOCK. Indicates
                                                     no cycle slip between the feedback clock and FPFD for 128
                                                     consecutive cycles                                                        */
            uint32_t            : 31;
    } PLLSTAT_b;
  } ;

  union {
    __IOM uint32_t PLLMUXCTL;                   /*!< (@ 0x000004E8) This register selects clock sources for the clocks
                                                                    that may be driven by the system PLL                       */

    struct {
      __IOM uint32_t PDMPLLCLKSEL : 2;          /*!< [1..0] PDM PLL clock select                                               */
      __IOM uint32_t AUDADCPLLCLKSEL : 2;       /*!< [3..2] AUDADC PLL clock select                                            */
      __IOM uint32_t USBPLLCLKSEL : 1;          /*!< [4..4] USB PLL clock select                                               */
      __IOM uint32_t I2S0PLLCLKSEL : 2;         /*!< [6..5] I2S0 PLL clock select                                              */
      __IOM uint32_t I2S1PLLCLKSEL : 2;         /*!< [8..7] I2S1 PLL clock select                                              */
            uint32_t            : 23;
    } PLLMUXCTL_b;
  } ;
} MCUCTRL_Type;                                 /*!< Size = 1260 (0x4ec)                                                       */



/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Multi-bit SPI Master (MSPI0)
  */

typedef struct {                                /*!< (@ 0x40060000) MSPI0 Structure                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< (@ 0x00000000) This register is used to enable individual PIO
                                                                    based transactions to a device on the bus.
                                                                    The CFG register must be programmed properly
                                                                    for the transfer, and the ADDR and INSTR
                                                                    registers should be programmed if the SENDI
                                                                    and SENDA fields are enabled.                              */

    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] Write to 1 to initiate a PIO transaction on the bus (typically
                                                     the entire register should be written at once with this
                                                     bit set).                                                                 */
      __IOM uint32_t STATUS     : 1;            /*!< [1..1] Command status: 1 indicates command has completed. Cleared
                                                     by writing 1 to this bit or starting a new transfer.                      */
      __IOM uint32_t BUSY       : 1;            /*!< [2..2] Command status: 1 indicates controller is busy (command
                                                     in progress)                                                              */
      __IOM uint32_t CONT       : 1;            /*!< [3..3] Continuation transfer. When 1, indicates that the MSPI
                                                     will hold CE low after the transaction completes. This
                                                     is included for compatibility with IOM module since the
                                                     MSPI transfer module can handle most cases in a single
                                                     transfer. NOTE: CONT functionality only works with CLKDIV=2
                                                     (24 MHz).                                                                 */
      __IOM uint32_t PIODEV     : 1;            /*!< [4..4] Selects the Device configutation to use for PIO requests           */
      __IOM uint32_t SENDA      : 1;            /*!< [5..5] Indicates whether an address phase should be sent (see
                                                     ADDR register and ASIZE field in CFG register)                            */
      __IOM uint32_t SENDI      : 1;            /*!< [6..6] Indicates whether an instruction phase should be sent
                                                     (see INSTR field and ISIZE field in CFG register)                         */
      __IOM uint32_t TXRX       : 1;            /*!< [7..7] 1 Indicates a TX operation, 0 indicates an RX operation
                                                     of XFERBYTES                                                              */
      __IOM uint32_t BIGENDIAN  : 1;            /*!< [8..8] 1 indicates data in FIFO is in big endian format (MSB
                                                     first); 0 indicates little endian data (default, LSB first).              */
      __IOM uint32_t PIOSCRAMBLE : 1;           /*!< [9..9] Enables data scrambling for PIO opertions. This should
                                                     only be used for data operations and never for commands
                                                     to a device.                                                              */
      __IOM uint32_t ENTURN     : 1;            /*!< [10..10] Indicates whether TX->RX turnaround cycles should be
                                                     enabled for this operation (see TURNAROUND field in CFG
                                                     register).                                                                */
      __IOM uint32_t ENDCX      : 1;            /*!< [11..11] Enable DCX signal on data [1]                                    */
      __IOM uint32_t ENWLAT     : 1;            /*!< [12..12] Enable Write Latency Counter (time between address
                                                     and first data byte). Counter value is WRITELATENCY.                      */
            uint32_t            : 3;
      __IOM uint32_t XFERBYTES  : 16;           /*!< [31..16] Number of bytes to transmit or receive (based on TXRX
                                                     bit)                                                                      */
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t CTRL1;                       /*!< (@ 0x00000004) These registers are used to enable individual
                                                                    PIO based transactions to a device on the
                                                                    bus. The CFG register must be programmed
                                                                    properly for the transfer, and the ADDR
                                                                    and INSTR registers should be programmed
                                                                    if the SENDI and SENDA fields are enabled.                 */

