AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t EMULATEDDR0 : 1;           /*!< [0..0] Drive external clock at 1/2 rate to emulate DDR mode               */
      __IOM uint32_t QUADDDR0   : 1;            /*!< [1..1] Deprecated. No effect on RevC.                                     */
      __IOM uint32_t ENABLEDQS0 : 1;            /*!< [2..2] In EMULATEDDR mode, enable DQS for read capture                    */
      __IOM uint32_t DQSSYNCNEG0 : 1;           /*!< [3..3] Use negative edge of clock for DDR data sync                       */
      __IOM uint32_t ENABLEFINEDELAY0 : 1;      /*!< [4..4] Enables use of delay line to provide fine control over
                                                     traditional RX capture clock.                                             */
      __IOM uint32_t TXDQSDELAY0 : 5;           /*!< [9..5] This acts as an offset to the computed value (should
                                                     be set to 0 by default)                                                   */
      __IOM uint32_t RXDQSDELAY0 : 5;           /*!< [14..10] This acts as an offset to the computed value (should
                                                     be set to 0 by default)                                                   */
      __IOM uint32_t RXDQSDELAYNEG0 : 5;        /*!< [19..15] This acts as an offset to the computed value (should
                                                     be set to 0 by default) of falling edge.                                  */
      __IOM uint32_t RXDQSDELAYNEGEN0 : 1;      /*!< [20..20] When 1, RXDQSDELAYNEG is used for falling edge of the
                                                     clock.                                                                    */
      __IOM uint32_t RXDQSDELAYHI0 : 5;         /*!< [25..21] This acts as an offset to the computed value (should
                                                     be set to 0 by default) for 2nd DQS on HEX mode.                          */
      __IOM uint32_t RXDQSDELAYNEGHI0 : 5;      /*!< [30..26] This acts as an offset to the computed value (should
                                                     be set to 0 by default) of falling edge for 2nd DQS on
                                                     HEX mode.                                                                 */
      __IOM uint32_t RXDQSDELAYHIEN0 : 1;       /*!< [31..31] When 1, RXDQSDELAYHI and RXDQSDELAYNEGHI is used for
                                                     falling edge of the clock.                                                */
    } DEV0DDR_b;
  } ;

  union {
    __IOM uint32_t DEV0CFG1;                    /*!< (@ 0x0000008C) Timing and mode configuration bits for the MSPI
                                                                    module.                                                    */

    struct {
      __IOM uint32_t SFTURN0    : 4;            /*!< [3..0] Subtract from internal counter of write latency and turnaround     */
      __IOM uint32_t RXCAPEXT0  : 1;            /*!< [4..4] Specify the number of apb_clk of RX capture phse {RXCAPEXT,
                                                     RXCAP}                                                                    */
      __IOM uint32_t SCLKRXHALT0 : 1;           /*!< [5..5] Halt sclk based on xfer_count                                      */
            uint32_t            : 1;
      __IOM uint32_t WBX0       : 1;            /*!< [7..7] Enable the support of WBX ( page boundary crossing on
                                                     write )                                                                   */
      __IOM uint32_t RBX0       : 1;            /*!< [8..8] Enable the support of RBX ( page boundary crossing on
                                                     read )                                                                    */
      __IOM uint32_t RXSMP0     : 2;            /*!< [10..9] Sampling edge based on sclk edge. No effect when div1             */
      __IOM uint32_t HYPERIO0   : 1;            /*!< [11..11] When using Windbond, set this bit to 1 to generate
                                                     CA[47:0] in hardware.                                                     */
      __IOM uint32_t TAFOURTH0  : 1;            /*!< [12..12] Add 1/4th mspi_clk in DDR to turnaround. Recommended
                                                     set this to 1 when EMULATEDDR is set in non-DQS mode (ENABLEDQS
                                                     = 0).                                                                     */
      __IOM uint32_t RXHI0      : 1;            /*!< [13..13] Force st_rx to start at clock high of mspi_clk                   */
      __IOM uint32_t DQSTURN0   : 3;            /*!< [16..14] In DQS mode, the internal cycle count to enable DQS
                                                     path.                                                                     */
      __IOM uint32_t CELATENCY0 : 2;            /*!< [18..17] Mem CE assertion latency before the first Mem transfer
                                                     clock                                                                     */
            uint32_t            : 10;
      __IOM uint32_t TXDATADELAY0 : 1;          /*!< [29..29] Delay TXDATA output by 1 clock cycle                             */
      __IOM uint32_t SDR250EN0  : 1;            /*!< [30..30] Enable MSPI core logic to run at the same frequency
                                                     as its input clock. This bit has no effect when DDREN is
                                                     1                                                                         */
      __IOM uint32_t DDREN0     : 1;            /*!< [31..31] New DDR mode/logic enable                                        */
    } DEV0CFG1_b;
  } ;

  union {
    __IOM uint32_t DEV0XIP;                     /*!< (@ 0x00000090) When any SPI flash is configured, this register
                                                                    must be properly programmed before XIP or
                                                                    AUTO DMA operations commence.                              */

