AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t CEBREAK0   : 12;           /*!< [11..0] Number of clock cycles for CE deassertion time                    */
      __IOM uint32_t XIPODD0    : 1;            /*!< [12..12] Convert odd starting address to word-aligned starting
                                                     address with byte-enables for holes. For example, an AXI
                                                     transaction with wstrb of 0x0600 results in mspi transaction
                                                     of addr=8 and BE=0b1001 ( active low ).                                   */
      __IOM uint32_t BEPOL0     : 1;            /*!< [13..13] byte mask polarity to MSPI xfer                                  */
      __IOM uint32_t BEON0      : 1;            /*!< [14..14] Byte enable always on for all lanes                              */
      __IOM uint32_t XIPBOUNDARY0 : 1;          /*!< [15..15] Deprecated. No effect on RevC.                                   */
            uint32_t            : 5;
      __IOM uint32_t APNDODD0   : 1;            /*!< [21..21] Append dummy byte to odd number of write                         */
            uint32_t            : 10;
    } DEV0XIPMISC_b;
  } ;

  union {
    __IOM uint32_t DEV0XIPCPURQ;                /*!< (@ 0x000000A4) XIP CPU Read Queue Configuration for AXI logic             */

    struct {
      __IOM uint32_t CPURQEN0   : 1;            /*!< [0..0] Enable CPU Read Queue                                              */
      __IOM uint32_t RID0MASK0  : 1;            /*!< [1..1] CPU Read ID 0 will in included in CPU Read Queue (if
                                                     CPURQEN=1) (Invalid for CM55 system)                                      */
      __IOM uint32_t RID1MASK0  : 1;            /*!< [2..2] CPU Read ID 1 will in included in CPU Read Queue (if
                                                     CPURQEN=1) (Invalid for CM55 system)                                      */
      __IOM uint32_t RID2MASK0  : 1;            /*!< [3..3] CPU Read ID 2 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t RID3MASK0  : 1;            /*!< [4..4] CPU Read ID 3 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t RID4MASK0  : 1;            /*!< [5..5] CPU Read ID 4 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t RID5MASK0  : 1;            /*!< [6..6] CPU Read ID 5 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t RID6MASK0  : 1;            /*!< [7..7] CPU Read ID 6 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t RID7MASK0  : 1;            /*!< [8..8] CPU Read ID 7 will in included in CPU Read Queue (if
                                                     CPURQEN=1)                                                                */
      __IOM uint32_t GQARB0     : 2;            /*!< [10..9] Arbitration Bias between General (Non-CPU) and CPU Rd
                                                     Queue                                                                     */
            uint32_t            : 21;
    } DEV0XIPCPURQ_b;
  } ;

  union {
    __IOM uint32_t DEV0DDRDLYEXT;               /*!< (@ 0x000000A8) DDR RX DQS Delayline MSB bits extenstion for
                                                                    DEV0DDR                                                    */

    struct {
      __IOM uint32_t RXDQS0PDLYEXT0 : 1;        /*!< [0..0] MSB extension to DEV0DDR.RXDQSDELAY0                               */
            uint32_t            : 7;
      __IOM uint32_t RXDQS0NDLYEXT0 : 1;        /*!< [8..8] MSB extension to DEV0DDR.RXDQSDELAYNEG0                            */
            uint32_t            : 7;
      __IOM uint32_t RXDQS1PDLYEXT0 : 1;        /*!< [16..16] MSB extension to DEV0DDR.RXDQSDELAYHI0                           */
            uint32_t            : 7;
      __IOM uint32_t RXDQS1NDLYEXT0 : 1;        /*!< [24..24] MSB extension to DEV0DDR.RXDQSDELAYNEGHI0                        */
            uint32_t            : 7;
    } DEV0DDRDLYEXT_b;
  } ;
  __IM  uint32_t  RESERVED3[21];

  union {
    __IOM uint32_t DMACFG;                      /*!< (@ 0x00000100) DMA Configuration                                          */

    struct {
      __IOM uint32_t DMAEN      : 2;            /*!< [1..0] DMA Enable. Setting this bit to EN will start the DMA
                                                     operation                                                                 */
      __IOM uint32_t DMADIR     : 1;            /*!< [2..2] Direction                                                          */
      __IOM uint32_t DMADEV     : 1;            /*!< [3..3] DMA Device Select                                                  */
      __IOM uint32_t DMAPRI     : 2;            /*!< [5..4] Sets the Priority of the DMA request                               */
            uint32_t            : 11;
      __IOM uint32_t DMATXEMPT  : 1;            /*!< [17..17] For DMA_M2P, only start when DMA fifo is not empty.              */
      __IOM uint32_t DMAPWROFF  : 1;            /*!< [18..18] Power off MSPI domain upon completion of DMA operation.          */
            uint32_t            : 13;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< (@ 0x00000104) DMA Status                                                 */

