AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t CQFLAGS    : 16;           /*!< [15..0] Current flag status (read-only). Bits [7:0] are software
                                                     controllable and bits [15:8] are hardware status.                         */
            uint32_t            : 16;
    } CQFLAGS_b;
  } ;

  union {
    __IOM uint32_t CQSETCLEAR;                  /*!< (@ 0x000002B4) Command Queue Flag Set/Clear                               */

    struct {
      __IOM uint32_t CQFSET     : 8;            /*!< [7..0] Set CQFlag status bits. Set has priority over clear if
                                                     both are high.                                                            */
      __IOM uint32_t CQFTOGGLE  : 8;            /*!< [15..8] Toggle CQFlag status bits                                         */
      __IOM uint32_t CQFCLR     : 8;            /*!< [23..16] Clear CQFlag status bits.                                        */
            uint32_t            : 8;
    } CQSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t CQPAUSE;                     /*!< (@ 0x000002B8) Command Queue Pause Mask                                   */

    struct {
      __IOM uint32_t CQMASK     : 16;           /*!< [15..0] CQ will pause processing when ALL specified events are
                                                     satisfied -- i.e. when (CQMASK and CQPAUSE)==CQMASK.                      */
            uint32_t            : 16;
    } CQPAUSE_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t CQCURIDX;                    /*!< (@ 0x000002C0) This register can be used in conjunction with
                                                                    the CQENDIDX register to manage the command
                                                                    queue. Typically software will initialize
                                                                    the CQCURIDX and CQENDIDX to the same value,
                                                                    which will cause the CQ to be paused when
                                                                    enabled. Software may then add entries to
                                                                    the command queue (in SRAM) and update CQENDIDX.
                                                                    The command queue operations will then increment
                                                                    CQCURIDX as it processes operations. Once
                                                                    CQCURIDX==CQENDIDX, the command queue hardware
                                                                    will automatically pause since no additional
                                                                    ope                                                        */

    struct {
      __IOM uint32_t CQCURIDX   : 8;            /*!< [7..0] Can be used to indicate the current position of the command
                                                     queue by having CQ operations write this field. A CQ hardware
                                                     status flag indicates when CURIDX and ENDIDX are not equal,
                                                     allowing SW to pause the CQ processing until the end index
                                                     is updated.                                                               */
            uint32_t            : 24;
    } CQCURIDX_b;
  } ;

  union {
    __IOM uint32_t CQENDIDX;                    /*!< (@ 0x000002C4) Command Queue End Index                                    */

    struct {
      __IOM uint32_t CQENDIDX   : 8;            /*!< [7..0] Can be used to indicate the end position of the command
                                                     queue. A CQ hardware status bit indices when CURIDX !=
                                                     ENDIDX so that the CQ can be paused when it reaches the
                                                     end pointer.                                                              */
            uint32_t            : 24;
    } CQENDIDX_b;
  } ;
} MSPI0_Type;                                   /*!< Size = 712 (0x2c8)                                                        */



/* =========================================================================================================================== */
/* ================                                            OTP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief OTP Controller (OTP)
  */

typedef struct {                                /*!< (@ 0x40014800) OTP Structure                                              */
  __IM  uint32_t  RESERVED[172];

  union {
    __IOM uint32_t INTERRUPT;                   /*!< (@ 0x000002B0) OTP Controller interrupt enable and status.                */

    struct {
      __IOM uint32_t PWRSUPPLY  : 1;            /*!< [0..0] Problem with power supply.                                         */
      __IOM uint32_t OUTDATA    : 1;            /*!< [1..1] Conflict with output data.                                         */
      __IOM uint32_t PARITYINPUT : 1;           /*!< [2..2] Input parity check failure.                                        */
      __IOM uint32_t SHIELDFAULT : 1;           /*!< [3..3] Metal shielding fault.                                             */
      __IOM uint32_t ACCESSPERMISSION : 1;      /*!< [4..4] Access permission error.                                           */
      __IOM uint32_t PARITYPSM  : 1;            /*!< [5..5] Parity error of the FSM.                                           */
      __IOM uint32_t PARITYCRITREG : 1;         /*!< [6..6] Parity error of critical reg.                                      */
            uint32_t            : 1;
      __IOM uint32_t RNGFAIL    : 1;            /*!< [8..8] RNG health check failure.                                          */
      __IOM uint32_t RNGCLKOFF  : 1;            /*!< [9..9] RNG internal clock is turned off.                                  */
            uint32_t            : 6;
      __IOM uint32_t IEPWRSUPPLY : 1;           /*!< [16..16] Enable PWRSUPPLY interrupts.                                     */
      __IOM uint32_t IEOUTDATA  : 1;            /*!< [17..17] Enable OUTDATA interrupts.                                       */
      __IOM uint32_t IEPARITYINPUT : 1;         /*!< [18..18] Enable PARITYINPUT interrupts.                                   */
      __IOM uint32_t IESHIELFFAULT : 1;         /*!< [19..19] Enable SHIELDFAULT interrupts.                                   */
      __IOM uint32_t IEACCESSPERMISSION : 1;    /*!< [20..20] Enable ACCESSPERMISSION interrupts.                              */
      __IOM uint32_t IEPARITYPSM : 1;           /*!< [21..21] Enable PARITYPSM interrupts.                                     */
      __IOM uint32_t IEPARITYCRITREG : 1;       /*!< [22..22] Enable PARITYCRITREG interrupts.                                 */
            uint32_t            : 1;
      __IOM uint32_t IERNGFAIL  : 1;            /*!< [24..24] Enable RNGFAIL interrupts.                                       */
      __IOM uint32_t IERNGCLKOFF : 1;           /*!< [25..25] Enable RNGCLKOFF interrupts.                                     */
            uint32_t            : 6;
    } INTERRUPT_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t PTMSTAT;                     /*!< (@ 0x000002C4) OTP Controller Status                                      */

