AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCUPERFREQ : 2;            /*!< [1..0] MCU Performance mode request                                       */
      __IOM uint32_t MCUPERFACK : 1;            /*!< [2..2] Indicates the MCU performance status indicated in STATUS
                                                     register is valid.                                                        */
      __IOM uint32_t MCUPERFSTATUS : 2;         /*!< [4..3] MCU Performance mode request                                       */
            uint32_t            : 24;
      __IOM uint32_t PWRENMCUE  : 1;            /*!< [29..29] Powerup MCUE power domain                                        */
      __IOM uint32_t PWRSTMCUE  : 2;            /*!< [31..30] Power Status MCUE subsystem                                      */
    } MCUPERFREQ_b;
  } ;

  union {
    __IOM uint32_t DEVPWREN;                    /*!< (@ 0x00000004) This enables various peripherals power domains.            */

    struct {
      __IOM uint32_t PWRENIOS0  : 1;            /*!< [0..0] Power up IO Slave 0                                                */
      __IOM uint32_t PWRENIOM0  : 1;            /*!< [1..1] Power up IO Master 0                                               */
      __IOM uint32_t PWRENIOM1  : 1;            /*!< [2..2] Power up IO Master 1                                               */
      __IOM uint32_t PWRENIOM2  : 1;            /*!< [3..3] Power up IO Master 2                                               */
      __IOM uint32_t PWRENIOM3  : 1;            /*!< [4..4] Power up IO Master 3                                               */
      __IOM uint32_t PWRENIOM4  : 1;            /*!< [5..5] Power up IO Master 4                                               */
      __IOM uint32_t PWRENIOM5  : 1;            /*!< [6..6] Power up IO Master 5                                               */
      __IOM uint32_t PWRENIOM6  : 1;            /*!< [7..7] Power up IO Master 6                                               */
      __IOM uint32_t PWRENIOM7  : 1;            /*!< [8..8] Power up IO Master 7                                               */
      __IOM uint32_t PWRENUART0 : 1;            /*!< [9..9] Power up UART Controller 0                                         */
      __IOM uint32_t PWRENUART1 : 1;            /*!< [10..10] Power up UART Controller 1                                       */
      __IOM uint32_t PWRENUART2 : 1;            /*!< [11..11] Power up UART Controller 2                                       */
      __IOM uint32_t PWRENUART3 : 1;            /*!< [12..12] Power up UART Controller 3                                       */
      __IOM uint32_t PWRENADC   : 1;            /*!< [13..13] Power up ADC Digital Controller                                  */
      __IOM uint32_t PWRENMSPI0 : 1;            /*!< [14..14] Power up MSPI Controller0                                        */
      __IOM uint32_t PWRENMSPI1 : 1;            /*!< [15..15] Power up MSPI Controller1                                        */
      __IOM uint32_t PWRENMSPI2 : 1;            /*!< [16..16] Power up MSPI Controller2                                        */
      __IOM uint32_t PWRENMSPI3 : 1;            /*!< [17..17] Power up MSPI Controller3                                        */
      __IOM uint32_t PWRENGFX   : 1;            /*!< [18..18] Power up GFX controller                                          */
      __IOM uint32_t PWRENDISP  : 1;            /*!< [19..19] Power up DISP controller                                         */
      __IOM uint32_t PWRENDISPPHY : 1;          /*!< [20..20] Power up DISP PHY                                                */
      __IOM uint32_t PWRENCRYPTO : 1;           /*!< [21..21] Power up CRYPTO module                                           */
      __IOM uint32_t PWRENSDIO0 : 1;            /*!< [22..22] Power up SDIO0 controller                                        */
      __IOM uint32_t PWRENSDIO1 : 1;            /*!< [23..23] Power up SDIO1 controller                                        */
      __IOM uint32_t PWRENUSB   : 1;            /*!< [24..24] Power up USB controller                                          */
      __IOM uint32_t PWRENUSBPHY : 1;           /*!< [25..25] Power up USB PHY                                                 */
      __IOM uint32_t PWRENDBG   : 1;            /*!< [26..26] Powerup DBG power domain                                         */
      __IOM uint32_t PWRENOTP   : 1;            /*!< [27..27] Powerup OTP power domain                                         */
      __IOM uint32_t PWRENIOSFD0 : 1;           /*!< [28..28] Power up IO FD Slave 0                                           */
      __IOM uint32_t PWRENIOSFD1 : 1;           /*!< [29..29] Power up IO FD Slave 1                                           */
            uint32_t            : 2;
    } DEVPWREN_b;
  } ;

  union {
    __IOM uint32_t DEVPWRSTATUS;                /*!< (@ 0x00000008) This provides the power status for the peripheral
                                                                    device domains controlled through DEVPWREN
                                                                    register. Value of 1 means the device is
                                                                    powred up and ready to be used and 0 means
                                                                    its not powered up.                                        */

    struct {
      __IOM uint32_t PWRSTIOS0  : 1;            /*!< [0..0] Power status IO Slave 0                                            */
      __IOM uint32_t PWRSTIOM0  : 1;            /*!< [1..1] Power status IO Master 0                                           */
      __IOM uint32_t PWRSTIOM1  : 1;            /*!< [2..2] Power status IO Master 1                                           */
      __IOM uint32_t PWRSTIOM2  : 1;            /*!< [3..3] Power status IO Master 2                                           */
      __IOM uint32_t PWRSTIOM3  : 1;            /*!< [4..4] Power status IO Master 3                                           */
      __IOM uint32_t PWRSTIOM4  : 1;            /*!< [5..5] Power status IO Master 4                                           */
      __IOM uint32_t PWRSTIOM5  : 1;            /*!< [6..6] Power Status IO Master 5                                           */
      __IOM uint32_t PWRSTIOM6  : 1;            /*!< [7..7] Power Status IO Master 6                                           */
      __IOM uint32_t PWRSTIOM7  : 1;            /*!< [8..8] Power Status IO Master 7                                           */
      __IOM uint32_t PWRSTUART0 : 1;            /*!< [9..9] Power Status UART Controller 0                                     */
      __IOM uint32_t PWRSTUART1 : 1;            /*!< [10..10] Power Status UART Controller 1                                   */
      __IOM uint32_t PWRSTUART2 : 1;            /*!< [11..11] Power Status UART Controller 2                                   */
      __IOM uint32_t PWRSTUART3 : 1;            /*!< [12..12] Power Status UART Controller 3                                   */
      __IOM uint32_t PWRSTADC   : 1;            /*!< [13..13] Power Status ADC Digital Controller                              */
      __IOM uint32_t PWRSTMSPI0 : 1;            /*!< [14..14] Power Status MSPI Controller0                                    */
      __IOM uint32_t PWRSTMSPI1 : 1;            /*!< [15..15] Power Status MSPI Controller1                                    */
      __IOM uint32_t PWRSTMSPI2 : 1;            /*!< [16..16] Power Status MSPI Controller2                                    */
      __IOM uint32_t PWRSTMSPI3 : 1;            /*!< [17..17] Power Status MSPI Controller3                                    */
      __IOM uint32_t PWRSTGFX   : 1;            /*!< [18..18] Power Status GFX controller                                      */
      __IOM uint32_t PWRSTDISP  : 1;            /*!< [19..19] Power Status DISP controller                                     */
      __IOM uint32_t PWRSTDISPPHY : 1;          /*!< [20..20] Power Status DISP PHY                                            */
      __IOM uint32_t PWRSTCRYPTO : 1;           /*!< [21..21] Power Status CRYPTO module                                       */
      __IOM uint32_t PWRSTSDIO0 : 1;            /*!< [22..22] Power Status SDIO0 controller                                    */
      __IOM uint32_t PWRSTSDIO1 : 1;            /*!< [23..23] Power Status SDIO1 controller                                    */
      __IOM uint32_t PWRSTUSB   : 1;            /*!< [24..24] Power Status USB controller                                      */
      __IOM uint32_t PWRSTUSBPHY : 1;           /*!< [25..25] Power Status USB PHY                                             */
      __IOM uint32_t PWRSTDBG   : 1;            /*!< [26..26] Power Status DBG subsystem                                       */
      __IOM uint32_t PWRSTOTP   : 1;            /*!< [27..27] Power Status OTP                                                 */
      __IOM uint32_t PWRSTIOSFD0 : 1;           /*!< [28..28] Power status IO FD Slave 0                                       */
      __IOM uint32_t PWRSTIOSFD1 : 1;           /*!< [29..29] Power status IO FD Slave 1                                       */
            uint32_t            : 2;
    } DEVPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWREN;                  /*!< (@ 0x0000000C) This enables various power domains in audio subsystem.     */

