AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRENPDM0  : 1;            /*!< [2..2] Power up audio subsystem PDM0 domain                               */
            uint32_t            : 3;
      __IOM uint32_t PWRENI2S0  : 1;            /*!< [6..6] Power up audio subsystem I2S0 domain                               */
      __IOM uint32_t PWRENI2S1  : 1;            /*!< [7..7] Power up audio subsystem I2S1 domain                               */
            uint32_t            : 2;
      __IOM uint32_t PWRENAUDADC : 1;           /*!< [10..10] Power up audio subsystem ADC domain                              */
            uint32_t            : 21;
    } AUDSSPWREN_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWRSTATUS;              /*!< (@ 0x00000010) This provides the power status for the peripheral
                                                                    domains controlled through AUDSSPWREN register.
                                                                    Value of 1 means the device is powred up
                                                                    and ready to be used and 0 means its not
                                                                    powered up.                                                */

    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRSTPDM0  : 1;            /*!< [2..2] Power Status audio subsystem PDM0 domain                           */
            uint32_t            : 3;
      __IOM uint32_t PWRSTI2S0  : 1;            /*!< [6..6] Power Status audio subsystem I2S0 domain                           */
      __IOM uint32_t PWRSTI2S1  : 1;            /*!< [7..7] Power Status audio subsystem I2S1 domain                           */
            uint32_t            : 2;
      __IOM uint32_t PWRSTAUDADC : 1;           /*!< [10..10] Power Status audio subsystem ADC domain                          */
            uint32_t            : 21;
    } AUDSSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMPWREN;                    /*!< (@ 0x00000014) This register enables the individual banks for
                                                                    the memories. When set, power will be enabled
                                                                    to the banks. This register works in conjunction
                                                                    with the MEMRETCFG register. If this register
                                                                    is not set, then power will always be disabled
                                                                    to the memory bank. Also, in case on NVM,
                                                                    To enable NVM1, NVM0 must also be enabled.
                                                                    And, Disabling power to NVM0, also disables
                                                                    power for NVM1.                                            */

    struct {
      __IOM uint32_t PWRENTCM   : 3;            /*!< [2..0] Power up Combination of DTCM and ITCM. Only 3 Combinations
                                                     are allowed - 0x1, 0x3 and 0x7. And, Setting 0x2 selects
                                                     ITCM128K_DTCM256K, Setting 0x4, 0x5, 0x6 selects ITCM256K_DTCM512K.       */
      __IOM uint32_t PWRENNVM   : 1;            /*!< [3..3] Power up NVM                                                       */
      __IOM uint32_t PWRENNVM1  : 1;            /*!< [4..4] Power up NVM1. PWRENNVM (Bit 3) MUST ALSO BE SET to 0x1.           */
      __IOM uint32_t PWRENROM   : 1;            /*!< [5..5] Power up ROM.                                                      */
            uint32_t            : 26;
    } MEMPWREN_b;
  } ;

  union {
    __IOM uint32_t MEMPWRSTATUS;                /*!< (@ 0x00000018) It provides the power status for all the memory
                                                                    banks including- caches, nvm (0 and 1) and
                                                                    all the SRAM groups. The status here should
                                                                    reflect the enable provided by the MEMPWREN
                                                                    register. There may be a lag time between
                                                                    setting the bits in MEMPWREN register and
                                                                    MEMPWRSTATUS register, due to the need to
                                                                    cycle the power gate and isolation seqeunces
                                                                    to the memory banks.                                       */

    struct {
      __IOM uint32_t PWRSTTCM   : 3;            /*!< [2..0] Power status for xTCM. Each bit corresponds to one of
                                                     the TCMs. bit0=TCM0_0, bit1=TCM0_1, bit2=TCM1.                            */
      __IOM uint32_t PWRSTNVM0  : 1;            /*!< [3..3] This bit is 1 if power is supplied to NVM 0                        */
      __IOM uint32_t PWRSTCACHE : 1;            /*!< [4..4] This bit is 1 if power is supplied to Cache                        */
            uint32_t            : 1;
      __IOM uint32_t PWRSTNVM1  : 1;            /*!< [6..6] This bit is 1 if power is supplied to NVM 1                        */
      __IOM uint32_t PWRSTROM   : 1;            /*!< [7..7] This bit is 1 if power is supplied to ROM                          */
            uint32_t            : 24;
    } MEMPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMRETCFG;                   /*!< (@ 0x0000001C) This controls the power down of the SRAM banks
                                                                    in deep sleep mode. If this is set, then
                                                                    the power for that SRAM bank will be gated
                                                                    when the core goes into deep sleep. Upon
                                                                    wake, the data within the SRAMs will be
                                                                    erased. If this is not set, retention voltage
                                                                    will be applied to the SRAM bank when the
                                                                    core goes into deep sleep. Upon wake, the
                                                                    data within the SRAMs are retained. Do not
                                                                    set this if the SRAM bank is used as the
                                                                    target for DMA transfer while CPU in deepsleep.            */

