AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t MCULEVEN   : 1;            /*!< [0..0] Control MCUL power-on status event                                 */
      __IOM uint32_t MCUHEVEN   : 1;            /*!< [1..1] Control MCUH power-on status event                                 */
      __IOM uint32_t HCPAEVEN   : 1;            /*!< [2..2] Control HCPA power-on status event                                 */
      __IOM uint32_t HCPBEVEN   : 1;            /*!< [3..3] Control HCPB power-on status event                                 */
      __IOM uint32_t HCPCEVEN   : 1;            /*!< [4..4] Control HCPC power-on status event                                 */
      __IOM uint32_t ADCEVEN    : 1;            /*!< [5..5] Control ADC power-on status event                                  */
            uint32_t            : 1;
      __IOM uint32_t AUDEVEN    : 1;            /*!< [7..7] Control AUD power-on status event                                  */
      __IOM uint32_t MSPIEVEN   : 1;            /*!< [8..8] Control MSPI power-on status event                                 */
      __IOM uint32_t MSPI1EVEN  : 1;            /*!< [9..9] Control MSPI1 power-on status event                                */
      __IOM uint32_t MSPI2EVEN  : 1;            /*!< [10..10] Control MSPI2 power-on status event                              */
      __IOM uint32_t MSPI3EVEN  : 1;            /*!< [11..11] Control MSPI3 power-on status event                              */
      __IOM uint32_t PDMEVEN    : 1;            /*!< [12..12] Control PDM power-on status event                                */
            uint32_t            : 19;
    } DEVPWREVENTEN_b;
  } ;

  union {
    __IOM uint32_t MEMPWREVENTEN;               /*!< (@ 0x00000034) This register controls which power enable for
                                                                    the memories will result in an event to
                                                                    the CPU. It includes all the power on status
                                                                    for the memory domains. If any bits are
                                                                    set, then if the domain is turned on, it
                                                                    will result in an event to the ARM core.                   */

    struct {
      __IOM uint32_t DTCMEN     : 3;            /*!< [2..0] Enable DTCM power-on status event                                  */
      __IOM uint32_t NVM0EN     : 1;            /*!< [3..3] Control NVM power-on status event                                  */
            uint32_t            : 28;
    } MEMPWREVENTEN_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t MMSOVERRIDE;                 /*!< (@ 0x00000040) Power domain behavior overrides related to MMS
                                                                    ( Multimedia System ).                                     */

    struct {
      __IOM uint32_t MMSOVRMCULDISP : 1;        /*!< [0..0] MMS override for MCUL on by PD_DISP setting.                       */
      __IOM uint32_t MMSOVRMCULGFX : 1;         /*!< [1..1] MMS override for MCUL on by PD_GFX setting. NOTE: THIS
                                                     BIT MUST ALWAYS BE SET TO 0.                                              */
      __IOM uint32_t MMSOVRSSRAMDISP : 1;       /*!< [2..2] MMS override for SSRAM power state by PD_DISP power setting.       */
      __IOM uint32_t MMSOVRSSRAMGFX : 1;        /*!< [3..3] MMS override for SSRAM power state by PD_GFX power setting.        */
            uint32_t            : 4;
      __IOM uint32_t MMSOVRSSRAMRETDISP : 3;    /*!< [10..8] If set, retention equation doesn't consider DISP. Each
                                                     bit corresponds to a domain.                                              */
      __IOM uint32_t MMSOVRSSRAMRETGFX : 3;     /*!< [13..11] If set, retention equation doesn't consider GFX. Each
                                                     bit corresponds to a domain.                                              */
            uint32_t            : 18;
    } MMSOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t CPUPWRCTRL;                  /*!< (@ 0x00000050) This register contains override settings to override
                                                                    legacy_mode trim bit setting                               */

    struct {
            uint32_t            : 2;
      __IOM uint32_t SLEEPMODE  : 1;            /*!< [2..2] Control to select between Ambiq sleep and ARM sleep                */
      __IOM uint32_t EPUMODEOVREN : 1;          /*!< [3..3] EPU Mode override                                                  */
      __IOM uint32_t EPUPWRSTATE : 2;           /*!< [5..4] EPU Power State                                                    */
      __IOM uint32_t CPUCLKOVREN : 1;           /*!< [6..6] CPU clock override enable                                          */
      __IOM uint32_t IWICCLKSTATE : 1;          /*!< [7..7] IWIC Clock state                                                   */
            uint32_t            : 1;
      __IOM uint32_t PMUCLKSTATE : 1;           /*!< [9..9] PMU Clock state                                                    */
      __IOM uint32_t FCLKSTATE  : 1;            /*!< [10..10] FCLK Clock state                                                 */
      __IOM uint32_t DBGCLKSTATE : 1;           /*!< [11..11] DBG Clock state                                                  */
      __IOM uint32_t DISFUNCRETMODE : 1;        /*!< [12..12] SW Override to disable FUNC_RET mode                             */
            uint32_t            : 19;
    } CPUPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t PWRCTRLMODESTATUS;           /*!< (@ 0x00000054) This register indicates power control operational
                                                                    mode                                                       */

