AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t LEGACYMODEST : 1;          /*!< [0..0] Legacy Mode value                                                  */
            uint32_t            : 31;
    } PWRCTRLMODESTATUS_b;
  } ;

  union {
    __IOM uint32_t CPUPWRSTATUS;                /*!< (@ 0x00000058) This register indicates the accepted power state
                                                                    request sent to pwr_ctrl                                   */

    struct {
      __IOM uint32_t CPUARMSLEEP : 1;           /*!< [0..0] Indicates M55 entered ARM SLEEP mode (clkin ungated,
                                                     internal M55 clock gating via Q-channel signaling). Write
                                                     1 to clear                                                                */
      __IOM uint32_t CPUAMBIQSLEEP : 1;         /*!< [1..1] Indicates M55 entered Ambiq SLEEP mode (clkin gated).
                                                     Write 1 to clear                                                          */
      __IOM uint32_t CPULP      : 1;            /*!< [2..2] Indicates M55 entered LP mode. Write 1 to clear                    */
      __IOM uint32_t CPUHP      : 1;            /*!< [3..3] Indicates M55 entered HP mode. Write 1 to clear                    */
            uint32_t            : 15;
      __IOM uint32_t FULLRETCACHE : 1;          /*!< [19..19] Indicates M55 entered the FULL_RET (Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t LOGICRETCACHE : 1;         /*!< [20..20] Indicates M55 entered the LOGIC_RET (Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t FUNCRETCACHE : 1;          /*!< [21..21] Indicates M55 entered the FUNC_RET (Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t EPUOFFCACHE : 1;           /*!< [22..22] Indicates M55 entered the EPU_OFF (Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t ONCACHE    : 1;            /*!< [23..23] Indicates M55 entered the ON (Cache) power state, Write
                                                     1 to clear                                                                */
      __IOM uint32_t MEMRETCACHE : 1;           /*!< [24..24] Indicates M55 entered the MEM_RET (Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t FULLRETNOCACHE : 1;        /*!< [25..25] Indicates M55 entered the FULL_RET (NO Cache) power
                                                     state, Write 1 to clear                                                   */
      __IOM uint32_t LOGICRETNOCACHE : 1;       /*!< [26..26] Indicates M55 entered the LOGIC_RET (NO Cache) power
                                                     state, Write 1 to clear                                                   */
      __IOM uint32_t FUNCRETNOCACHE : 1;        /*!< [27..27] Indicates M55 entered the FUNC_RET (NO Cache) power
                                                     state, Write 1 to clear                                                   */
      __IOM uint32_t EPUOFFNOCACHE : 1;         /*!< [28..28] Indicates M55 entered the EPU_OFF (NO Cache) power
                                                     state, Write 1 to clear                                                   */
      __IOM uint32_t ONNOCACHE  : 1;            /*!< [29..29] Indicates M55 entered the ON (NO Cache) power state,
                                                     Write 1 to clear                                                          */
      __IOM uint32_t MEMRETNOCACHE : 1;         /*!< [30..30] Indicates M55 entered the MEM_RET (NO Cache) power
                                                     state, Write 1 to clear                                                   */
            uint32_t            : 1;
    } CPUPWRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED2[10];

  union {
    __IOM uint32_t PWRACKOVR;                   /*!< (@ 0x00000084) This register contains override bit fields for
                                                                    various power domain power switch acknowledge
                                                                    notification. As a part of power up sequnce,
                                                                    Power controller will look for power switch
                                                                    ack to advance power up sequence. It is
                                                                    possible for power controller to be a forever
                                                                    wait state in case of a unforeseen HW bug.
                                                                    This register defines a bit fileds to work
                                                                    around if needed in such a situation. The
                                                                    default behavior is to use HW power switch
                                                                    ack. Software can set it to override this
                                                                    feature for ea                                             */

    struct {
      __IOM uint32_t PWRACKOVERRIDEADC : 1;     /*!< [0..0] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEAUD : 1;     /*!< [1..1] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEAUDADC : 1;  /*!< [2..2] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDECRYPTO : 1;  /*!< [3..3] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEDBG : 1;     /*!< [4..4] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEDISP : 1;    /*!< [5..5] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEDISPPHY : 1; /*!< [6..6] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEGFX : 1;     /*!< [7..7] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEHCPA : 1;    /*!< [8..8] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEHCPB : 1;    /*!< [9..9] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEHCPC : 1;    /*!< [10..10] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEIOS : 1;     /*!< [11..11] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMCUL : 1;    /*!< [12..12] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
            uint32_t            : 1;
      __IOM uint32_t PWRACKOVERRIDESDIO0 : 1;   /*!< [14..14] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEUSB : 1;     /*!< [15..15] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEUSBPHY : 1;  /*!< [16..16] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEPDM : 1;     /*!< [17..17] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDESDIO1 : 1;   /*!< [18..18] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEOTP : 1;     /*!< [19..19] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMCUE : 1;    /*!< [20..20] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEROM : 1;     /*!< [21..21] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMSPI : 1;    /*!< [22..22] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMSPI1 : 1;   /*!< [23..23] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMSPI2 : 1;   /*!< [24..24] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
      __IOM uint32_t PWRACKOVERRIDEMSPI3 : 1;   /*!< [25..25] Power switch acknowledgement override from Power switch
                                                     to power control ST MC                                                    */
            uint32_t            : 6;
    } PWRACKOVR_b;
  } ;

  union {
    __IOM uint32_t PWRCNTDEFVAL;                /*!< (@ 0x00000088) This register contains programmble dealy values
                                                                    for various state michines. Fields contain
                                                                    dev st machine default value, SIMOBUCK state
                                                                    machine wait delay counter etc.                            */

