AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t PWRDEFVALDEVSTMC : 6;      /*!< [5..0] Default count max value for dev ST MC                              */
      __IOM uint32_t PWRACKWAITDELSIMOSTMC : 10;/*!< [15..6] Default counter max for buck ST MC                                */
            uint32_t            : 16;
    } PWRCNTDEFVAL_b;
  } ;

  union {
    __IOM uint32_t GFXPERFREQ;                  /*!< (@ 0x0000008C) This register provides the performance mode knobs
                                                                    for GFX.                                                   */

    struct {
      __IOM uint32_t GFXPERFREQ : 2;            /*!< [1..0] GFX Performance mode request                                       */
            uint32_t            : 30;
    } GFXPERFREQ_b;
  } ;

  union {
    __IOM uint32_t GFXPWRSWSEL;                 /*!< (@ 0x00000090) This register provides the performance mode knobs
                                                                    for GFX.                                                   */

    struct {
      __IOM uint32_t GFXVDDSEL  : 1;            /*!< [0..0] GFX VDD select                                                     */
            uint32_t            : 31;
    } GFXPWRSWSEL_b;
  } ;

  union {
    __IOM uint32_t EPURETCFG;                   /*!< (@ 0x00000094) This controls the retention of EPU in system
                                                                    deep sleep mode. If this is set, when core
                                                                    goes into deepsleep mode, EPU flops will
                                                                    be in logic retention. When this is not
                                                                    set, EPU will be powered down when core
                                                                    goes into deepsleep.                                       */

    struct {
      __IOM uint32_t EPURETSLP  : 1;            /*!< [0..0] EPU retention select                                               */
            uint32_t            : 31;
    } EPURETCFG_b;
  } ;
  __IM  uint32_t  RESERVED3[26];

  union {
    __IOM uint32_t VRCTRL;                      /*!< (@ 0x00000100) This register includes additional debug control
                                                                    bits. This is an internal Ambiq-only register.
                                                                    Customers should not attempt to change this
                                                                    or else functionality cannot be guaranteed.                */

    struct {
      __IOM uint32_t SIMOBUCKEN : 1;            /*!< [0..0] Enables and Selects the SIMO Buck as the supply for the
                                                     low-voltage power domains. It takes the initial value from
                                                     the bit set in Customer INFO space.                                       */
            uint32_t            : 31;
    } VRCTRL_b;
  } ;

  union {
    __IOM uint32_t LEGACYVRLPOVR;               /*!< (@ 0x00000104) When an override is set for a power domain, VR
                                                                    logic will ignore that power domain state
                                                                    in making a decision to go into lp state.                  */

    struct {
      __IOM uint32_t IGNOREIOS  : 1;            /*!< [0..0] Ignore IOS                                                         */
      __IOM uint32_t IGNOREHCPA : 1;            /*!< [1..1] Ignore HCPA                                                        */
      __IOM uint32_t IGNOREHCPB : 1;            /*!< [2..2] Ignore HCPB                                                        */
      __IOM uint32_t IGNOREHCPC : 1;            /*!< [3..3] Ignore HCPC                                                        */
      __IOM uint32_t IGNOREHCPD : 1;            /*!< [4..4] Ignore HCPD                                                        */
      __IOM uint32_t IGNOREHCPE : 1;            /*!< [5..5] Ignore HCPE                                                        */
            uint32_t            : 1;
      __IOM uint32_t IGNOREGFX  : 1;            /*!< [7..7] Ignore GFX                                                         */
      __IOM uint32_t IGNOREDISP : 1;            /*!< [8..8] Ignore DISP Control                                                */
      __IOM uint32_t IGNOREDISPPHY : 1;         /*!< [9..9] Ignore DISP PHY                                                    */
      __IOM uint32_t IGNORECRYPTO : 1;          /*!< [10..10] Ignore CRYPTO                                                    */
      __IOM uint32_t IGNORESDIO0 : 1;           /*!< [11..11] Ignore SDIO0                                                     */
      __IOM uint32_t IGNOREUSB  : 1;            /*!< [12..12] Ignore USB Control                                               */
      __IOM uint32_t IGNOREUSBPHY : 1;          /*!< [13..13] Ignore USB PHY                                                   */
      __IOM uint32_t IGNOREAUD  : 1;            /*!< [14..14] Ignore AUD                                                       */
            uint32_t            : 3;
      __IOM uint32_t IGNOREDBG  : 1;            /*!< [18..18] Ignore DBG                                                       */
      __IOM uint32_t IGNORESDIO1 : 1;           /*!< [19..19] Ignore SDIO1                                                     */
      __IOM uint32_t IGNOREOTP  : 1;            /*!< [20..20] Ignore OTP                                                       */
      __IOM uint32_t IGNOREMCUE : 1;            /*!< [21..21] Ignore MCUE                                                      */
      __IOM uint32_t IGNOREMSPI : 1;            /*!< [22..22] Ignore MSPI                                                      */
      __IOM uint32_t IGNOREMSPI1 : 1;           /*!< [23..23] Ignore MSPI                                                      */
      __IOM uint32_t IGNOREMSPI2 : 1;           /*!< [24..24] Ignore MSPI                                                      */
      __IOM uint32_t IGNOREMSPI3 : 1;           /*!< [25..25] Ignore MSPI                                                      */
      __IOM uint32_t IGNOREPDM  : 1;            /*!< [26..26] Ignore PDM                                                       */
            uint32_t            : 5;
    } LEGACYVRLPOVR_b;
  } ;

  union {
    __IOM uint32_t VRSTATUS;                    /*!< (@ 0x00000108) Provides BUCK and LDOs status.                             */

