AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t LPOVRTHRESHVDDS : 32;      /*!< [31..0] vdds lp override threshold for ton counter comparator             */
    } LPOVRTHRESHVDDS_b;
  } ;

  union {
    __IOM uint32_t LPOVRHYSTCNT;                /*!< (@ 0x000001A8) Low power override hysteresis count                        */

    struct {
      __IOM uint32_t LPOVRHYSTCNT : 32;         /*!< [31..0] lp hysteresis count                                               */
    } LPOVRHYSTCNT_b;
  } ;

  union {
    __IOM uint32_t LPOVRTHRESHVDDF;             /*!< (@ 0x000001AC) Low power override for VDDF                                */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDF : 32;      /*!< [31..0] vddf lp override threshold for ton counter comparator             */
    } LPOVRTHRESHVDDF_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t LPOVRTHRESHVDDC;             /*!< (@ 0x000001B4) Low power override for VDDC                                */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDC : 32;      /*!< [31..0] vddc lp override threshold for ton counter comparator             */
    } LPOVRTHRESHVDDC_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t LPOVRTHRESHVDDCLV;           /*!< (@ 0x000001BC) Low power override for VDDC_LV                             */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDCLV : 32;    /*!< [31..0] vddc_lv lp override threshold for ton counter comparator          */
    } LPOVRTHRESHVDDCLV_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t LPOVRSTAT;                   /*!< (@ 0x000001C4) Low power override status register                         */

    struct {
      __IOM uint32_t LPOVRTRIG  : 1;            /*!< [0..0] VDDS LP override has been triggered; write 1 to clear              */
            uint32_t            : 31;
    } LPOVRSTAT_b;
  } ;

  union {
    __IOM uint32_t MRAMEXTCTRL;                 /*!< (@ 0x000001C8) MRAM control register                                      */

    struct {
      __IOM uint32_t MRAMTMCCLKGATDIS : 1;      /*!< [0..0] disable last tmc_clk/tmc_clk_inv clock gate                        */
      __IOM uint32_t MRAMAUTOWAKEUPCTRL : 2;    /*!< [2..1] over write rst_auto_wk for TMC IP. auto wake up is enabled
                                                     at default. write 0x3 to this field to disable the auto
                                                     wake up.                                                                  */
      __IOM uint32_t MRAMHARDRECALL : 1;        /*!< [3..3] over write send recall command from hardware side                  */
      __IOM uint32_t MRAMLPRDYNAMIC : 1;        /*!< [4..4] bypass lpr dynamic mode                                            */
            uint32_t            : 27;
    } MRAMEXTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED9[13];

  union {
    __IOM uint32_t EMONCTRL;                    /*!< (@ 0x00000200) Controls each of the energy monitor conuters               */

    struct {
      __IOM uint32_t FREEZE     : 8;            /*!< [7..0] Freeze the counter. Each bit corresponds to a counter.
                                                     0: Let the counter run. 1: Stop the counter.                              */
      __IOM uint32_t CLEAR      : 8;            /*!< [15..8] Clear the counter. Each bit corresponds to a counter.
                                                     0: Let the counter run run on its input clk. 1: Clear the
                                                     counter                                                                   */
            uint32_t            : 16;
    } EMONCTRL_b;
  } ;

  union {
    __IOM uint32_t EMONCFG0;                    /*!< (@ 0x00000204) The counter increments when the counter is enabled
                                                                    and the mode selected here matches the power
                                                                    mode.                                                      */

    struct {
      __IOM uint32_t EMONSEL0   : 8;            /*!< [7..0] Power modes for incrementing the counter                           */
            uint32_t            : 24;
    } EMONCFG0_b;
  } ;

  union {
    __IOM uint32_t EMONCFG1;                    /*!< (@ 0x00000208) The counter increments when the counter is enabled
                                                                    and the mode selected here matches the power
                                                                    mode.                                                      */

    struct {
      __IOM uint32_t EMONSEL1   : 8;            /*!< [7..0] Power modes for incrementing the counter                           */
            uint32_t            : 24;
    } EMONCFG1_b;
  } ;

  union {
    __IOM uint32_t EMONCFG2;                    /*!< (@ 0x0000020C) The counter increments when the counter is enabled
                                                                    and the mode selected here matches the power
                                                                    mode.                                                      */

    struct {
      __IOM uint32_t EMONSEL2   : 8;            /*!< [7..0] Power modes for incrementing the counter                           */
            uint32_t            : 24;
    } EMONCFG2_b;
  } ;

  union {
    __IOM uint32_t EMONCFG3;                    /*!< (@ 0x00000210) The counter increments when the counter is enabled
                                                                    and the mode selected here matches the power
                                                                    mode.                                                      */

    struct {
      __IOM uint32_t EMONSEL3   : 8;            /*!< [7..0] Power modes for incrementing the counter                           */
            uint32_t            : 24;
    } EMONCFG3_b;
  } ;

  union {
    __IOM uint32_t EMONCFG4;                    /*!< (@ 0x00000214) The counter increments when the counter is enabled
                                                                    and the mode selected here matches the power
                                                                    mode.                                                      */

