AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t BODHREN    : 1;            /*!< [0..0] Brown out high (2.1v) reset enable.                                */
      __IOM uint32_t WDREN      : 1;            /*!< [1..1] Watchdog Timer Reset Enable. NOTE: The WDT module must
                                                     also be configured for WDT reset. This includes enabling
                                                     the RESEN bit in WDTCFG register in Watch dog timer block.                */
            uint32_t            : 30;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t SWPOI;                       /*!< (@ 0x00000004) This is the software POI reset. writing the key
                                                                    value to this register will trigger a POI
                                                                    to the system. This will cause a reset to
                                                                    all blocks except for registers in clock
                                                                    gen, RTC and the stimer.                                   */

    struct {
      __IOM uint32_t SWPOIKEY   : 8;            /*!< [7..0] 0x1B generates a software POI reset. This is a write-only
                                                     register. Reading from this register will yield only all
                                                     0s.                                                                       */
            uint32_t            : 24;
    } SWPOI_b;
  } ;

  union {
    __IOM uint32_t SWPOR;                       /*!< (@ 0x00000008) This is the software POR reset. Writing the key
                                                                    value to this register will trigger a POR
                                                                    to the system. This will cause a reset to
                                                                    all blocks except for registers in clock
                                                                    gen, RTC, power management unit, the stimer,
                                                                    and the power management unit.                             */

    struct {
      __IOM uint32_t SWPORKEY   : 8;            /*!< [7..0] 0xD4 generates a software POR reset.                               */
            uint32_t            : 24;
    } SWPOR_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t SIMOBODM;                    /*!< (@ 0x00000014) This register unmasks the individual digital
                                                                    detection brownout bits into the interrupt
                                                                    block                                                      */

    struct {
      __IOM uint32_t DIGBOEC    : 1;            /*!< [0..0] Enable the gate into the interrupt block for the digital
                                                     brownout detection on VDDC. Note: The interrupt block must
                                                     also be unmasked for ISR and interrupt status to be set                   */
      __IOM uint32_t DIGBOEF    : 1;            /*!< [1..1] Enable the gate into the interrupt block for the digital
                                                     brownout detection on VDDF. Note: The interrupt block must
                                                     also be unmasked for ISR and interrupt status to be set                   */
      __IOM uint32_t DIGBOES    : 1;            /*!< [2..2] Enable the gate into the interrupt block for the digital
                                                     brownout detection on VDDS. Note: The interrupt block must
                                                     also be unmasked for ISR and interrupt status to be set                   */
      __IOM uint32_t DIGBOECLV  : 1;            /*!< [3..3] Enable the gate into the interrupt block for the digital
                                                     brownout detection on VDDC_LV. Note: The interrupt block
                                                     must also be unmasked for ISR and interrupt status to be
                                                     set                                                                       */
            uint32_t            : 28;
    } SIMOBODM_b;
  } ;

  union {
    __IOM uint32_t SWRESET;                     /*!< (@ 0x00000018) Software reset register                                    */

    struct {
      __IOM uint32_t SWRSTDBG   : 1;            /*!< [0..0] Software reset for DEBUG                                           */
      __IOM uint32_t SWRSTIWIC  : 1;            /*!< [1..1] Software reset for IWIC                                            */
      __IOM uint32_t SWRSTEWIC  : 1;            /*!< [2..2] Reserved field.                                                    */
      __IOM uint32_t SWRSTTPIU  : 1;            /*!< [3..3] Software reset for TPIU                                            */
      __IOM uint32_t SWRSTSYSTICK : 1;          /*!< [4..4] Software reset for SysTick                                         */
            uint32_t            : 27;
    } SWRESET_b;
  } ;
  __IM  uint32_t  RESERVED1[121];

  union {
    __IOM uint32_t INTEN;                       /*!< (@ 0x00000200) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< [0..0] Enables an interrupt that triggers when VCC is below
                                                     BODH level.                                                               */
      __IOM uint32_t BODDIGC    : 1;            /*!< [1..1] Enables an interrupt that triggers when simobuck digital
                                                     detects inactivity on VDDC                                                */
      __IOM uint32_t BODDIGF    : 1;            /*!< [2..2] Enables an interrupt that triggers when simobuck digital
                                                     detects inactivity on VDDF                                                */
      __IOM uint32_t BODDIGS    : 1;            /*!< [3..3] Enables an interrupt that triggers when simobuck digital
                                                     detects inactivity on VDDS                                                */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< [4..4] Enables an interrupt that triggers when simobuck digital
                                                     detects inactivity on VDDC_LV                                             */
            uint32_t            : 27;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< (@ 0x00000204) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

