AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t CMDARG1    : 32;           /*!< [31..0] The SD Command Argument is specified as bit39-8 of Command-Format. */
    } ARGUMENT1_b;
  } ;

  union {
    __IOM uint32_t TRANSFER;                    /*!< (@ 0x0000000C) Transfer mode                                              */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< [0..0] DMA can be enabled only if DMA Support bit in the Capabilities
                                                     register is set. If this bit is set to 1, a DMA operation
                                                     shall begin when the HD writes to the upper byte of Command
                                                     register (00Fh).                                                          */
      __IOM uint32_t BLKCNTEN   : 1;            /*!< [1..1] This bit is used to enable the Block count register,
                                                     which is only relevant for multiple block transfers. When
                                                     this bit is 0, the Block Count register is disabled, which
                                                     is useful in executing an infinite transfer.                              */
      __IOM uint32_t ACMDEN     : 2;            /*!< [3..2] This field determines use of auto command functions.
                                                     There are two methods to stop Multiple-block read and write
                                                     operation. (1) Auto CMD12 Enable Multiple-block read and
                                                     write commands for memory require CMD12 to stop the operation.
                                                     When this field is set to 01b, the Host Controller issues
                                                     CMD12 automatically when last block transfer is completed.
                                                     Auto CMD12 error is indicated to the Auto CMD Error Status
                                                     register. The Host Driver shall not set this bit if the
                                                     command does not require CMD12. (2) Auto CMD23                            */
      __IOM uint32_t DXFERDIRSEL : 1;           /*!< [4..4] Data Transfer Direction Select. This bit defines the
                                                     direction of data transfers.                                              */
      __IOM uint32_t BLKSEL     : 1;            /*!< [5..5] This bit enables multiple block data transfers.                    */
            uint32_t            : 10;
      __IOM uint32_t RESPTYPESEL : 2;           /*!< [17..16] Response Type Select                                             */
            uint32_t            : 1;
      __IOM uint32_t CMDCRCCHKEN : 1;           /*!< [19..19] If this bit is set to 1, the HC shall check the CRC
                                                     field in the response. If an error is detected, it is reported
                                                     as a Command CRC Error. If this bit is set to 0, the CRC
                                                     field is not checked.                                                     */
      __IOM uint32_t CMDIDXCHKEN : 1;           /*!< [20..20] If this bit is set to 1, the HC shall check the index
                                                     field in the response to see if it has the same value as
                                                     the command index. If it is not, it is reported as a Command
                                                     Index Error. If this bit is set to 0, the Index field is
                                                     not checked.                                                              */
      __IOM uint32_t DATAPRSNTSEL : 1;          /*!< [21..21] This bit is set to 1 to indicate that data is present
                                                     and shall be transferred using the DAT line. If is set
                                                     to 0 for the following: 1. Commands using only CMD line
                                                     (ex. CMD52) 2. Commands with no data transfer but using
                                                     busy signal on DAT[0] line (R1b or R5b ex. CMD38) 3. Resume
                                                     Command                                                                   */
      __IOM uint32_t CMDTYPE    : 2;            /*!< [23..22] There are three types of special commands. Suspend,
                                                     Resume and Abort. These bits shall bet set to 00b for all
                                                     other commands. Suspend Command If the Suspend command
                                                     succeeds, the HC shall assume the SD Bus has been released
                                                     and that it is possible to issue the next command which
                                                     uses the DAT line. The HC shall de-assert Read Wait for
                                                     read transactions and stop checking busy for write transactions.
                                                     The Interrupt cycle shall start, in 4-bit mode. If the
                                                     Suspend command fails, the HC shall maintain its curren                   */
      __IOM uint32_t CMDIDX     : 6;            /*!< [29..24] This bit shall be set to the command number (CMD0-63,
                                                     ACMD063).                                                                 */
            uint32_t            : 2;
    } TRANSFER_b;
  } ;

  union {
    __IOM uint32_t RESPONSE0;                   /*!< (@ 0x00000010) Response0                                                  */

