AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t SELECT     : 8;            /*!< [7..0] LOCK Function Select register.                                     */
            uint32_t            : 24;
    } LOCKCTRL_b;
  } ;

  union {
    __IOM uint32_t LOCKSTAT;                    /*!< (@ 0x0000007C) LOCK Status                                                */

    struct {
      __IOM uint32_t STATUS     : 32;           /*!< [31..0] Lock status. Bit is high to signify it is enabled. 0:
                                                     LOCK01, 1: LOCK02, 4: LOCK11, 5: LOCK12, 30: LOCK9D, 31:
                                                     LOCK9E                                                                    */
    } LOCKSTAT_b;
  } ;

  union {
    __IOM uint32_t KEY0;                        /*!< (@ 0x00000080) Key0                                                       */

    struct {
      __IOM uint32_t KEY0       : 32;           /*!< [31..0] Bits [31:0] of the 128-bit key should be written to
                                                     this register. To protect key values, the register always
                                                     returns 0x00000000.                                                       */
    } KEY0_b;
  } ;

  union {
    __IOM uint32_t KEY1;                        /*!< (@ 0x00000084) Key1                                                       */

    struct {
      __IOM uint32_t KEY1       : 32;           /*!< [31..0] Bits [63:32] of the 128-bit key should be written to
                                                     this register. To protect key values, the register always
                                                     returns 0x00000000.                                                       */
    } KEY1_b;
  } ;

  union {
    __IOM uint32_t KEY2;                        /*!< (@ 0x00000088) Key2                                                       */

    struct {
      __IOM uint32_t KEY2       : 32;           /*!< [31..0] Bits [95:64] of the 128-bit key should be written to
                                                     this register. To protect key values, the register always
                                                     returns 0x00000000.                                                       */
    } KEY2_b;
  } ;

  union {
    __IOM uint32_t KEY3;                        /*!< (@ 0x0000008C) Key3                                                       */

    struct {
      __IOM uint32_t KEY3       : 32;           /*!< [31..0] Bits [127:96] of the 128-bit key should be written to
                                                     this register. To protect key values, the register always
                                                     returns 0x00000000.                                                       */
    } KEY3_b;
  } ;
} SECURITY_Type;                                /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                            SSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System security control (SSC)
  */

typedef struct {                                /*!< (@ 0x40025000) SSC Structure                                              */

  union {
    __IOM uint32_t SRLOCKS;                     /*!< (@ 0x00000000) Security resource locks                                    */

    struct {
      __IOM uint32_t LOCKDCAIC  : 1;            /*!< [0..0] Write 1 to disable access to the instruction cache direct
                                                     cache access registers DCAICLR and DCAICRR. Write 0 has
                                                     no effect.                                                                */
      __IOM uint32_t LOCKPAHB   : 1;            /*!< [1..1] Write 1 to disable writes to the PAHBCR register from
                                                     software or from a debug agent connected to the processor.
                                                     Write 0 has no effect.                                                    */
      __IOM uint32_t LOCKDTGU   : 1;            /*!< [2..2] Write 1 to disable writes to registers that are associated
                                                     with the DTCM interface security gating from software or
                                                     from a debug agent connected to the processor. Write 0
                                                     has no effect.                                                            */
      __IOM uint32_t LOCKITGU   : 1;            /*!< [3..3] Write 1 to disable writes to registers that are associated
                                                     with the ITCM interface security gating from software or
                                                     from a debug agent connected to the processor. Write 0
                                                     has no effect.                                                            */
      __IOM uint32_t LOCKTCM    : 1;            /*!< [4..4] Write 1 to disable writes to registers that are associated
                                                     with the TCM region from software or from a debug agent
                                                     connected to the processor. Write 0 has no effect.                        */
      __IOM uint32_t LOCKSAU    : 1;            /*!< [5..5] Write 1 to disable writes to registers that are associated
                                                     with the SAU region from software or from a debug agent
                                                     connected to the processor. Write 0 has no effect.                        */
      __IOM uint32_t LOCKNSMPU  : 1;            /*!< [6..6] Write 1 to disable writes to registers that are associated
                                                     with the Non-secure MPU region from software or from a
                                                     debug agent connected to the processor. Write 0 has no
                                                     effect.                                                                   */
      __IOM uint32_t LOCKSMPU   : 1;            /*!< [7..7] Write 1 to disable writes to registers that are associated
                                                     with the Secure Memory Protection Unit (MPU) region from
                                                     software or from a debug agent connected to the processor.
                                                     Write 0 has no effect.                                                    */
      __IOM uint32_t LOCKNSVTOR : 1;            /*!< [8..8] Write 1 to disable writes to the VTOR_NS register. Write
                                                     0 has no effect.                                                          */
      __IOM uint32_t LOCKSVTAIRCR : 1;          /*!< [9..9] Write 1 to disable writes to the following secure registers
                                                     from software or from a debug agent that is connected to
                                                     the processor: VTOR_S/AIRCR.PRIS/AIRCR.BFHFNMINS. Write
                                                     0 has no effect.                                                          */
      __IOM uint32_t LOCKSSRAMPROT : 1;         /*!< [10..10] Write 1 to disables writes to the SSRAMxPROT register
                                                     from software, any master, or from any debug agent. Once
                                                     set, it remains locked until the next system reset. Write
                                                     0 has no effect.                                                          */
            uint32_t            : 21;
    } SRLOCKS_b;
  } ;

  union {
    __IOM uint32_t SSLOCKS;                     /*!< (@ 0x00000004) System Security locks                                      */

