AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG0    : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO0.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG1    : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO1.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG2    : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO2. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG3    : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO3. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG0_b;
  } ;

  union {
    __IOM uint32_t OUTCFG1;                     /*!< (@ 0x00000084) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG4    : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO4.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG5    : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO5.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG6    : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO6. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG7    : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO7. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG1_b;
  } ;

  union {
    __IOM uint32_t OUTCFG2;                     /*!< (@ 0x00000088) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG8    : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO8.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG9    : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO9.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG10   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO10. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG11   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO11. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG2_b;
  } ;

  union {
    __IOM uint32_t OUTCFG3;                     /*!< (@ 0x0000008C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG12   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO12.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG13   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO13.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG14   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO14. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG15   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO15. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG3_b;
  } ;

  union {
    __IOM uint32_t OUTCFG4;                     /*!< (@ 0x00000090) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

