AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG32   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO32.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG33   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO33.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG34   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO34. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG35   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO35. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG8_b;
  } ;

  union {
    __IOM uint32_t OUTCFG9;                     /*!< (@ 0x000000A4) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG36   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO36.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG37   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO37.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG38   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO38. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG39   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO39. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG9_b;
  } ;

  union {
    __IOM uint32_t OUTCFG10;                    /*!< (@ 0x000000A8) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG40   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO40.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG41   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO41.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG42   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO42. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG43   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO43. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG10_b;
  } ;

  union {
    __IOM uint32_t OUTCFG11;                    /*!< (@ 0x000000AC) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG44   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO44.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG45   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO45.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG46   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO46. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG47   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO47. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG11_b;
  } ;

  union {
    __IOM uint32_t OUTCFG12;                    /*!< (@ 0x000000B0) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

