AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG48   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO48.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG49   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO49.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG50   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO50. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG51   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO51. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG12_b;
  } ;

  union {
    __IOM uint32_t OUTCFG13;                    /*!< (@ 0x000000B4) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG52   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO52.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG53   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO53.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG54   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO54. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG55   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO55. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG13_b;
  } ;

  union {
    __IOM uint32_t OUTCFG14;                    /*!< (@ 0x000000B8) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG56   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO56.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG57   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO57.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG58   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO58. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG59   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO59. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG14_b;
  } ;

  union {
    __IOM uint32_t OUTCFG15;                    /*!< (@ 0x000000BC) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG60   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO60.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG61   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO61.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG62   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO62. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG63   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO63. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG15_b;
  } ;

  union {
    __IOM uint32_t OUTCFG16;                    /*!< (@ 0x000000C0) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

