AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG96   : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO96.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG97   : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO97.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG98   : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO98. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG99   : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO99. Select an output of any timer to be output on this
                                                     GPIO.                                                                     */
            uint32_t            : 2;
    } OUTCFG24_b;
  } ;

  union {
    __IOM uint32_t OUTCFG25;                    /*!< (@ 0x000000E4) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG100  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO100.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG101  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO101.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG102  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO102. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG103  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO103. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG25_b;
  } ;

  union {
    __IOM uint32_t OUTCFG26;                    /*!< (@ 0x000000E8) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG104  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO104.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG105  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO105.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG106  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO106. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG107  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO107. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG26_b;
  } ;

  union {
    __IOM uint32_t OUTCFG27;                    /*!< (@ 0x000000EC) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG108  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO108.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG109  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO109.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG110  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO110. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG111  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO111. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG27_b;
  } ;

  union {
    __IOM uint32_t OUTCFG28;                    /*!< (@ 0x000000F0) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

