AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO112.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO113.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO114. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO115. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< (@ 0x000000F4) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO116.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO117.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO118. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO119. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;

  union {
    __IOM uint32_t OUTCFG30;                    /*!< (@ 0x000000F8) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG120  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO120.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG121  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO121.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG122  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO122. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG123  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO123. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG30_b;
  } ;

  union {
    __IOM uint32_t OUTCFG31;                    /*!< (@ 0x000000FC) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG124  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO124.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG125  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO125.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG126  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO126. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG127  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO127. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG31_b;
  } ;

  union {
    __IOM uint32_t OUTCFG32;                    /*!< (@ 0x00000100) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

