AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG128  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO128.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG129  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO129.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG130  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO130. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG131  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO131. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG32_b;
  } ;

  union {
    __IOM uint32_t OUTCFG33;                    /*!< (@ 0x00000104) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG132  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO132.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG133  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO133.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG134  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO134. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG135  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO135. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG33_b;
  } ;

  union {
    __IOM uint32_t OUTCFG34;                    /*!< (@ 0x00000108) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG136  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO136.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG137  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO137.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG138  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO138. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG139  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO139. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG34_b;
  } ;

  union {
    __IOM uint32_t OUTCFG35;                    /*!< (@ 0x0000010C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG140  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO140.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG141  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO141.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG142  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO142. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG143  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO143. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG35_b;
  } ;

  union {
    __IOM uint32_t OUTCFG36;                    /*!< (@ 0x00000110) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

