AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG144  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO144.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG145  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO145.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG146  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO146. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG147  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO147. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG36_b;
  } ;

  union {
    __IOM uint32_t OUTCFG37;                    /*!< (@ 0x00000114) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG148  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO148.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG149  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO149.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG150  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO150. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG151  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO151. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG37_b;
  } ;

  union {
    __IOM uint32_t OUTCFG38;                    /*!< (@ 0x00000118) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG152  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO152.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG153  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO153.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG154  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO154. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG155  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO155. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG38_b;
  } ;

  union {
    __IOM uint32_t OUTCFG39;                    /*!< (@ 0x0000011C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG156  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO156.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG157  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO157.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG158  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO158. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG159  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO159. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG39_b;
  } ;

  union {
    __IOM uint32_t OUTCFG40;                    /*!< (@ 0x00000120) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

