AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG160  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO160.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG161  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO161.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG162  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO162. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG163  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO163. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG40_b;
  } ;

  union {
    __IOM uint32_t OUTCFG41;                    /*!< (@ 0x00000124) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG164  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO164.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG165  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO165.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG166  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO166. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG167  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO167. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG41_b;
  } ;

  union {
    __IOM uint32_t OUTCFG42;                    /*!< (@ 0x00000128) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG168  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO168.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG169  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO169.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG170  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO170. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG171  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO171. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG42_b;
  } ;

  union {
    __IOM uint32_t OUTCFG43;                    /*!< (@ 0x0000012C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG172  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO172.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG173  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO173.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG174  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO174. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG175  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO175. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG43_b;
  } ;

  union {
    __IOM uint32_t OUTCFG44;                    /*!< (@ 0x00000130) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

