AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG176  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO176.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG177  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO177.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG178  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO178. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG179  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO179. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG44_b;
  } ;

  union {
    __IOM uint32_t OUTCFG45;                    /*!< (@ 0x00000134) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG180  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO180.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG181  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO181.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG182  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO182. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG183  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO183. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG45_b;
  } ;

  union {
    __IOM uint32_t OUTCFG46;                    /*!< (@ 0x00000138) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG184  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO184.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG185  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO185.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG186  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO186. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG187  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO187. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG46_b;
  } ;

  union {
    __IOM uint32_t OUTCFG47;                    /*!< (@ 0x0000013C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG188  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO188.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG189  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO189.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG190  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO190. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG191  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO191. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG47_b;
  } ;

  union {
    __IOM uint32_t OUTCFG48;                    /*!< (@ 0x00000140) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

