AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG192  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO192.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG193  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO193.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG194  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO194. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG195  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO195. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG48_b;
  } ;

  union {
    __IOM uint32_t OUTCFG49;                    /*!< (@ 0x00000144) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG196  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO196.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG197  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO197.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG198  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO198. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG199  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO199. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG49_b;
  } ;

  union {
    __IOM uint32_t OUTCFG50;                    /*!< (@ 0x00000148) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG200  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO200.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG201  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO201.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG202  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO202. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG203  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO203. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG50_b;
  } ;

  union {
    __IOM uint32_t OUTCFG51;                    /*!< (@ 0x0000014C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG204  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO204.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG205  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO205.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG206  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO206. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG207  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO207. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG51_b;
  } ;

  union {
    __IOM uint32_t OUTCFG52;                    /*!< (@ 0x00000150) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

