AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t OUTCFG208  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO208.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG209  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO209.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG210  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO210. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG211  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO211. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG52_b;
  } ;

  union {
    __IOM uint32_t OUTCFG53;                    /*!< (@ 0x00000154) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG212  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO212.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG213  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO213.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG214  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO214. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG215  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO215. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG53_b;
  } ;

  union {
    __IOM uint32_t OUTCFG54;                    /*!< (@ 0x00000158) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG216  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO216.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG217  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO217.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG218  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO218. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG219  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO219. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG54_b;
  } ;

  union {
    __IOM uint32_t OUTCFG55;                    /*!< (@ 0x0000015C) Counter/Timer or System Timer output selections
                                                                    for GPIO pads.                                             */

    struct {
      __IOM uint32_t OUTCFG220  : 6;            /*!< [5..0] Counter/Timer or System Timer output selection for GPIO220.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG221  : 6;            /*!< [13..8] Counter/Timer or System Timer output selection for GPIO221.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG222  : 6;            /*!< [21..16] Counter/Timer or System Timer output selection for
                                                     GPIO222. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG223  : 6;            /*!< [29..24] Counter/Timer or System Timer output selection for
                                                     GPIO223. Select an output of any timer to be output on
                                                     this GPIO.                                                                */
            uint32_t            : 2;
    } OUTCFG55_b;
  } ;
  __IM  uint32_t  RESERVED3[40];

  union {
    __IOM uint32_t CTRL0;                       /*!< (@ 0x00000200) This includes the Control bit fields for timer
                                                                    0.                                                         */

