AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t TIMER5     : 32;           /*!< [31..0] Counter/Timer 5                                                   */
    } TIMER5_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP0;                    /*!< (@ 0x000002A8) This contains the Compare limits for timer 5.
                                                                    This is the primary comparator that can
                                                                    be used to mark the END of a timer cycle
                                                                    (and thus restart the timer for repeat modes)              */

    struct {
      __IOM uint32_t TMR5CMP0   : 32;           /*!< [31..0] Counter/Timer 5 End Compare Register. For MEASURE mode
                                                     indicates the high phase sample count.                                    */
    } TMR5CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR5CMP1;                    /*!< (@ 0x000002AC) This comparator is used as a secondary compare
                                                                    count for modes that generate pulses. For
                                                                    MEASURE mode indicates the low phase sample
                                                                    count.                                                     */

    struct {
      __IOM uint32_t TMR5CMP1   : 32;           /*!< [31..0] Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR5CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE5;                       /*!< (@ 0x000002B0) The mode register contains optional mode controls
                                                                    for the timer                                              */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR5TRIGSEL : 9;           /*!< [16..8] Counter/Timer 5 Trigger Source Selection                          */
            uint32_t            : 15;
    } MODE5_b;
  } ;

  union {
    __IOM uint32_t TMR5LMTVAL;                  /*!< (@ 0x000002B4) This is an internal counter in the hardware that
                                                                    counts down from TMR_LMT to 1                              */

    struct {
      __IOM uint32_t TMR5LMTVAL : 8;            /*!< [7..0] Counter/Timer 5 Limit Readback                                     */
            uint32_t            : 24;
    } TMR5LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED9[2];

  union {
    __IOM uint32_t CTRL6;                       /*!< (@ 0x000002C0) This includes the Control bit fields for timer
                                                                    6.                                                         */

    struct {
      __IOM uint32_t TMR6EN     : 1;            /*!< [0..0] Counter/Timer 6 Enable bit.                                        */
      __IOM uint32_t TMR6CLR    : 1;            /*!< [1..1] Counter/Timer Clear bit.                                           */
      __IOM uint32_t TMR6POL0   : 1;            /*!< [2..2] Counter/Timer 6 output 0 polarity.                                 */
      __IOM uint32_t TMR6POL1   : 1;            /*!< [3..3] Counter/Timer 6 output 1 polarity.                                 */
      __IOM uint32_t TMR6FN     : 4;            /*!< [7..4] Counter/Timer 6 Function Select. For all Functions, CMP0
                                                     marks the end of timer cycle, and thus restarts the timer.                */
      __IOM uint32_t TMR6CLK    : 9;            /*!< [16..8] Counter/Timer 6 Clock Select. Note: Any GPIO can be
                                                     used as a clock source.                                                   */
      __IOM uint32_t TMR6TMODE  : 2;            /*!< [18..17] Counter/Timer 6 Trigger Mode                                     */
            uint32_t            : 5;
      __IOM uint32_t TMR6LMT    : 8;            /*!< [31..24] This field decides the number of iterations of Counter/Timer
                                                     6. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL6_b;
  } ;

  union {
    __IOM uint32_t TIMER6;                      /*!< (@ 0x000002C4) This register holds the running time or event
                                                                    count for timer 6.                                         */

    struct {
      __IOM uint32_t TIMER6     : 32;           /*!< [31..0] Counter/Timer 6                                                   */
    } TIMER6_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP0;                    /*!< (@ 0x000002C8) This contains the Compare limits for timer 6.
                                                                    This is the primary comparator that can
                                                                    be used to mark the END of a timer cycle
                                                                    (and thus restart the timer for repeat modes)              */

    struct {
      __IOM uint32_t TMR6CMP0   : 32;           /*!< [31..0] Counter/Timer 6 End Compare Register. For MEASURE mode
                                                     indicates the high phase sample count.                                    */
    } TMR6CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP1;                    /*!< (@ 0x000002CC) This comparator is used as a secondary compare
                                                                    count for modes that generate pulses. For
                                                                    MEASURE mode indicates the low phase sample
                                                                    count.                                                     */

