AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Dflop output select signal delay compared with digital
                                                     clock enable signal 1'b0:3 clocks 1'b1:2 clocks                           */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] PLL bandwidth option 1'b0 default 1'b1 increases the
                                                     PLL bandwidth                                                             */
      __IOM uint32_t BF42       : 3;            /*!< [4..2] Tx HS pre-emphasis strength 3'b111 represents the strongest
                                                     , 3'b000 the weakest                                                      */
      __IOM uint32_t BF55       : 1;            /*!< [5..5] PLL feedback divider ratio option.                                 */
      __IOM uint32_t BF66       : 1;            /*!< [6..6] FIXME (description needed).                                        */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG14_b;
  } ;

  union {
    __IOM uint32_t REG18;                       /*!< (@ 0x00000018) Register description here                                  */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< [1..0] HS receiver bias current tuning. 2'b00 represents the
                                                     minimum bias current 2'b11 represents the maximum bias
                                                     current                                                                   */
      __IOM uint32_t BF22       : 1;            /*!< [2..2] Clk60m, clk12m and clk48m enable. 1'b0:disables the clocks
                                                     1'b1:enables the clocks                                                   */
      __IOM uint32_t BF73       : 5;            /*!< [7..3] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG18_b;
  } ;

  union {
    __IOM uint32_t REG1C;                       /*!< (@ 0x0000001C) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] Set IO high-Z state. Active high                                   */
      __IOM uint32_t BF11       : 1;            /*!< [1..1] Tx power down in suspend state. Active low.                        */
      __IOM uint32_t BF22       : 1;            /*!< [2..2] PLL enable bypass from suspend module. 1'b1: bypass enable
                                                     1'b0:bypass disable                                                       */
      __IOM uint32_t BF33       : 1;            /*!< [3..3] PLL enable value from suspend module. 1'b1:pll enable              */
      __IOM uint32_t BF44       : 1;            /*!< [4..4] 480M clock out enable. 1'b0:pll disable 1'b1: 480M clock
                                                     out enable 1'b0: 480M clock out disable                                   */
      __IOM uint32_t BF55       : 1;            /*!< [5..5] BG power down control bit, active high 1: power down
                                                     band-gap 0: normal operation mode                                         */
      __IOM uint32_t BF66       : 1;            /*!< [6..6] This bitfield is reserved.                                         */
      __IOM uint32_t BF77       : 1;            /*!< [7..7] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG1C_b;
  } ;

  union {
    __IOM uint32_t REG20;                       /*!< (@ 0x00000020) Register description here                                  */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< [2..0] Rx enable delay select. 3'b000: 4 clocks (480Mhz clock)
                                                     3'b001: 5 clocks 3'b010: 6 clocks 3'b011: 7 clocks 3'b100:
                                                     8 clocks 3'b101: 9 clocks 3'b110: 10 clocks 3'b111: 12
                                                     clocks                                                                    */
      __IOM uint32_t BF33       : 1;            /*!< [3..3] This bitfield is reserved.                                         */
      __IOM uint32_t BF54       : 2;            /*!< [5..4] Analog observation port select. for detailed information,
                                                     please refer to section 10.3 , Table 30 : Debug and OBS
                                                     port                                                                      */
      __IOM uint32_t BF76       : 2;            /*!< [7..6] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG20_b;
  } ;

  union {
    __IOM uint32_t REG24;                       /*!< (@ 0x00000024) Register description here                                  */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< [0..0] it0                                                                */
      __IOM uint32_t BF71       : 7;            /*!< [7..1] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG24_b;
  } ;

  union {
    __IOM uint32_t REG28;                       /*!< (@ 0x00000028) Register description here                                  */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG28_b;
  } ;

  union {
    __IOM uint32_t REG2C;                       /*!< (@ 0x0000002C) Register description here                                  */

