AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 4.                                                      */
    } FIFO4_b;
  } ;

  union {
    __IOM uint32_t FIFO5;                       /*!< (@ 0x00000034) Endpoint 5 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 5.                                                      */
    } FIFO5_b;
  } ;
  __IM  uint32_t  RESERVED[13];

  union {
    __IOM uint32_t HWVERS;                      /*!< (@ 0x0000006C) Read-only register that returns version number
                                                                    (xx.yyy) of the core hardware.                             */

    struct {
      __IOM uint32_t yyy        : 10;           /*!< [9..0] Minor Version Number (Range 0 - 999).                              */
      __IOM uint32_t xx         : 5;            /*!< [14..10] Major Version Number (Range 0 - 31).                             */
      __IOM uint32_t RC         : 1;            /*!< [15..15] Unused                                                           */
            uint32_t            : 16;
    } HWVERS_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t INFO;                        /*!< (@ 0x00000078) Contains read-only info of the number of IN and
                                                                    OUT endpoints included in the design, width
                                                                    of the RAM, the ability to reset the USB
                                                                    Controller via software, a soft reset bit
                                                                    for the CLK clock domain and a soft reset
                                                                    bit for the XCLK clock domain.                             */

    struct {
      __IOM uint32_t InEndPoints : 4;           /*!< [3..0] Provides the number of implemented IN Endpoints.                   */
      __IOM uint32_t OutEndPoints : 4;          /*!< [7..4] Provides the number of implemented OUT Endpoints.                  */
      __IOM uint32_t RamBits    : 4;            /*!< [11..8] Provides the width of the RAM address bus.                        */
      __IOM uint32_t DMAChains  : 4;            /*!< [15..12] Provides the number of implemented DMA channels.                 */
      __IOM uint32_t RSTS       : 1;            /*!< [16..16] Soft reset for the CLK domain. cause the output signal
                                                     NRSTO to be asserted low. This bit is self-clearing. For
                                                     reset to actually occur, the output NRSTO must be connected
                                                     to the input NRST.                                                        */
      __IOM uint32_t RSTXS      : 1;            /*!< [17..17] Soft reset for the XCLK domain. will cause the output
                                                     signal NRSTXO to be asserted low. This bit is self-clearing.
                                                     For reset to actually occur, the output NRSTXO must be
                                                     connected to the input NRSTX.                                             */
            uint32_t            : 6;
      __IOM uint32_t EDMAOUT    : 1;            /*!< [24..24] DMA_REQ deassert for all OUT Endpoints.                          */
      __IOM uint32_t EDMAIN     : 1;            /*!< [25..25] DMA_REQ deassert for all IN endpoints.                           */
            uint32_t            : 6;
    } INFO_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t TIMEOUT1;                    /*!< (@ 0x00000080) Holds the configurable chirp timeout value.                */

    struct {
      __IOM uint32_t CTUCH      : 16;           /*!< [15..0] Configurable Chirp Timeout timer; default value of 0x4074
                                                     corresponds to a delay of 1.1ms (60Mhz clock cycles * 4
                                                     * 0x4074).                                                                */
            uint32_t            : 16;
    } TIMEOUT1_b;
  } ;

  union {
    __IOM uint32_t TIMEOUT2;                    /*!< (@ 0x00000084) Holds the configurable delay from the end of
                                                                    High Speed resume signal to enable UTM normal
                                                                    operating mode.                                            */

    struct {
      __IOM uint32_t CTHRSTN    : 16;           /*!< [15..0] Configurable delay from the end of High Speed resume
                                                     signaling to enabling UTM normal operating mode. Default
                                                     value of 0x32 corresponds to a delay of 3us. This programmed
                                                     delay is equivalent to the number of 60MHz clock cycles
                                                     * 4.                                                                      */
            uint32_t            : 16;
    } TIMEOUT2_b;
  } ;
  __IM  uint32_t  RESERVED3[2014];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< (@ 0x00002000) Provides optional control for turning off the
                                                                    interface clocks to USB Controller and PHY
                                                                    as well as the reference clock to the USB
                                                                    PHY.                                                       */

