AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t CHARGEDETBYP : 1;          /*!< [0..0] BC detection bypass                                                */
      __IOM uint32_t FORCEDPATTACHED : 1;       /*!< [1..1] Force output dp_attached                                           */
      __IOM uint32_t FORCECPDET : 1;            /*!< [2..2] Force output charging port detected                                */
      __IOM uint32_t FORCEDCPDET : 1;           /*!< [3..3] Force output dedicated charging port detected                      */
            uint32_t            : 4;
      __IOM uint32_t BCWEAKPULLUPTUNE : 2;      /*!< [9..8] Weak source resistor to both DP and DM tuning. Trimmable.          */
      __IOM uint32_t BCWEAKPULLDOWNTUNE : 2;    /*!< [11..10] Weak sink resistor to both DP and DM tuning. Trimmable.          */
            uint32_t            : 20;
    } BCDETCRTL2_b;
  } ;

  union {
    __IOM uint32_t DMACTRL;                     /*!< (@ 0x0000202C) DMA Control                                                */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< [0..0] enable USB DMA                                                     */
      __IOM uint32_t DMAEP      : 3;            /*!< [3..1] USB DMA endpoint selection                                         */
      __IOM uint32_t DMADIR     : 1;            /*!< [4..4] USB DMA direction                                                  */
      __IOM uint32_t DMAPRI     : 1;            /*!< [5..5] USB DMA priority                                                   */
            uint32_t            : 10;
      __IOM uint32_t TOTCOUNT   : 12;           /*!< [27..16] total transfer count in bytes                                    */
            uint32_t            : 4;
    } DMACTRL_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< (@ 0x00002030) USB DMA Target Address                                     */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< [31..0] Target byte address for source of DMA (either read or
                                                     write). In cases of non-word aligned addresses, the DMA
                                                     logic will take care for ensuring only the target bytes
                                                     are read/written.                                                         */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMAINTEN;                    /*!< (@ 0x00002034) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< [0..0] DMA Complete Interrupt                                             */
      __IOM uint32_t DMAERR     : 1;            /*!< [1..1] DMA Error Interrupt                                                */
            uint32_t            : 30;
    } DMAINTEN_b;
  } ;

  union {
    __IOM uint32_t DMAINTSTAT;                  /*!< (@ 0x00002038) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< [0..0] DMA Complete Interrupt                                             */
      __IOM uint32_t DMAERR     : 1;            /*!< [1..1] DMA Error Interrupt                                                */
            uint32_t            : 30;
    } DMAINTSTAT_b;
  } ;

  union {
    __IOM uint32_t DMAINTCLR;                   /*!< (@ 0x0000203C) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< [0..0] DMA Complete Interrupt                                             */
      __IOM uint32_t DMAERR     : 1;            /*!< [1..1] DMA Error Interrupt                                                */
            uint32_t            : 30;
    } DMAINTCLR_b;
  } ;

  union {
    __IOM uint32_t DMAINTSET;                   /*!< (@ 0x00002040) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t DMACMP     : 1;            /*!< [0..0] DMA Complete Interrupt                                             */
      __IOM uint32_t DMAERR     : 1;            /*!< [1..1] DMA Error Interrupt                                                */
            uint32_t            : 30;
    } DMAINTSET_b;
  } ;

  union {
    __IOM uint32_t ADMACTRL;                    /*!< (@ 0x00002044) Auto-DMA Control                                           */

    struct {
      __IOM uint32_t DMAMODE    : 1;            /*!< [0..0] 0 - Legacy DMA mode, 1 - Auto-DMA mode                             */
            uint32_t            : 31;
    } ADMACTRL_b;
  } ;

  union {
    __IOM uint32_t ADMAEN;                      /*!< (@ 0x00002048) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMAEN     : 10;           /*!< [9..0] Set ADMAEN[i] to 1 to enable auto-DMA for USB DMA request
                                                     line [i].                                                                 */
            uint32_t            : 22;
    } ADMAEN_b;
  } ;

  union {
    __IOM uint32_t ADMADIR;                     /*!< (@ 0x0000204C) Auto DMA Direction Select Register                         */

    struct {
      __IOM uint32_t ADMADIR    : 10;           /*!< [9..0] Set ADMADIR[i] to 0 for OUT, and 1 for IN direction for
                                                     auto-DMA for USB DMA request line [i].                                    */
            uint32_t            : 22;
    } ADMADIR_b;
  } ;

  union {
    __IOM uint32_t ADMAPRI;                     /*!< (@ 0x00002050) Auto DMA Priority Select Register                          */

