AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ADMAPRI    : 10;           /*!< [9..0] Set ADMAPRI[i] to 1 to set the priority for auto-DMA
                                                     for USB DMA request line [i].                                             */
            uint32_t            : 22;
    } ADMAPRI_b;
  } ;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IOM uint32_t ADMACMPINTEN;                /*!< (@ 0x00002060) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t ADMACMP0   : 1;            /*!< [0..0] ADMA Complete for USB DMA request line 0 Interrupt                 */
      __IOM uint32_t ADMACMP1   : 1;            /*!< [1..1] ADMA Complete for USB DMA request line 1 Interrupt                 */
      __IOM uint32_t ADMACMP2   : 1;            /*!< [2..2] ADMA Complete for USB DMA request line 2 Interrupt                 */
      __IOM uint32_t ADMACMP3   : 1;            /*!< [3..3] ADMA Complete for USB DMA request line 3 Interrupt                 */
      __IOM uint32_t ADMACMP4   : 1;            /*!< [4..4] ADMA Complete for USB DMA request line 4 Interrupt                 */
      __IOM uint32_t ADMACMP5   : 1;            /*!< [5..5] ADMA Complete for USB DMA request line 5 Interrupt                 */
      __IOM uint32_t ADMACMP6   : 1;            /*!< [6..6] ADMA Complete for USB DMA request line 6 Interrupt                 */
      __IOM uint32_t ADMACMP7   : 1;            /*!< [7..7] ADMA Complete for USB DMA request line 7 Interrupt                 */
      __IOM uint32_t ADMACMP8   : 1;            /*!< [8..8] ADMA Complete for USB DMA request line 8 Interrupt                 */
      __IOM uint32_t ADMACMP9   : 1;            /*!< [9..9] ADMA Complete for USB DMA request line 9 Interrupt                 */
            uint32_t            : 22;
    } ADMACMPINTEN_b;
  } ;

  union {
    __IOM uint32_t ADMACMPINTSTAT;              /*!< (@ 0x00002064) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t ADMACMP0   : 1;            /*!< [0..0] ADMA Complete for USB DMA request line 0 Interrupt                 */
      __IOM uint32_t ADMACMP1   : 1;            /*!< [1..1] ADMA Complete for USB DMA request line 1 Interrupt                 */
      __IOM uint32_t ADMACMP2   : 1;            /*!< [2..2] ADMA Complete for USB DMA request line 2 Interrupt                 */
      __IOM uint32_t ADMACMP3   : 1;            /*!< [3..3] ADMA Complete for USB DMA request line 3 Interrupt                 */
      __IOM uint32_t ADMACMP4   : 1;            /*!< [4..4] ADMA Complete for USB DMA request line 4 Interrupt                 */
      __IOM uint32_t ADMACMP5   : 1;            /*!< [5..5] ADMA Complete for USB DMA request line 5 Interrupt                 */
      __IOM uint32_t ADMACMP6   : 1;            /*!< [6..6] ADMA Complete for USB DMA request line 6 Interrupt                 */
      __IOM uint32_t ADMACMP7   : 1;            /*!< [7..7] ADMA Complete for USB DMA request line 7 Interrupt                 */
      __IOM uint32_t ADMACMP8   : 1;            /*!< [8..8] ADMA Complete for USB DMA request line 8 Interrupt                 */
      __IOM uint32_t ADMACMP9   : 1;            /*!< [9..9] ADMA Complete for USB DMA request line 9 Interrupt                 */
            uint32_t            : 22;
    } ADMACMPINTSTAT_b;
  } ;

  union {
    __IOM uint32_t ADMACMPINTCLR;               /*!< (@ 0x00002068) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t ADMACMP0   : 1;            /*!< [0..0] ADMA Complete for USB DMA request line 0 Interrupt                 */
      __IOM uint32_t ADMACMP1   : 1;            /*!< [1..1] ADMA Complete for USB DMA request line 1 Interrupt                 */
      __IOM uint32_t ADMACMP2   : 1;            /*!< [2..2] ADMA Complete for USB DMA request line 2 Interrupt                 */
      __IOM uint32_t ADMACMP3   : 1;            /*!< [3..3] ADMA Complete for USB DMA request line 3 Interrupt                 */
      __IOM uint32_t ADMACMP4   : 1;            /*!< [4..4] ADMA Complete for USB DMA request line 4 Interrupt                 */
      __IOM uint32_t ADMACMP5   : 1;            /*!< [5..5] ADMA Complete for USB DMA request line 5 Interrupt                 */
      __IOM uint32_t ADMACMP6   : 1;            /*!< [6..6] ADMA Complete for USB DMA request line 6 Interrupt                 */
      __IOM uint32_t ADMACMP7   : 1;            /*!< [7..7] ADMA Complete for USB DMA request line 7 Interrupt                 */
      __IOM uint32_t ADMACMP8   : 1;            /*!< [8..8] ADMA Complete for USB DMA request line 8 Interrupt                 */
      __IOM uint32_t ADMACMP9   : 1;            /*!< [9..9] ADMA Complete for USB DMA request line 9 Interrupt                 */
            uint32_t            : 22;
    } ADMACMPINTCLR_b;
  } ;

  union {
    __IOM uint32_t ADMACMPINTSET;               /*!< (@ 0x0000206C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t ADMACMP0   : 1;            /*!< [0..0] ADMA Complete for USB DMA request line 0 Interrupt                 */
      __IOM uint32_t ADMACMP1   : 1;            /*!< [1..1] ADMA Complete for USB DMA request line 1 Interrupt                 */
      __IOM uint32_t ADMACMP2   : 1;            /*!< [2..2] ADMA Complete for USB DMA request line 2 Interrupt                 */
      __IOM uint32_t ADMACMP3   : 1;            /*!< [3..3] ADMA Complete for USB DMA request line 3 Interrupt                 */
      __IOM uint32_t ADMACMP4   : 1;            /*!< [4..4] ADMA Complete for USB DMA request line 4 Interrupt                 */
      __IOM uint32_t ADMACMP5   : 1;            /*!< [5..5] ADMA Complete for USB DMA request line 5 Interrupt                 */
      __IOM uint32_t ADMACMP6   : 1;            /*!< [6..6] ADMA Complete for USB DMA request line 6 Interrupt                 */
      __IOM uint32_t ADMACMP7   : 1;            /*!< [7..7] ADMA Complete for USB DMA request line 7 Interrupt                 */
      __IOM uint32_t ADMACMP8   : 1;            /*!< [8..8] ADMA Complete for USB DMA request line 8 Interrupt                 */
      __IOM uint32_t ADMACMP9   : 1;            /*!< [9..9] ADMA Complete for USB DMA request line 9 Interrupt                 */
            uint32_t            : 22;
    } ADMACMPINTSET_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTEN;                /*!< (@ 0x00002070) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

