AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< [0..0] ADMA Error for USB DMA request line 0 Interrupt                    */
      __IOM uint32_t ADMAERR1   : 1;            /*!< [1..1] ADMA Error for USB DMA request line 1 Interrupt                    */
      __IOM uint32_t ADMAERR2   : 1;            /*!< [2..2] ADMA Error for USB DMA request line 2 Interrupt                    */
      __IOM uint32_t ADMAERR3   : 1;            /*!< [3..3] ADMA Error for USB DMA request line 3 Interrupt                    */
      __IOM uint32_t ADMAERR4   : 1;            /*!< [4..4] ADMA Error for USB DMA request line 4 Interrupt                    */
      __IOM uint32_t ADMAERR5   : 1;            /*!< [5..5] ADMA Error for USB DMA request line 5 Interrupt                    */
      __IOM uint32_t ADMAERR6   : 1;            /*!< [6..6] ADMA Error for USB DMA request line 6 Interrupt                    */
      __IOM uint32_t ADMAERR7   : 1;            /*!< [7..7] ADMA Error for USB DMA request line 7 Interrupt                    */
      __IOM uint32_t ADMAERR8   : 1;            /*!< [8..8] ADMA Error for USB DMA request line 8 Interrupt                    */
      __IOM uint32_t ADMAERR9   : 1;            /*!< [9..9] ADMA Error for USB DMA request line 9 Interrupt                    */
            uint32_t            : 22;
    } ADMAERRINTEN_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTSTAT;              /*!< (@ 0x00002074) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< [0..0] ADMA Error for USB DMA request line 0 Interrupt                    */
      __IOM uint32_t ADMAERR1   : 1;            /*!< [1..1] ADMA Error for USB DMA request line 1 Interrupt                    */
      __IOM uint32_t ADMAERR2   : 1;            /*!< [2..2] ADMA Error for USB DMA request line 2 Interrupt                    */
      __IOM uint32_t ADMAERR3   : 1;            /*!< [3..3] ADMA Error for USB DMA request line 3 Interrupt                    */
      __IOM uint32_t ADMAERR4   : 1;            /*!< [4..4] ADMA Error for USB DMA request line 4 Interrupt                    */
      __IOM uint32_t ADMAERR5   : 1;            /*!< [5..5] ADMA Error for USB DMA request line 5 Interrupt                    */
      __IOM uint32_t ADMAERR6   : 1;            /*!< [6..6] ADMA Error for USB DMA request line 6 Interrupt                    */
      __IOM uint32_t ADMAERR7   : 1;            /*!< [7..7] ADMA Error for USB DMA request line 7 Interrupt                    */
      __IOM uint32_t ADMAERR8   : 1;            /*!< [8..8] ADMA Error for USB DMA request line 8 Interrupt                    */
      __IOM uint32_t ADMAERR9   : 1;            /*!< [9..9] ADMA Error for USB DMA request line 9 Interrupt                    */
            uint32_t            : 22;
    } ADMAERRINTSTAT_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTCLR;               /*!< (@ 0x00002078) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< [0..0] ADMA Error for USB DMA request line 0 Interrupt                    */
      __IOM uint32_t ADMAERR1   : 1;            /*!< [1..1] ADMA Error for USB DMA request line 1 Interrupt                    */
      __IOM uint32_t ADMAERR2   : 1;            /*!< [2..2] ADMA Error for USB DMA request line 2 Interrupt                    */
      __IOM uint32_t ADMAERR3   : 1;            /*!< [3..3] ADMA Error for USB DMA request line 3 Interrupt                    */
      __IOM uint32_t ADMAERR4   : 1;            /*!< [4..4] ADMA Error for USB DMA request line 4 Interrupt                    */
      __IOM uint32_t ADMAERR5   : 1;            /*!< [5..5] ADMA Error for USB DMA request line 5 Interrupt                    */
      __IOM uint32_t ADMAERR6   : 1;            /*!< [6..6] ADMA Error for USB DMA request line 6 Interrupt                    */
      __IOM uint32_t ADMAERR7   : 1;            /*!< [7..7] ADMA Error for USB DMA request line 7 Interrupt                    */
      __IOM uint32_t ADMAERR8   : 1;            /*!< [8..8] ADMA Error for USB DMA request line 8 Interrupt                    */
      __IOM uint32_t ADMAERR9   : 1;            /*!< [9..9] ADMA Error for USB DMA request line 9 Interrupt                    */
            uint32_t            : 22;
    } ADMAERRINTCLR_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTSET;               /*!< (@ 0x0000207C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< [0..0] ADMA Error for USB DMA request line 0 Interrupt                    */
      __IOM uint32_t ADMAERR1   : 1;            /*!< [1..1] ADMA Error for USB DMA request line 1 Interrupt                    */
      __IOM uint32_t ADMAERR2   : 1;            /*!< [2..2] ADMA Error for USB DMA request line 2 Interrupt                    */
      __IOM uint32_t ADMAERR3   : 1;            /*!< [3..3] ADMA Error for USB DMA request line 3 Interrupt                    */
      __IOM uint32_t ADMAERR4   : 1;            /*!< [4..4] ADMA Error for USB DMA request line 4 Interrupt                    */
      __IOM uint32_t ADMAERR5   : 1;            /*!< [5..5] ADMA Error for USB DMA request line 5 Interrupt                    */
      __IOM uint32_t ADMAERR6   : 1;            /*!< [6..6] ADMA Error for USB DMA request line 6 Interrupt                    */
      __IOM uint32_t ADMAERR7   : 1;            /*!< [7..7] ADMA Error for USB DMA request line 7 Interrupt                    */
      __IOM uint32_t ADMAERR8   : 1;            /*!< [8..8] ADMA Error for USB DMA request line 8 Interrupt                    */
      __IOM uint32_t ADMAERR9   : 1;            /*!< [9..9] ADMA Error for USB DMA request line 9 Interrupt                    */
            uint32_t            : 22;
    } ADMAERRINTSET_b;
  } ;
  __IM  uint32_t  RESERVED6[32];

  union {
    __IOM uint32_t ADMATOTCOUNT0;               /*!< (@ 0x00002100) Auto DMA Enable Register                                   */

