AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ADMATOTCOUNT0 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 0                   */
            uint32_t            : 8;
    } ADMATOTCOUNT0_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT1;               /*!< (@ 0x00002104) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT1 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 1                   */
            uint32_t            : 8;
    } ADMATOTCOUNT1_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT2;               /*!< (@ 0x00002108) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT2 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 2                   */
            uint32_t            : 8;
    } ADMATOTCOUNT2_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT3;               /*!< (@ 0x0000210C) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT3 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 3                   */
            uint32_t            : 8;
    } ADMATOTCOUNT3_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT4;               /*!< (@ 0x00002110) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT4 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 4                   */
            uint32_t            : 8;
    } ADMATOTCOUNT4_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT5;               /*!< (@ 0x00002114) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT5 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 5                   */
            uint32_t            : 8;
    } ADMATOTCOUNT5_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT6;               /*!< (@ 0x00002118) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT6 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 6                   */
            uint32_t            : 8;
    } ADMATOTCOUNT6_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT7;               /*!< (@ 0x0000211C) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT7 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 7                   */
            uint32_t            : 8;
    } ADMATOTCOUNT7_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT8;               /*!< (@ 0x00002120) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT8 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 8                   */
            uint32_t            : 8;
    } ADMATOTCOUNT8_b;
  } ;

  union {
    __IOM uint32_t ADMATOTCOUNT9;               /*!< (@ 0x00002124) Auto DMA Enable Register                                   */

    struct {
      __IOM uint32_t ADMATOTCOUNT9 : 24;        /*!< [23..0] Auto DMA Total Count for USB DMA request line 9                   */
            uint32_t            : 8;
    } ADMATOTCOUNT9_b;
  } ;
  __IM  uint32_t  RESERVED7[54];

  union {
    __IOM uint32_t ADMATARGADDR0;               /*!< (@ 0x00002200) Auto DMA Target Address 0                                  */

    struct {
      __IOM uint32_t ADMATARGADDR0 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 0                */
    } ADMATARGADDR0_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR1;               /*!< (@ 0x00002204) Auto DMA Target Address 1                                  */

    struct {
      __IOM uint32_t ADMATARGADDR1 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 1                */
    } ADMATARGADDR1_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR2;               /*!< (@ 0x00002208) Auto DMA Target Address 2                                  */

    struct {
      __IOM uint32_t ADMATARGADDR2 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 2                */
    } ADMATARGADDR2_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR3;               /*!< (@ 0x0000220C) Auto DMA Target Address 3                                  */

    struct {
      __IOM uint32_t ADMATARGADDR3 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 3                */
    } ADMATARGADDR3_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR4;               /*!< (@ 0x00002210) Auto DMA Target Address 4                                  */

    struct {
      __IOM uint32_t ADMATARGADDR4 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 4                */
    } ADMATARGADDR4_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR5;               /*!< (@ 0x00002214) Auto DMA Target Address 5                                  */

    struct {
      __IOM uint32_t ADMATARGADDR5 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 5                */
    } ADMATARGADDR5_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR6;               /*!< (@ 0x00002218) Auto DMA Target Address 6                                  */

    struct {
      __IOM uint32_t ADMATARGADDR6 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 6                */
    } ADMATARGADDR6_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR7;               /*!< (@ 0x0000221C) Auto DMA Target Address 7                                  */

    struct {
      __IOM uint32_t ADMATARGADDR7 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 7                */
    } ADMATARGADDR7_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR8;               /*!< (@ 0x00002220) Auto DMA Target Address 8                                  */

