AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
    struct {
      __IOM uint32_t ADMATARGADDR8 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 8                */
    } ADMATARGADDR8_b;
  } ;

  union {
    __IOM uint32_t ADMATARGADDR9;               /*!< (@ 0x00002224) Auto DMA Target Address 9                                  */

    struct {
      __IOM uint32_t ADMATARGADDR9 : 32;        /*!< [31..0] Auto DMA Target Address for USB DMA request line 9                */
    } ADMATARGADDR9_b;
  } ;
  __IM  uint32_t  RESERVED8[54];

  union {
    __IOM uint32_t ADMAEP0;                     /*!< (@ 0x00002300) Auto DMA EP Number 0                                       */

    struct {
      __IOM uint32_t ADMAEP0    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 0                      */
            uint32_t            : 29;
    } ADMAEP0_b;
  } ;

  union {
    __IOM uint32_t ADMAEP1;                     /*!< (@ 0x00002304) Auto DMA EP Number 1                                       */

    struct {
      __IOM uint32_t ADMAEP1    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 1                      */
            uint32_t            : 29;
    } ADMAEP1_b;
  } ;

  union {
    __IOM uint32_t ADMAEP2;                     /*!< (@ 0x00002308) Auto DMA EP Number 2                                       */

    struct {
      __IOM uint32_t ADMAEP2    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 2                      */
            uint32_t            : 29;
    } ADMAEP2_b;
  } ;

  union {
    __IOM uint32_t ADMAEP3;                     /*!< (@ 0x0000230C) Auto DMA EP Number 3                                       */

    struct {
      __IOM uint32_t ADMAEP3    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 3                      */
            uint32_t            : 29;
    } ADMAEP3_b;
  } ;

  union {
    __IOM uint32_t ADMAEP4;                     /*!< (@ 0x00002310) Auto DMA EP Number 4                                       */

    struct {
      __IOM uint32_t ADMAEP4    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 4                      */
            uint32_t            : 29;
    } ADMAEP4_b;
  } ;

  union {
    __IOM uint32_t ADMAEP5;                     /*!< (@ 0x00002314) Auto DMA EP Number 5                                       */

    struct {
      __IOM uint32_t ADMAEP5    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 5                      */
            uint32_t            : 29;
    } ADMAEP5_b;
  } ;

  union {
    __IOM uint32_t ADMAEP6;                     /*!< (@ 0x00002318) Auto DMA EP Number 6                                       */

    struct {
      __IOM uint32_t ADMAEP6    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 6                      */
            uint32_t            : 29;
    } ADMAEP6_b;
  } ;

  union {
    __IOM uint32_t ADMAEP7;                     /*!< (@ 0x0000231C) Auto DMA EP Number 7                                       */

    struct {
      __IOM uint32_t ADMAEP7    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 7                      */
            uint32_t            : 29;
    } ADMAEP7_b;
  } ;

  union {
    __IOM uint32_t ADMAEP8;                     /*!< (@ 0x00002320) Auto DMA EP Number 8                                       */

    struct {
      __IOM uint32_t ADMAEP8    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 8                      */
            uint32_t            : 29;
    } ADMAEP8_b;
  } ;

  union {
    __IOM uint32_t ADMAEP9;                     /*!< (@ 0x00002324) Auto DMA EP Number 9                                       */

    struct {
      __IOM uint32_t ADMAEP9    : 3;            /*!< [2..0] Auto DMA EP Number for USB DMA request line 9                      */
            uint32_t            : 29;
    } ADMAEP9_b;
  } ;
  __IM  uint32_t  RESERVED9[54];

  union {
    __IOM uint32_t ADMAREQSIZE0;                /*!< (@ 0x00002400) Auto DMA Request Size 0                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE0 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 0                  */
            uint32_t            : 20;
    } ADMAREQSIZE0_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE1;                /*!< (@ 0x00002404) Auto DMA Request Size 1                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE1 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 1                  */
            uint32_t            : 20;
    } ADMAREQSIZE1_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE2;                /*!< (@ 0x00002408) Auto DMA Request Size 2                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE2 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 2                  */
            uint32_t            : 20;
    } ADMAREQSIZE2_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE3;                /*!< (@ 0x0000240C) Auto DMA Request Size 3                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE3 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 3                  */
            uint32_t            : 20;
    } ADMAREQSIZE3_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE4;                /*!< (@ 0x00002410) Auto DMA Request Size 4                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE4 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 4                  */
            uint32_t            : 20;
    } ADMAREQSIZE4_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE5;                /*!< (@ 0x00002414) Auto DMA Request Size 5                                    */

    struct {
      __IOM uint32_t ADMAREQSIZE5 : 12;         /*!< [11..0] Auto DMA Request Size for USB DMA request line 5                  */
            uint32_t            : 20;
    } ADMAREQSIZE5_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE6;                /*!< (@ 0x00002418) Auto DMA Request Size 6                                    */

