AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define CLKGEN_MISC_PWRONCLKENUSB_Msk     (0x200UL)                 /*!< PWRONCLKENUSB (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENGFX_Pos     (8UL)                     /*!< PWRONCLKENGFX (Bit 8)                                 */
#define CLKGEN_MISC_PWRONCLKENGFX_Msk     (0x100UL)                 /*!< PWRONCLKENGFX (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENDISPPHY_Pos (7UL)                     /*!< PWRONCLKENDISPPHY (Bit 7)                             */
#define CLKGEN_MISC_PWRONCLKENDISPPHY_Msk (0x80UL)                  /*!< PWRONCLKENDISPPHY (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_PWRONCLKENDISP_Pos    (6UL)                     /*!< PWRONCLKENDISP (Bit 6)                                */
#define CLKGEN_MISC_PWRONCLKENDISP_Msk    (0x40UL)                  /*!< PWRONCLKENDISP (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_FRCHFRC2_Pos          (5UL)                     /*!< FRCHFRC2 (Bit 5)                                      */
#define CLKGEN_MISC_FRCHFRC2_Msk          (0x20UL)                  /*!< FRCHFRC2 (Bitfield-Mask: 0x01)                        */
#define CLKGEN_MISC_FRCBURSTOFF_Pos       (1UL)                     /*!< FRCBURSTOFF (Bit 1)                                   */
#define CLKGEN_MISC_FRCBURSTOFF_Msk       (0x2UL)                   /*!< FRCBURSTOFF (Bitfield-Mask: 0x01)                     */
#define CLKGEN_MISC_FRCHFRC_Pos           (0UL)                     /*!< FRCHFRC (Bit 0)                                       */
#define CLKGEN_MISC_FRCHFRC_Msk           (0x1UL)                   /*!< FRCHFRC (Bitfield-Mask: 0x01)                         */
/* ========================================================  HF2ADJ0  ======================================================== */
#define CLKGEN_HF2ADJ0_XTHSMUXSEL_Pos     (30UL)                    /*!< XTHSMUXSEL (Bit 30)                                   */
#define CLKGEN_HF2ADJ0_XTHSMUXSEL_Msk     (0x40000000UL)            /*!< XTHSMUXSEL (Bitfield-Mask: 0x01)                      */
#define CLKGEN_HF2ADJ0_HF2ADJXTHSMUXSEL_Pos (29UL)                  /*!< HF2ADJXTHSMUXSEL (Bit 29)                             */
#define CLKGEN_HF2ADJ0_HF2ADJXTHSMUXSEL_Msk (0x20000000UL)          /*!< HF2ADJXTHSMUXSEL (Bitfield-Mask: 0x01)                */
#define CLKGEN_HF2ADJ0_HF2ADJCNTINOFFSET_Pos (15UL)                 /*!< HF2ADJCNTINOFFSET (Bit 15)                            */
#define CLKGEN_HF2ADJ0_HF2ADJCNTINOFFSET_Msk (0x1fff8000UL)         /*!< HF2ADJCNTINOFFSET (Bitfield-Mask: 0x3fff)             */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTRDLY_Pos (2UL)                   /*!< HF2ADJFASTSTRDLY (Bit 2)                              */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTRDLY_Msk (0x7ffcUL)              /*!< HF2ADJFASTSTRDLY (Bitfield-Mask: 0x1fff)              */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTREN_Pos (1UL)                    /*!< HF2ADJFASTSTREN (Bit 1)                               */
#define CLKGEN_HF2ADJ0_HF2ADJFASTSTREN_Msk (0x2UL)                  /*!< HF2ADJFASTSTREN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_HF2ADJ0_HF2ADJEN_Pos       (0UL)                     /*!< HF2ADJEN (Bit 0)                                      */
#define CLKGEN_HF2ADJ0_HF2ADJEN_Msk       (0x1UL)                   /*!< HF2ADJEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  HF2ADJ1  ======================================================== */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMOFFSET_Pos (3UL)                   /*!< HF2ADJTRIMOFFSET (Bit 3)                              */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMOFFSET_Msk (0x3ff8UL)              /*!< HF2ADJTRIMOFFSET (Bitfield-Mask: 0x7ff)               */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMEN_Pos   (0UL)                     /*!< HF2ADJTRIMEN (Bit 0)                                  */
#define CLKGEN_HF2ADJ1_HF2ADJTRIMEN_Msk   (0x7UL)                   /*!< HF2ADJTRIMEN (Bitfield-Mask: 0x07)                    */
/* ========================================================  HF2ADJ2  ======================================================== */
#define CLKGEN_HF2ADJ2_HF2ADJRATIO_Pos    (2UL)                     /*!< HF2ADJRATIO (Bit 2)                                   */
#define CLKGEN_HF2ADJ2_HF2ADJRATIO_Msk    (0x7ffffffcUL)            /*!< HF2ADJRATIO (Bitfield-Mask: 0x1fffffff)               */
#define CLKGEN_HF2ADJ2_HF2ADJXTALDIVRATIO_Pos (0UL)                 /*!< HF2ADJXTALDIVRATIO (Bit 0)                            */
#define CLKGEN_HF2ADJ2_HF2ADJXTALDIVRATIO_Msk (0x3UL)               /*!< HF2ADJXTALDIVRATIO (Bitfield-Mask: 0x03)              */
/* ========================================================  HF2VAL  ========================================================= */
#define CLKGEN_HF2VAL_HF2ADJTRIMOUT_Pos   (0UL)                     /*!< HF2ADJTRIMOUT (Bit 0)                                 */
#define CLKGEN_HF2VAL_HF2ADJTRIMOUT_Msk   (0x7ffUL)                 /*!< HF2ADJTRIMOUT (Bitfield-Mask: 0x7ff)                  */
/* =======================================================  LFRCCTRL  ======================================================== */
#define CLKGEN_LFRCCTRL_LFRCPWD_Pos       (1UL)                     /*!< LFRCPWD (Bit 1)                                       */
#define CLKGEN_LFRCCTRL_LFRCPWD_Msk       (0x2UL)                   /*!< LFRCPWD (Bitfield-Mask: 0x01)                         */
#define CLKGEN_LFRCCTRL_LFRCOUT_Pos       (0UL)                     /*!< LFRCOUT (Bit 0)                                       */
#define CLKGEN_LFRCCTRL_LFRCOUT_Msk       (0x1UL)                   /*!< LFRCOUT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DISPCLKCTRL  ====================================================== */
#define CLKGEN_DISPCLKCTRL_DBICLKDIV2EN_Pos (11UL)                  /*!< DBICLKDIV2EN (Bit 11)                                 */
#define CLKGEN_DISPCLKCTRL_DBICLKDIV2EN_Msk (0x800UL)               /*!< DBICLKDIV2EN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_DISPCLKCTRL_DBICLKSEL_Pos  (9UL)                     /*!< DBICLKSEL (Bit 9)                                     */
#define CLKGEN_DISPCLKCTRL_DBICLKSEL_Msk  (0x600UL)                 /*!< DBICLKSEL (Bitfield-Mask: 0x03)                       */
#define CLKGEN_DISPCLKCTRL_DCCLKEN_Pos    (8UL)                     /*!< DCCLKEN (Bit 8)                                       */
#define CLKGEN_DISPCLKCTRL_DCCLKEN_Msk    (0x100UL)                 /*!< DCCLKEN (Bitfield-Mask: 0x01)                         */
#define CLKGEN_DISPCLKCTRL_DISPCLKSEL_Pos (5UL)                     /*!< DISPCLKSEL (Bit 5)                                    */
#define CLKGEN_DISPCLKCTRL_DISPCLKSEL_Msk (0xe0UL)                  /*!< DISPCLKSEL (Bitfield-Mask: 0x07)                      */
#define CLKGEN_DISPCLKCTRL_PLLCLKEN_Pos   (4UL)                     /*!< PLLCLKEN (Bit 4)                                      */
#define CLKGEN_DISPCLKCTRL_PLLCLKEN_Msk   (0x10UL)                  /*!< PLLCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_DISPCLKCTRL_PLLCLKSEL_Pos  (0UL)                     /*!< PLLCLKSEL (Bit 0)                                     */
#define CLKGEN_DISPCLKCTRL_PLLCLKSEL_Msk  (0xfUL)                   /*!< PLLCLKSEL (Bitfield-Mask: 0x0f)                       */
/* =====================================================  CLKGENSPARES  ====================================================== */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Pos (0UL)                  /*!< CLKGENSPARES (Bit 0)                                  */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Msk (0xffffffffUL)         /*!< CLKGENSPARES (Bitfield-Mask: 0xffffffff)              */
/* ===================================================  HFRCIDLECOUNTERS  ==================================================== */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Pos (31UL)             /*!< UPDATEENABLE (Bit 31)                                 */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Msk (0x80000000UL)     /*!< UPDATEENABLE (Bitfield-Mask: 0x01)                    */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2CLKREQDELAY_Pos (24UL)         /*!< HFRC2CLKREQDELAY (Bit 24)                             */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2CLKREQDELAY_Msk (0x3f000000UL) /*!< HFRC2CLKREQDELAY (Bitfield-Mask: 0x3f)                */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2PWRDOWNDELAY_Pos (16UL)        /*!< HFRC2PWRDOWNDELAY (Bit 16)                            */
#define CLKGEN_HFRCIDLECOUNTERS_HFRC2PWRDOWNDELAY_Msk (0x3f0000UL)  /*!< HFRC2PWRDOWNDELAY (Bitfield-Mask: 0x3f)               */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Pos (8UL)           /*!< HFRCCLKREQDELAY (Bit 8)                               */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Msk (0x3f00UL)      /*!< HFRCCLKREQDELAY (Bitfield-Mask: 0x3f)                 */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Pos (0UL)          /*!< HFRCPWRDOWNDELAY (Bit 0)                              */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Msk (0x3fUL)       /*!< HFRCPWRDOWNDELAY (Bitfield-Mask: 0x3f)                */
/* =====================================================  MSPIIOCLKCTRL  ===================================================== */
#define CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_Pos (16UL)               /*!< MSPI3IOCLKSEL (Bit 16)                                */
#define CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKSEL_Msk (0xf0000UL)          /*!< MSPI3IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN_Pos (15UL)                /*!< MSPI3IOCLKEN (Bit 15)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI3IOCLKEN_Msk (0x8000UL)            /*!< MSPI3IOCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Pos (11UL)               /*!< MSPI2IOCLKSEL (Bit 11)                                */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Msk (0x7800UL)           /*!< MSPI2IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Pos (10UL)                /*!< MSPI2IOCLKEN (Bit 10)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Msk (0x400UL)             /*!< MSPI2IOCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Pos (6UL)                /*!< MSPI1IOCLKSEL (Bit 6)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Msk (0x3c0UL)            /*!< MSPI1IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Pos (5UL)                 /*!< MSPI1IOCLKEN (Bit 5)                                  */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Msk (0x20UL)              /*!< MSPI1IOCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Pos (1UL)                /*!< MSPI0IOCLKSEL (Bit 1)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Msk (0x1eUL)             /*!< MSPI0IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Pos (0UL)                 /*!< MSPI0IOCLKEN (Bit 0)                                  */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Msk (0x1UL)               /*!< MSPI0IOCLKEN (Bitfield-Mask: 0x01)                    */
/* ========================================================  CLKCTRL  ======================================================== */
#define CLKGEN_CLKCTRL_DISPCTRLCLKEN_Pos  (8UL)                     /*!< DISPCTRLCLKEN (Bit 8)                                 */
#define CLKGEN_CLKCTRL_DISPCTRLCLKEN_Msk  (0x100UL)                 /*!< DISPCTRLCLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_MCUCLKFORCEON_Pos  (7UL)                     /*!< MCUCLKFORCEON (Bit 7)                                 */
#define CLKGEN_CLKCTRL_MCUCLKFORCEON_Msk  (0x80UL)                  /*!< MCUCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_IWICCLKFORCEON_Pos (6UL)                     /*!< IWICCLKFORCEON (Bit 6)                                */
#define CLKGEN_CLKCTRL_IWICCLKFORCEON_Msk (0x40UL)                  /*!< IWICCLKFORCEON (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLKCTRL_DBGCLKFORCEON_Pos  (5UL)                     /*!< DBGCLKFORCEON (Bit 5)                                 */
#define CLKGEN_CLKCTRL_DBGCLKFORCEON_Msk  (0x20UL)                  /*!< DBGCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_PMUCLKFORCEON_Pos  (4UL)                     /*!< PMUCLKFORCEON (Bit 4)                                 */
#define CLKGEN_CLKCTRL_PMUCLKFORCEON_Msk  (0x10UL)                  /*!< PMUCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_STCLKFORCEON_Pos   (3UL)                     /*!< STCLKFORCEON (Bit 3)                                  */
#define CLKGEN_CLKCTRL_STCLKFORCEON_Msk   (0x8UL)                   /*!< STCLKFORCEON (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLKCTRL_GFXCORECLKSEL_Pos  (1UL)                     /*!< GFXCORECLKSEL (Bit 1)                                 */
#define CLKGEN_CLKCTRL_GFXCORECLKSEL_Msk  (0x6UL)                   /*!< GFXCORECLKSEL (Bitfield-Mask: 0x03)                   */
#define CLKGEN_CLKCTRL_GFXCORECLKEN_Pos   (0UL)                     /*!< GFXCORECLKEN (Bit 0)                                  */
#define CLKGEN_CLKCTRL_GFXCORECLKEN_Msk   (0x1UL)                   /*!< GFXCORECLKEN (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */

