AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =========================================================  MODE  ========================================================== */
#define DC_MODE_ENABLE_Pos                (31UL)                    /*!< ENABLE (Bit 31)                                       */
#define DC_MODE_ENABLE_Msk                (0x80000000UL)            /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define DC_MODE_PRGCUREN_Pos              (30UL)                    /*!< PRGCUREN (Bit 30)                                     */
#define DC_MODE_PRGCUREN_Msk              (0x40000000UL)            /*!< PRGCUREN (Bitfield-Mask: 0x01)                        */
#define DC_MODE_RSVD029_Pos               (29UL)                    /*!< RSVD029 (Bit 29)                                      */
#define DC_MODE_RSVD029_Msk               (0x20000000UL)            /*!< RSVD029 (Bitfield-Mask: 0x01)                         */
#define DC_MODE_VSYNCPOL_Pos              (28UL)                    /*!< VSYNCPOL (Bit 28)                                     */
#define DC_MODE_VSYNCPOL_Msk              (0x10000000UL)            /*!< VSYNCPOL (Bitfield-Mask: 0x01)                        */
#define DC_MODE_HSYNCPOL_Pos              (27UL)                    /*!< HSYNCPOL (Bit 27)                                     */
#define DC_MODE_HSYNCPOL_Msk              (0x8000000UL)             /*!< HSYNCPOL (Bitfield-Mask: 0x01)                        */
#define DC_MODE_DEPOL_Pos                 (26UL)                    /*!< DEPOL (Bit 26)                                        */
#define DC_MODE_DEPOL_Msk                 (0x4000000UL)             /*!< DEPOL (Bitfield-Mask: 0x01)                           */
#define DC_MODE_DITHEREN_Pos              (24UL)                    /*!< DITHEREN (Bit 24)                                     */
#define DC_MODE_DITHEREN_Msk              (0x3000000UL)             /*!< DITHEREN (Bitfield-Mask: 0x03)                        */
#define DC_MODE_SNGVSYNC_Pos              (23UL)                    /*!< SNGVSYNC (Bit 23)                                     */
#define DC_MODE_SNGVSYNC_Msk              (0x800000UL)              /*!< SNGVSYNC (Bitfield-Mask: 0x01)                        */
#define DC_MODE_RSVD21_Pos                (21UL)                    /*!< RSVD21 (Bit 21)                                       */
#define DC_MODE_RSVD21_Msk                (0x600000UL)              /*!< RSVD21 (Bitfield-Mask: 0x03)                          */
#define DC_MODE_GAMARAMPEN_Pos            (20UL)                    /*!< GAMARAMPEN (Bit 20)                                   */
#define DC_MODE_GAMARAMPEN_Msk            (0x100000UL)              /*!< GAMARAMPEN (Bitfield-Mask: 0x01)                      */
#define DC_MODE_BLANKFRC_Pos              (19UL)                    /*!< BLANKFRC (Bit 19)                                     */
#define DC_MODE_BLANKFRC_Msk              (0x80000UL)               /*!< BLANKFRC (Bitfield-Mask: 0x01)                        */
#define DC_MODE_UNDERRUNEN_Pos            (18UL)                    /*!< UNDERRUNEN (Bit 18)                                   */
#define DC_MODE_UNDERRUNEN_Msk            (0x40000UL)               /*!< UNDERRUNEN (Bitfield-Mask: 0x01)                      */
#define DC_MODE_SNGFRAME_Pos              (17UL)                    /*!< SNGFRAME (Bit 17)                                     */
#define DC_MODE_SNGFRAME_Msk              (0x20000UL)               /*!< SNGFRAME (Bitfield-Mask: 0x01)                        */
#define DC_MODE_RSVD15_Pos                (15UL)                    /*!< RSVD15 (Bit 15)                                       */
#define DC_MODE_RSVD15_Msk                (0x18000UL)               /*!< RSVD15 (Bitfield-Mask: 0x03)                          */
#define DC_MODE_RGBCFG_Pos                (12UL)                    /*!< RGBCFG (Bit 12)                                       */
#define DC_MODE_RGBCFG_Msk                (0x7000UL)                /*!< RGBCFG (Bitfield-Mask: 0x07)                          */
#define DC_MODE_DPICLKSET_Pos             (11UL)                    /*!< DPICLKSET (Bit 11)                                    */
#define DC_MODE_DPICLKSET_Msk             (0x800UL)                 /*!< DPICLKSET (Bitfield-Mask: 0x01)                       */
#define DC_MODE_RSVD10_Pos                (10UL)                    /*!< RSVD10 (Bit 10)                                       */
#define DC_MODE_RSVD10_Msk                (0x400UL)                 /*!< RSVD10 (Bitfield-Mask: 0x01)                          */
#define DC_MODE_COLFMT_Pos                (9UL)                     /*!< COLFMT (Bit 9)                                        */
#define DC_MODE_COLFMT_Msk                (0x200UL)                 /*!< COLFMT (Bitfield-Mask: 0x01)                          */
#define DC_MODE_DISPFMT_Pos               (5UL)                     /*!< DISPFMT (Bit 5)                                       */
#define DC_MODE_DISPFMT_Msk               (0x1e0UL)                 /*!< DISPFMT (Bitfield-Mask: 0x0f)                         */
#define DC_MODE_RSVD04_Pos                (4UL)                     /*!< RSVD04 (Bit 4)                                        */
#define DC_MODE_RSVD04_Msk                (0x10UL)                  /*!< RSVD04 (Bitfield-Mask: 0x01)                          */
#define DC_MODE_YUYVEN_Pos                (3UL)                     /*!< YUYVEN (Bit 3)                                        */
#define DC_MODE_YUYVEN_Msk                (0x8UL)                   /*!< YUYVEN (Bitfield-Mask: 0x01)                          */
#define DC_MODE_RSVD02_Pos                (2UL)                     /*!< RSVD02 (Bit 2)                                        */
#define DC_MODE_RSVD02_Msk                (0x4UL)                   /*!< RSVD02 (Bitfield-Mask: 0x01)                          */
#define DC_MODE_DBLHORSCANEN_Pos          (1UL)                     /*!< DBLHORSCANEN (Bit 1)                                  */
#define DC_MODE_DBLHORSCANEN_Msk          (0x2UL)                   /*!< DBLHORSCANEN (Bitfield-Mask: 0x01)                    */
#define DC_MODE_TSTMODEN_Pos              (0UL)                     /*!< TSTMODEN (Bit 0)                                      */
#define DC_MODE_TSTMODEN_Msk              (0x1UL)                   /*!< TSTMODEN (Bitfield-Mask: 0x01)                        */
/* ========================================================  CLKCTRL  ======================================================== */
#define DC_CLKCTRL_SECCLKDIV_Pos          (27UL)                    /*!< SECCLKDIV (Bit 27)                                    */
#define DC_CLKCTRL_SECCLKDIV_Msk          (0xf8000000UL)            /*!< SECCLKDIV (Bitfield-Mask: 0x1f)                       */
#define DC_CLKCTRL_RSVD024_Pos            (24UL)                    /*!< RSVD024 (Bit 24)                                      */
#define DC_CLKCTRL_RSVD024_Msk            (0x7000000UL)             /*!< RSVD024 (Bitfield-Mask: 0x07)                         */
#define DC_CLKCTRL_PLL_Pos                (16UL)                    /*!< PLL (Bit 16)                                          */
#define DC_CLKCTRL_PLL_Msk                (0xff0000UL)              /*!< PLL (Bitfield-Mask: 0xff)                             */
#define DC_CLKCTRL_RSVD14_Pos             (14UL)                    /*!< RSVD14 (Bit 14)                                       */
#define DC_CLKCTRL_RSVD14_Msk             (0xc000UL)                /*!< RSVD14 (Bitfield-Mask: 0x03)                          */
#define DC_CLKCTRL_LINENUM_Pos            (8UL)                     /*!< LINENUM (Bit 8)                                       */
#define DC_CLKCTRL_LINENUM_Msk            (0x3f00UL)                /*!< LINENUM (Bitfield-Mask: 0x3f)                         */
#define DC_CLKCTRL_RSVD06_Pos             (6UL)                     /*!< RSVD06 (Bit 6)                                        */
#define DC_CLKCTRL_RSVD06_Msk             (0xc0UL)                  /*!< RSVD06 (Bitfield-Mask: 0x03)                          */
#define DC_CLKCTRL_DIVIDEVALUE_Pos        (0UL)                     /*!< DIVIDEVALUE (Bit 0)                                   */
#define DC_CLKCTRL_DIVIDEVALUE_Msk        (0x3fUL)                  /*!< DIVIDEVALUE (Bitfield-Mask: 0x3f)                     */
/* ========================================================  BGCOLOR  ======================================================== */
#define DC_BGCOLOR_REDCOLOR_Pos           (24UL)                    /*!< REDCOLOR (Bit 24)                                     */
#define DC_BGCOLOR_REDCOLOR_Msk           (0xff000000UL)            /*!< REDCOLOR (Bitfield-Mask: 0xff)                        */
#define DC_BGCOLOR_GREENCOLOR_Pos         (16UL)                    /*!< GREENCOLOR (Bit 16)                                   */
#define DC_BGCOLOR_GREENCOLOR_Msk         (0xff0000UL)              /*!< GREENCOLOR (Bitfield-Mask: 0xff)                      */
#define DC_BGCOLOR_BLUECOLOR_Pos          (8UL)                     /*!< BLUECOLOR (Bit 8)                                     */
#define DC_BGCOLOR_BLUECOLOR_Msk          (0xff00UL)                /*!< BLUECOLOR (Bitfield-Mask: 0xff)                       */
#define DC_BGCOLOR_ALPHACOLOR_Pos         (0UL)                     /*!< ALPHACOLOR (Bit 0)                                    */
#define DC_BGCOLOR_ALPHACOLOR_Msk         (0xffUL)                  /*!< ALPHACOLOR (Bitfield-Mask: 0xff)                      */
/* =========================================================  RESXY  ========================================================= */
#define DC_RESXY_XRES_Pos                 (16UL)                    /*!< XRES (Bit 16)                                         */
#define DC_RESXY_XRES_Msk                 (0xffff0000UL)            /*!< XRES (Bitfield-Mask: 0xffff)                          */
#define DC_RESXY_YRES_Pos                 (0UL)                     /*!< YRES (Bit 0)                                          */
#define DC_RESXY_YRES_Msk                 (0xffffUL)                /*!< YRES (Bitfield-Mask: 0xffff)                          */
/* ========================================================  REGPLAY  ======================================================== */
#define DC_REGPLAY_PLAY_Pos               (0UL)                     /*!< PLAY (Bit 0)                                          */
#define DC_REGPLAY_PLAY_Msk               (0xffffffffUL)            /*!< PLAY (Bitfield-Mask: 0xffffffff)                      */
/* =====================================================  FRONTPORCHXY  ====================================================== */
#define DC_FRONTPORCHXY_FPCLKCYCLES_Pos   (16UL)                    /*!< FPCLKCYCLES (Bit 16)                                  */
#define DC_FRONTPORCHXY_FPCLKCYCLES_Msk   (0xffff0000UL)            /*!< FPCLKCYCLES (Bitfield-Mask: 0xffff)                   */
#define DC_FRONTPORCHXY_FLINES_Pos        (0UL)                     /*!< FLINES (Bit 0)                                        */
#define DC_FRONTPORCHXY_FLINES_Msk        (0xffffUL)                /*!< FLINES (Bitfield-Mask: 0xffff)                        */
/* ======================================================  BLANKINGXY  ======================================================= */
#define DC_BLANKINGXY_HSYNCPULSE_Pos      (16UL)                    /*!< HSYNCPULSE (Bit 16)                                   */
#define DC_BLANKINGXY_HSYNCPULSE_Msk      (0xffff0000UL)            /*!< HSYNCPULSE (Bitfield-Mask: 0xffff)                    */
#define DC_BLANKINGXY_VSYNCLINES_Pos      (0UL)                     /*!< VSYNCLINES (Bit 0)                                    */
#define DC_BLANKINGXY_VSYNCLINES_Msk      (0xffffUL)                /*!< VSYNCLINES (Bitfield-Mask: 0xffff)                    */
/* ======================================================  BACKPORCHXY  ====================================================== */
#define DC_BACKPORCHXY_BPCLKCYCLES_Pos    (16UL)                    /*!< BPCLKCYCLES (Bit 16)                                  */
#define DC_BACKPORCHXY_BPCLKCYCLES_Msk    (0xffff0000UL)            /*!< BPCLKCYCLES (Bitfield-Mask: 0xffff)                   */
#define DC_BACKPORCHXY_BLINES_Pos         (0UL)                     /*!< BLINES (Bit 0)                                        */
#define DC_BACKPORCHXY_BLINES_Msk         (0xffffUL)                /*!< BLINES (Bitfield-Mask: 0xffff)                        */
/* =======================================================  CURSORXY  ======================================================== */
#define DC_CURSORXY_CURSORX_Pos           (16UL)                    /*!< CURSORX (Bit 16)                                      */
#define DC_CURSORXY_CURSORX_Msk           (0xffff0000UL)            /*!< CURSORX (Bitfield-Mask: 0xffff)                       */
#define DC_CURSORXY_CURSORY_Pos           (0UL)                     /*!< CURSORY (Bit 0)                                       */
#define DC_CURSORXY_CURSORY_Msk           (0xffffUL)                /*!< CURSORY (Bitfield-Mask: 0xffff)                       */
/* ========================================================  STARTXY  ======================================================== */
#define DC_STARTXY_STARTX_Pos             (16UL)                    /*!< STARTX (Bit 16)                                       */
#define DC_STARTXY_STARTX_Msk             (0xffff0000UL)            /*!< STARTX (Bitfield-Mask: 0xffff)                        */
#define DC_STARTXY_STARTY_Pos             (0UL)                     /*!< STARTY (Bit 0)                                        */
#define DC_STARTXY_STARTY_Msk             (0xffffUL)                /*!< STARTY (Bitfield-Mask: 0xffff)                        */
/* ========================================================  DBICFG  ========================================================= */
#define DC_DBICFG_DBIINTACT_Pos           (31UL)                    /*!< DBIINTACT (Bit 31)                                    */
#define DC_DBICFG_DBIINTACT_Msk           (0x80000000UL)            /*!< DBIINTACT (Bitfield-Mask: 0x01)                       */
#define DC_DBICFG_CSXCFG_Pos              (30UL)                    /*!< CSXCFG (Bit 30)                                       */
#define DC_DBICFG_CSXCFG_Msk              (0x40000000UL)            /*!< CSXCFG (Bitfield-Mask: 0x01)                          */
#define DC_DBICFG_CSXSET_Pos              (29UL)                    /*!< CSXSET (Bit 29)                                       */
#define DC_DBICFG_CSXSET_Msk              (0x20000000UL)            /*!< CSXSET (Bitfield-Mask: 0x01)                          */
#define DC_DBICFG_DBIBTEDIS_Pos           (28UL)                    /*!< DBIBTEDIS (Bit 28)                                    */
#define DC_DBICFG_DBIBTEDIS_Msk           (0x10000000UL)            /*!< DBIBTEDIS (Bitfield-Mask: 0x01)                       */
#define DC_DBICFG_RSVD26_Pos              (26UL)                    /*!< RSVD26 (Bit 26)                                       */
#define DC_DBICFG_RSVD26_Msk              (0xc000000UL)             /*!< RSVD26 (Bitfield-Mask: 0x03)                          */
#define DC_DBICFG_RESXLOW_Pos             (25UL)                    /*!< RESXLOW (Bit 25)                                      */
#define DC_DBICFG_RESXLOW_Msk             (0x2000000UL)             /*!< RESXLOW (Bitfield-Mask: 0x01)                         */
#define DC_DBICFG_RSVD2401_Pos            (24UL)                    /*!< RSVD2401 (Bit 24)                                     */
#define DC_DBICFG_RSVD2401_Msk            (0x1000000UL)             /*!< RSVD2401 (Bitfield-Mask: 0x01)                        */
#define DC_DBICFG_SPI3_Pos                (23UL)                    /*!< SPI3 (Bit 23)                                         */
#define DC_DBICFG_SPI3_Msk                (0x800000UL)              /*!< SPI3 (Bitfield-Mask: 0x01)                            */
#define DC_DBICFG_SPI4_Pos                (22UL)                    /*!< SPI4 (Bit 22)                                         */
#define DC_DBICFG_SPI4_Msk                (0x400000UL)              /*!< SPI4 (Bitfield-Mask: 0x01)                            */
#define DC_DBICFG_RSVD18_Pos              (18UL)                    /*!< RSVD18 (Bit 18)                                       */
#define DC_DBICFG_RSVD18_Msk              (0x3c0000UL)              /*!< RSVD18 (Bitfield-Mask: 0x0f)                          */
#define DC_DBICFG_BINDCMDS_Pos            (17UL)                    /*!< BINDCMDS (Bit 17)                                     */
#define DC_DBICFG_BINDCMDS_Msk            (0x20000UL)               /*!< BINDCMDS (Bitfield-Mask: 0x01)                        */
#define DC_DBICFG_INVHRZLINE_Pos          (16UL)                    /*!< INVHRZLINE (Bit 16)                                   */
#define DC_DBICFG_INVHRZLINE_Msk          (0x10000UL)               /*!< INVHRZLINE (Bitfield-Mask: 0x01)                      */
#define DC_DBICFG_RSVD12_Pos              (12UL)                    /*!< RSVD12 (Bit 12)                                       */
#define DC_DBICFG_RSVD12_Msk              (0xf000UL)                /*!< RSVD12 (Bitfield-Mask: 0x0f)                          */
#define DC_DBICFG_BACKPRESSUREEN_Pos      (11UL)                    /*!< BACKPRESSUREEN (Bit 11)                               */
#define DC_DBICFG_BACKPRESSUREEN_Msk      (0x800UL)                 /*!< BACKPRESSUREEN (Bitfield-Mask: 0x01)                  */
#define DC_DBICFG_RSVD08_Pos              (8UL)                     /*!< RSVD08 (Bit 8)                                        */
#define DC_DBICFG_RSVD08_Msk              (0x700UL)                 /*!< RSVD08 (Bitfield-Mask: 0x07)                          */
#define DC_DBICFG_TYPEBWIDTH_Pos          (6UL)                     /*!< TYPEBWIDTH (Bit 6)                                    */
#define DC_DBICFG_TYPEBWIDTH_Msk          (0xc0UL)                  /*!< TYPEBWIDTH (Bitfield-Mask: 0x03)                      */
#define DC_DBICFG_DATAWDORDER_Pos         (3UL)                     /*!< DATAWDORDER (Bit 3)                                   */
#define DC_DBICFG_DATAWDORDER_Msk         (0x38UL)                  /*!< DATAWDORDER (Bitfield-Mask: 0x07)                     */
#define DC_DBICFG_DBICOLORFMT_Pos         (0UL)                     /*!< DBICOLORFMT (Bit 0)                                   */
#define DC_DBICFG_DBICOLORFMT_Msk         (0x7UL)                   /*!< DBICOLORFMT (Bitfield-Mask: 0x07)                     */
/* ========================================================  DCGPIO  ========================================================= */
#define DC_DCGPIO_CGBYPASS_Pos            (22UL)                    /*!< CGBYPASS (Bit 22)                                     */
#define DC_DCGPIO_CGBYPASS_Msk            (0xffc00000UL)            /*!< CGBYPASS (Bitfield-Mask: 0x3ff)                       */
#define DC_DCGPIO_RSVD09_Pos              (9UL)                     /*!< RSVD09 (Bit 9)                                        */
#define DC_DCGPIO_RSVD09_Msk              (0x3ffe00UL)              /*!< RSVD09 (Bitfield-Mask: 0x1fff)                        */
#define DC_DCGPIO_ADVANCEANYWAY_Pos       (7UL)                     /*!< ADVANCEANYWAY (Bit 7)                                 */
#define DC_DCGPIO_ADVANCEANYWAY_Msk       (0x180UL)                 /*!< ADVANCEANYWAY (Bitfield-Mask: 0x03)                   */
#define DC_DCGPIO_RSVD0_Pos               (2UL)                     /*!< RSVD0 (Bit 2)                                         */
#define DC_DCGPIO_RSVD0_Msk               (0x7cUL)                  /*!< RSVD0 (Bitfield-Mask: 0x1f)                           */
#define DC_DCGPIO_RWPINS_Pos              (0UL)                     /*!< RWPINS (Bit 0)                                        */
#define DC_DCGPIO_RWPINS_Msk              (0x3UL)                   /*!< RWPINS (Bitfield-Mask: 0x03)                          */
/* ======================================================  LAYER0MODE  ======================================================= */
#define DC_LAYER0MODE_LAYER0EN_Pos        (31UL)                    /*!< LAYER0EN (Bit 31)                                     */
#define DC_LAYER0MODE_LAYER0EN_Msk        (0x80000000UL)            /*!< LAYER0EN (Bitfield-Mask: 0x01)                        */
#define DC_LAYER0MODE_LAYER0FORCE_Pos     (30UL)                    /*!< LAYER0FORCE (Bit 30)                                  */
#define DC_LAYER0MODE_LAYER0FORCE_Msk     (0x40000000UL)            /*!< LAYER0FORCE (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_LAYER0DISMECHANISM_Pos (29UL)                 /*!< LAYER0DISMECHANISM (Bit 29)                           */
#define DC_LAYER0MODE_LAYER0DISMECHANISM_Msk (0x20000000UL)         /*!< LAYER0DISMECHANISM (Bitfield-Mask: 0x01)              */
#define DC_LAYER0MODE_LAYER0PREMULT_Pos   (28UL)                    /*!< LAYER0PREMULT (Bit 28)                                */
#define DC_LAYER0MODE_LAYER0PREMULT_Msk   (0x10000000UL)            /*!< LAYER0PREMULT (Bitfield-Mask: 0x01)                   */
#define DC_LAYER0MODE_RSVD27_Pos          (27UL)                    /*!< RSVD27 (Bit 27)                                       */
#define DC_LAYER0MODE_RSVD27_Msk          (0x8000000UL)             /*!< RSVD27 (Bitfield-Mask: 0x01)                          */
#define DC_LAYER0MODE_LAYER0GAMMA_Pos     (26UL)                    /*!< LAYER0GAMMA (Bit 26)                                  */
#define DC_LAYER0MODE_LAYER0GAMMA_Msk     (0x4000000UL)             /*!< LAYER0GAMMA (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_RSVD24_Pos          (24UL)                    /*!< RSVD24 (Bit 24)                                       */
#define DC_LAYER0MODE_RSVD24_Msk          (0x3000000UL)             /*!< RSVD24 (Bitfield-Mask: 0x03)                          */
#define DC_LAYER0MODE_LAYER0ALPHA_Pos     (16UL)                    /*!< LAYER0ALPHA (Bit 16)                                  */
#define DC_LAYER0MODE_LAYER0ALPHA_Msk     (0xff0000UL)              /*!< LAYER0ALPHA (Bitfield-Mask: 0xff)                     */
#define DC_LAYER0MODE_LAYER0DBLEND_Pos    (12UL)                    /*!< LAYER0DBLEND (Bit 12)                                 */
#define DC_LAYER0MODE_LAYER0DBLEND_Msk    (0xf000UL)                /*!< LAYER0DBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER0MODE_LAYER0SBLEND_Pos    (8UL)                     /*!< LAYER0SBLEND (Bit 8)                                  */
#define DC_LAYER0MODE_LAYER0SBLEND_Msk    (0xf00UL)                 /*!< LAYER0SBLEND (Bitfield-Mask: 0x0f)                    */
#define DC_LAYER0MODE_FlipYenable_Pos     (7UL)                     /*!< FlipYenable (Bit 7)                                   */
#define DC_LAYER0MODE_FlipYenable_Msk     (0x80UL)                  /*!< FlipYenable (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_FlipXenable_Pos     (6UL)                     /*!< FlipXenable (Bit 6)                                   */
#define DC_LAYER0MODE_FlipXenable_Msk     (0x40UL)                  /*!< FlipXenable (Bitfield-Mask: 0x01)                     */
#define DC_LAYER0MODE_MODElayerregisterprotect_Pos (5UL)            /*!< MODElayerregisterprotect (Bit 5)                      */
#define DC_LAYER0MODE_MODElayerregisterprotect_Msk (0x20UL)         /*!< MODElayerregisterprotect (Bitfield-Mask: 0x01)        */
#define DC_LAYER0MODE_LAYER0COLMODE_Pos   (0UL)                     /*!< LAYER0COLMODE (Bit 0)                                 */
#define DC_LAYER0MODE_LAYER0COLMODE_Msk   (0x1fUL)                  /*!< LAYER0COLMODE (Bitfield-Mask: 0x1f)                   */
/* =====================================================  LAYER0STARTXY  ===================================================== */
