AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define DC_DBICMD_RSVD31_Msk              (0x80000000UL)            /*!< RSVD31 (Bitfield-Mask: 0x01)                          */
#define DC_DBICMD_DIRECTDATA_Pos          (30UL)                    /*!< DIRECTDATA (Bit 30)                                   */
#define DC_DBICMD_DIRECTDATA_Msk          (0x40000000UL)            /*!< DIRECTDATA (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD29_Pos              (29UL)                    /*!< RSVD29 (Bit 29)                                       */
#define DC_DBICMD_RSVD29_Msk              (0x20000000UL)            /*!< RSVD29 (Bitfield-Mask: 0x01)                          */
#define DC_DBICMD_READDBI_Pos             (28UL)                    /*!< READDBI (Bit 28)                                      */
#define DC_DBICMD_READDBI_Msk             (0x10000000UL)            /*!< READDBI (Bitfield-Mask: 0x01)                         */
#define DC_DBICMD_LOCALSTORE_Pos          (27UL)                    /*!< LOCALSTORE (Bit 27)                                   */
#define DC_DBICMD_LOCALSTORE_Msk          (0x8000000UL)             /*!< LOCALSTORE (Bitfield-Mask: 0x01)                      */
#define DC_DBICMD_RSVD11_Pos              (16UL)                    /*!< RSVD11 (Bit 16)                                       */
#define DC_DBICMD_RSVD11_Msk              (0x7ff0000UL)             /*!< RSVD11 (Bitfield-Mask: 0x7ff)                         */
#define DC_DBICMD_DATA2DBI_Pos            (0UL)                     /*!< DATA2DBI (Bit 0)                                      */
#define DC_DBICMD_DATA2DBI_Msk            (0xffffUL)                /*!< DATA2DBI (Bitfield-Mask: 0xffff)                      */
/* ========================================================  DBIRDAT  ======================================================== */
#define DC_DBIRDAT_READTYPEB_Pos          (0UL)                     /*!< READTYPEB (Bit 0)                                     */
#define DC_DBIRDAT_READTYPEB_Msk          (0xffffffffUL)            /*!< READTYPEB (Bitfield-Mask: 0xffffffff)                 */
/* =========================================================  CONFG  ========================================================= */
#define DC_CONFG_CFGLAYER3TSCMEM_Pos      (31UL)                    /*!< CFGLAYER3TSCMEM (Bit 31)                              */
#define DC_CONFG_CFGLAYER3TSCMEM_Msk      (0x80000000UL)            /*!< CFGLAYER3TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER2TSCMEM_Pos      (30UL)                    /*!< CFGLAYER2TSCMEM (Bit 30)                              */
#define DC_CONFG_CFGLAYER2TSCMEM_Msk      (0x40000000UL)            /*!< CFGLAYER2TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER1TSCMEM_Pos      (29UL)                    /*!< CFGLAYER1TSCMEM (Bit 29)                              */
#define DC_CONFG_CFGLAYER1TSCMEM_Msk      (0x20000000UL)            /*!< CFGLAYER1TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER0TSCMEM_Pos      (28UL)                    /*!< CFGLAYER0TSCMEM (Bit 28)                              */
#define DC_CONFG_CFGLAYER0TSCMEM_Msk      (0x10000000UL)            /*!< CFGLAYER0TSCMEM (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_RSVD25_Pos               (25UL)                    /*!< RSVD25 (Bit 25)                                       */
#define DC_CONFG_RSVD25_Msk               (0xe000000UL)             /*!< RSVD25 (Bitfield-Mask: 0x07)                          */
#define DC_CONFG_CFGSPIINTERFACE_Pos      (24UL)                    /*!< CFGSPIINTERFACE (Bit 24)                              */
#define DC_CONFG_CFGSPIINTERFACE_Msk      (0x1000000UL)             /*!< CFGSPIINTERFACE (Bitfield-Mask: 0x01)                 */
#define DC_CONFG_CFGLAYER3GAMMALUT_Pos    (23UL)                    /*!< CFGLAYER3GAMMALUT (Bit 23)                            */
#define DC_CONFG_CFGLAYER3GAMMALUT_Msk    (0x800000UL)              /*!< CFGLAYER3GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD22_Pos               (22UL)                    /*!< RSVD22 (Bit 22)                                       */
#define DC_CONFG_RSVD22_Msk               (0x400000UL)              /*!< RSVD22 (Bitfield-Mask: 0x01)                          */
#define DC_CONFG_CFGLAYER3BLENDER_Pos     (21UL)                    /*!< CFGLAYER3BLENDER (Bit 21)                             */
#define DC_CONFG_CFGLAYER3BLENDER_Msk     (0x200000UL)              /*!< CFGLAYER3BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER3EN_Pos          (20UL)                    /*!< CFGLAYER3EN (Bit 20)                                  */
#define DC_CONFG_CFGLAYER3EN_Msk          (0x100000UL)              /*!< CFGLAYER3EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER2GAMMALUT_Pos    (19UL)                    /*!< CFGLAYER2GAMMALUT (Bit 19)                            */
#define DC_CONFG_CFGLAYER2GAMMALUT_Msk    (0x80000UL)               /*!< CFGLAYER2GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD1801_Pos             (18UL)                    /*!< RSVD1801 (Bit 18)                                     */
#define DC_CONFG_RSVD1801_Msk             (0x40000UL)               /*!< RSVD1801 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGLAYER2BLENDER_Pos     (17UL)                    /*!< CFGLAYER2BLENDER (Bit 17)                             */
#define DC_CONFG_CFGLAYER2BLENDER_Msk     (0x20000UL)               /*!< CFGLAYER2BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER2EN_Pos          (16UL)                    /*!< CFGLAYER2EN (Bit 16)                                  */
#define DC_CONFG_CFGLAYER2EN_Msk          (0x10000UL)               /*!< CFGLAYER2EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER1GAMMALUT_Pos    (15UL)                    /*!< CFGLAYER1GAMMALUT (Bit 15)                            */
#define DC_CONFG_CFGLAYER1GAMMALUT_Msk    (0x8000UL)                /*!< CFGLAYER1GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD1401_Pos             (14UL)                    /*!< RSVD1401 (Bit 14)                                     */
#define DC_CONFG_RSVD1401_Msk             (0x4000UL)                /*!< RSVD1401 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGLAYER1BLENDER_Pos     (13UL)                    /*!< CFGLAYER1BLENDER (Bit 13)                             */
#define DC_CONFG_CFGLAYER1BLENDER_Msk     (0x2000UL)                /*!< CFGLAYER1BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER1EN_Pos          (12UL)                    /*!< CFGLAYER1EN (Bit 12)                                  */
#define DC_CONFG_CFGLAYER1EN_Msk          (0x1000UL)                /*!< CFGLAYER1EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGLAYER0GAMMALUT_Pos    (11UL)                    /*!< CFGLAYER0GAMMALUT (Bit 11)                            */
#define DC_CONFG_CFGLAYER0GAMMALUT_Msk    (0x800UL)                 /*!< CFGLAYER0GAMMALUT (Bitfield-Mask: 0x01)               */
#define DC_CONFG_RSVD3_Pos                (10UL)                    /*!< RSVD3 (Bit 10)                                        */
#define DC_CONFG_RSVD3_Msk                (0x400UL)                 /*!< RSVD3 (Bitfield-Mask: 0x01)                           */
#define DC_CONFG_CFGLAYER0BLENDER_Pos     (9UL)                     /*!< CFGLAYER0BLENDER (Bit 9)                              */
#define DC_CONFG_CFGLAYER0BLENDER_Msk     (0x200UL)                 /*!< CFGLAYER0BLENDER (Bitfield-Mask: 0x01)                */
#define DC_CONFG_CFGLAYER0EN_Pos          (8UL)                     /*!< CFGLAYER0EN (Bit 8)                                   */
#define DC_CONFG_CFGLAYER0EN_Msk          (0x100UL)                 /*!< CFGLAYER0EN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_CFGRGB2YUVEN_Pos         (7UL)                     /*!< CFGRGB2YUVEN (Bit 7)                                  */
#define DC_CONFG_CFGRGB2YUVEN_Msk         (0x80UL)                  /*!< CFGRGB2YUVEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDBITYPEBEN_Pos        (6UL)                     /*!< CFGDBITYPEBEN (Bit 6)                                 */
#define DC_CONFG_CFGDBITYPEBEN_Msk        (0x40UL)                  /*!< CFGDBITYPEBEN (Bitfield-Mask: 0x01)                   */
#define DC_CONFG_RSVD0501_Pos             (5UL)                     /*!< RSVD0501 (Bit 5)                                      */
#define DC_CONFG_RSVD0501_Msk             (0x20UL)                  /*!< RSVD0501 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGFORMATTEN_Pos         (4UL)                     /*!< CFGFORMATTEN (Bit 4)                                  */
#define DC_CONFG_CFGFORMATTEN_Msk         (0x10UL)                  /*!< CFGFORMATTEN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGDITHEREN_Pos          (3UL)                     /*!< CFGDITHEREN (Bit 3)                                   */
#define DC_CONFG_CFGDITHEREN_Msk          (0x8UL)                   /*!< CFGDITHEREN (Bitfield-Mask: 0x01)                     */
#define DC_CONFG_RSVD0201_Pos             (2UL)                     /*!< RSVD0201 (Bit 2)                                      */
#define DC_CONFG_RSVD0201_Msk             (0x4UL)                   /*!< RSVD0201 (Bitfield-Mask: 0x01)                        */
#define DC_CONFG_CFGFCURSOREN_Pos         (1UL)                     /*!< CFGFCURSOREN (Bit 1)                                  */
#define DC_CONFG_CFGFCURSOREN_Msk         (0x2UL)                   /*!< CFGFCURSOREN (Bitfield-Mask: 0x01)                    */
#define DC_CONFG_CFGGLBGAMMAEN_Pos        (0UL)                     /*!< CFGGLBGAMMAEN (Bit 0)                                 */
#define DC_CONFG_CFGGLBGAMMAEN_Msk        (0x1UL)                   /*!< CFGGLBGAMMAEN (Bitfield-Mask: 0x01)                   */
/* =========================================================  IDREG  ========================================================= */
#define DC_IDREG_DCID_Pos                 (0UL)                     /*!< DCID (Bit 0)                                          */
#define DC_IDREG_DCID_Msk                 (0xffffffffUL)            /*!< DCID (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  INTERRUPT  ======================================================= */
#define DC_INTERRUPT_INTTRIGGER_Pos       (31UL)                    /*!< INTTRIGGER (Bit 31)                                   */
#define DC_INTERRUPT_INTTRIGGER_Msk       (0x80000000UL)            /*!< INTTRIGGER (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_INTTEEN_Pos          (3UL)                     /*!< INTTEEN (Bit 3)                                       */
#define DC_INTERRUPT_INTTEEN_Msk          (0x8UL)                   /*!< INTTEEN (Bitfield-Mask: 0x01)                         */
#define DC_INTERRUPT_INTMMUERR_Pos        (2UL)                     /*!< INTMMUERR (Bit 2)                                     */
#define DC_INTERRUPT_INTMMUERR_Msk        (0x4UL)                   /*!< INTMMUERR (Bitfield-Mask: 0x01)                       */
#define DC_INTERRUPT_INTHSYNCEN_Pos       (1UL)                     /*!< INTHSYNCEN (Bit 1)                                    */
#define DC_INTERRUPT_INTHSYNCEN_Msk       (0x2UL)                   /*!< INTHSYNCEN (Bitfield-Mask: 0x01)                      */
#define DC_INTERRUPT_INTVSYNCEN_Pos       (0UL)                     /*!< INTVSYNCEN (Bit 0)                                    */
#define DC_INTERRUPT_INTVSYNCEN_Msk       (0x1UL)                   /*!< INTVSYNCEN (Bitfield-Mask: 0x01)                      */
/* ========================================================  STATUS  ========================================================= */
#define DC_STATUS_RSVD19_Pos              (19UL)                    /*!< RSVD19 (Bit 19)                                       */
#define DC_STATUS_RSVD19_Msk              (0xfff80000UL)            /*!< RSVD19 (Bitfield-Mask: 0x1fff)                        */
#define DC_STATUS_GPISTACK_Pos            (18UL)                    /*!< GPISTACK (Bit 18)                                     */
#define DC_STATUS_GPISTACK_Msk            (0x40000UL)               /*!< GPISTACK (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_CRCREADY_Pos            (17UL)                    /*!< CRCREADY (Bit 17)                                     */
#define DC_STATUS_CRCREADY_Msk            (0x20000UL)               /*!< CRCREADY (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_SPIRDWR_Pos             (16UL)                    /*!< SPIRDWR (Bit 16)                                      */
#define DC_STATUS_SPIRDWR_Msk             (0x10000UL)               /*!< SPIRDWR (Bitfield-Mask: 0x01)                         */
#define DC_STATUS_CMDFIFOACK_Pos          (15UL)                    /*!< CMDFIFOACK (Bit 15)                                   */
#define DC_STATUS_CMDFIFOACK_Msk          (0x8000UL)                /*!< CMDFIFOACK (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_DBISPICS_Pos            (14UL)                    /*!< DBISPICS (Bit 14)                                     */
#define DC_STATUS_DBISPICS_Msk            (0x4000UL)                /*!< DBISPICS (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_FRAMEEND_Pos            (13UL)                    /*!< FRAMEEND (Bit 13)                                     */
#define DC_STATUS_FRAMEEND_Msk            (0x2000UL)                /*!< FRAMEEND (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATDBIPENDTRANS_Pos    (12UL)                    /*!< STATDBIPENDTRANS (Bit 12)                             */
#define DC_STATUS_STATDBIPENDTRANS_Msk    (0x1000UL)                /*!< STATDBIPENDTRANS (Bitfield-Mask: 0x01)                */
#define DC_STATUS_STATDBIPENDCOM_Pos      (11UL)                    /*!< STATDBIPENDCOM (Bit 11)                               */
#define DC_STATUS_STATDBIPENDCOM_Msk      (0x800UL)                 /*!< STATDBIPENDCOM (Bitfield-Mask: 0x01)                  */
#define DC_STATUS_STATDBIRGB_Pos          (10UL)                    /*!< STATDBIRGB (Bit 10)                                   */
#define DC_STATUS_STATDBIRGB_Msk          (0x400UL)                 /*!< STATDBIRGB (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_RSVD09_Pos              (9UL)                     /*!< RSVD09 (Bit 9)                                        */
#define DC_STATUS_RSVD09_Msk              (0x200UL)                 /*!< RSVD09 (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATTEAR_Pos            (8UL)                     /*!< STATTEAR (Bit 8)                                      */
#define DC_STATUS_STATTEAR_Msk            (0x100UL)                 /*!< STATTEAR (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATSTICKY_Pos          (7UL)                     /*!< STATSTICKY (Bit 7)                                    */
#define DC_STATUS_STATSTICKY_Msk          (0x80UL)                  /*!< STATSTICKY (Bitfield-Mask: 0x01)                      */
#define DC_STATUS_STATUF_Pos              (6UL)                     /*!< STATUF (Bit 6)                                        */
#define DC_STATUS_STATUF_Msk              (0x40UL)                  /*!< STATUF (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATLAST_Pos            (5UL)                     /*!< STATLAST (Bit 5)                                      */
#define DC_STATUS_STATLAST_Msk            (0x20UL)                  /*!< STATLAST (Bitfield-Mask: 0x01)                        */
#define DC_STATUS_STATCSYNC_Pos           (4UL)                     /*!< STATCSYNC (Bit 4)                                     */
#define DC_STATUS_STATCSYNC_Msk           (0x10UL)                  /*!< STATCSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATVSYNC_Pos           (3UL)                     /*!< STATVSYNC (Bit 3)                                     */
#define DC_STATUS_STATVSYNC_Msk           (0x8UL)                   /*!< STATVSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATHSYNC_Pos           (2UL)                     /*!< STATHSYNC (Bit 2)                                     */
#define DC_STATUS_STATHSYNC_Msk           (0x4UL)                   /*!< STATHSYNC (Bitfield-Mask: 0x01)                       */
#define DC_STATUS_STATDE_Pos              (1UL)                     /*!< STATDE (Bit 1)                                        */
#define DC_STATUS_STATDE_Msk              (0x2UL)                   /*!< STATDE (Bitfield-Mask: 0x01)                          */
#define DC_STATUS_STATNOTBLANK_Pos        (0UL)                     /*!< STATNOTBLANK (Bit 0)                                  */
#define DC_STATUS_STATNOTBLANK_Msk        (0x1UL)                   /*!< STATNOTBLANK (Bitfield-Mask: 0x01)                    */
/* ========================================================  COLMOD  ========================================================= */
#define DC_COLMOD_RSVD30_Pos              (30UL)                    /*!< RSVD30 (Bit 30)                                       */
#define DC_COLMOD_RSVD30_Msk              (0xc0000000UL)            /*!< RSVD30 (Bitfield-Mask: 0x03)                          */
#define DC_COLMOD_JDI_Pos                 (29UL)                    /*!< JDI (Bit 29)                                          */
#define DC_COLMOD_JDI_Msk                 (0x20000000UL)            /*!< JDI (Bitfield-Mask: 0x01)                             */
#define DC_COLMOD_RSVD28_Pos              (28UL)                    /*!< RSVD28 (Bit 28)                                       */
#define DC_COLMOD_RSVD28_Msk              (0x10000000UL)            /*!< RSVD28 (Bitfield-Mask: 0x01)                          */
#define DC_COLMOD_FLIPY_Pos               (27UL)                    /*!< FLIPY (Bit 27)                                        */
#define DC_COLMOD_FLIPY_Msk               (0x8000000UL)             /*!< FLIPY (Bitfield-Mask: 0x01)                           */
#define DC_COLMOD_LAYER3FLIPX_Pos         (26UL)                    /*!< LAYER3FLIPX (Bit 26)                                  */
#define DC_COLMOD_LAYER3FLIPX_Msk         (0x4000000UL)             /*!< LAYER3FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_LAYER2FLIPX_Pos         (25UL)                    /*!< LAYER2FLIPX (Bit 25)                                  */
#define DC_COLMOD_LAYER2FLIPX_Msk         (0x2000000UL)             /*!< LAYER2FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_LAYER1FLIPX_Pos         (24UL)                    /*!< LAYER1FLIPX (Bit 24)                                  */
#define DC_COLMOD_LAYER1FLIPX_Msk         (0x1000000UL)             /*!< LAYER1FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_LAYER0FLIPX_Pos         (23UL)                    /*!< LAYER0FLIPX (Bit 23)                                  */
#define DC_COLMOD_LAYER0FLIPX_Msk         (0x800000UL)              /*!< LAYER0FLIPX (Bitfield-Mask: 0x01)                     */
#define DC_COLMOD_RSVD20_Pos              (20UL)                    /*!< RSVD20 (Bit 20)                                       */
#define DC_COLMOD_RSVD20_Msk              (0x700000UL)              /*!< RSVD20 (Bitfield-Mask: 0x07)                          */
#define DC_COLMOD_DBIBEXTERNAL_Pos        (19UL)                    /*!< DBIBEXTERNAL (Bit 19)                                 */
#define DC_COLMOD_DBIBEXTERNAL_Msk        (0x80000UL)               /*!< DBIBEXTERNAL (Bitfield-Mask: 0x01)                    */
#define DC_COLMOD_TSC6_Pos                (18UL)                    /*!< TSC6 (Bit 18)                                         */
#define DC_COLMOD_TSC6_Msk                (0x40000UL)               /*!< TSC6 (Bitfield-Mask: 0x01)                            */
#define DC_COLMOD_TSC4_Pos                (17UL)                    /*!< TSC4 (Bit 17)                                         */
#define DC_COLMOD_TSC4_Msk                (0x20000UL)               /*!< TSC4 (Bitfield-Mask: 0x01)                            */
#define DC_COLMOD_RSVD0017_Pos            (0UL)                     /*!< RSVD0017 (Bit 0)                                      */
#define DC_COLMOD_RSVD0017_Msk            (0x1ffffUL)               /*!< RSVD0017 (Bitfield-Mask: 0x1ffff)                     */
/* =================================================  LAYER0COLORDECSTARTXY  ================================================= */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTY_Pos (16UL)         /*!< COCLORDECSTARTY (Bit 16)                              */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTY_Msk (0xffff0000UL) /*!< COCLORDECSTARTY (Bitfield-Mask: 0xffff)               */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTX_Pos (0UL)          /*!< COCLORDECSTARTX (Bit 0)                               */
#define DC_LAYER0COLORDECSTARTXY_COCLORDECSTARTX_Msk (0xffffUL)     /*!< COCLORDECSTARTX (Bitfield-Mask: 0xffff)               */
/* ==========================================================  CRC  ========================================================== */
#define DC_CRC_CRCREG_Pos                 (0UL)                     /*!< CRCREG (Bit 0)                                        */
#define DC_CRC_CRCREG_Msk                 (0xffffffffUL)            /*!< CRCREG (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  GLLUT  ========================================================= */
#define DC_GLLUT_RSVD2408_Pos             (24UL)                    /*!< RSVD2408 (Bit 24)                                     */
#define DC_GLLUT_RSVD2408_Msk             (0xff000000UL)            /*!< RSVD2408 (Bitfield-Mask: 0xff)                        */
#define DC_GLLUT_GLLUT0GAMRAMPR_Pos       (16UL)                    /*!< GLLUT0GAMRAMPR (Bit 16)                               */
#define DC_GLLUT_GLLUT0GAMRAMPR_Msk       (0xff0000UL)              /*!< GLLUT0GAMRAMPR (Bitfield-Mask: 0xff)                  */
#define DC_GLLUT_GLLUT0GAMRAMPG_Pos       (8UL)                     /*!< GLLUT0GAMRAMPG (Bit 8)                                */
#define DC_GLLUT_GLLUT0GAMRAMPG_Msk       (0xff00UL)                /*!< GLLUT0GAMRAMPG (Bitfield-Mask: 0xff)                  */
#define DC_GLLUT_GLLUT0GAMRAMPB_Pos       (0UL)                     /*!< GLLUT0GAMRAMPB (Bit 0)                                */
#define DC_GLLUT_GLLUT0GAMRAMPB_Msk       (0xffUL)                  /*!< GLLUT0GAMRAMPB (Bitfield-Mask: 0xff)                  */
/* =========================================================  L0LUT  ========================================================= */
#define DC_L0LUT_L0LUT0GAMRAMPA_Pos       (24UL)                    /*!< L0LUT0GAMRAMPA (Bit 24)                               */
#define DC_L0LUT_L0LUT0GAMRAMPA_Msk       (0xff000000UL)            /*!< L0LUT0GAMRAMPA (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPR_Pos       (16UL)                    /*!< L0LUT0GAMRAMPR (Bit 16)                               */
#define DC_L0LUT_L0LUT0GAMRAMPR_Msk       (0xff0000UL)              /*!< L0LUT0GAMRAMPR (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPG_Pos       (8UL)                     /*!< L0LUT0GAMRAMPG (Bit 8)                                */
#define DC_L0LUT_L0LUT0GAMRAMPG_Msk       (0xff00UL)                /*!< L0LUT0GAMRAMPG (Bitfield-Mask: 0xff)                  */
#define DC_L0LUT_L0LUT0GAMRAMPB_Pos       (0UL)                     /*!< L0LUT0GAMRAMPB (Bit 0)                                */
