AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ==========================================================  RD0  ========================================================== */
#define FPIO_RD0_RD0_Pos                  (0UL)                     /*!< RD0 (Bit 0)                                           */
#define FPIO_RD0_RD0_Msk                  (0xffffffffUL)            /*!< RD0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD1  ========================================================== */
#define FPIO_RD1_RD1_Pos                  (0UL)                     /*!< RD1 (Bit 0)                                           */
#define FPIO_RD1_RD1_Msk                  (0xffffffffUL)            /*!< RD1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD2  ========================================================== */
#define FPIO_RD2_RD2_Pos                  (0UL)                     /*!< RD2 (Bit 0)                                           */
#define FPIO_RD2_RD2_Msk                  (0xffffffffUL)            /*!< RD2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD3  ========================================================== */
#define FPIO_RD3_RD3_Pos                  (0UL)                     /*!< RD3 (Bit 0)                                           */
#define FPIO_RD3_RD3_Msk                  (0xffffffffUL)            /*!< RD3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD4  ========================================================== */
#define FPIO_RD4_RD4_Pos                  (0UL)                     /*!< RD4 (Bit 0)                                           */
#define FPIO_RD4_RD4_Msk                  (0xffffffffUL)            /*!< RD4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD5  ========================================================== */
#define FPIO_RD5_RD5_Pos                  (0UL)                     /*!< RD5 (Bit 0)                                           */
#define FPIO_RD5_RD5_Msk                  (0xffffffffUL)            /*!< RD5 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD6  ========================================================== */
#define FPIO_RD6_RD6_Pos                  (0UL)                     /*!< RD6 (Bit 0)                                           */
#define FPIO_RD6_RD6_Msk                  (0xffffffffUL)            /*!< RD6 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT0  ========================================================== */
#define FPIO_WT0_WT0_Pos                  (0UL)                     /*!< WT0 (Bit 0)                                           */
#define FPIO_WT0_WT0_Msk                  (0xffffffffUL)            /*!< WT0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT1  ========================================================== */
#define FPIO_WT1_WT1_Pos                  (0UL)                     /*!< WT1 (Bit 0)                                           */
#define FPIO_WT1_WT1_Msk                  (0xffffffffUL)            /*!< WT1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT2  ========================================================== */
#define FPIO_WT2_WT2_Pos                  (0UL)                     /*!< WT2 (Bit 0)                                           */
#define FPIO_WT2_WT2_Msk                  (0xffffffffUL)            /*!< WT2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT3  ========================================================== */
#define FPIO_WT3_WT3_Pos                  (0UL)                     /*!< WT3 (Bit 0)                                           */
#define FPIO_WT3_WT3_Msk                  (0xffffffffUL)            /*!< WT3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT4  ========================================================== */
#define FPIO_WT4_WT4_Pos                  (0UL)                     /*!< WT4 (Bit 0)                                           */
#define FPIO_WT4_WT4_Msk                  (0xffffffffUL)            /*!< WT4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT5  ========================================================== */
#define FPIO_WT5_WT5_Pos                  (0UL)                     /*!< WT5 (Bit 0)                                           */
#define FPIO_WT5_WT5_Msk                  (0xffffffffUL)            /*!< WT5 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT6  ========================================================== */
#define FPIO_WT6_WT6_Pos                  (0UL)                     /*!< WT6 (Bit 0)                                           */
#define FPIO_WT6_WT6_Msk                  (0xffffffffUL)            /*!< WT6 (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  WTS0  ========================================================== */
#define FPIO_WTS0_WTS0_Pos                (0UL)                     /*!< WTS0 (Bit 0)                                          */
#define FPIO_WTS0_WTS0_Msk                (0xffffffffUL)            /*!< WTS0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS1  ========================================================== */
#define FPIO_WTS1_WTS1_Pos                (0UL)                     /*!< WTS1 (Bit 0)                                          */
#define FPIO_WTS1_WTS1_Msk                (0xffffffffUL)            /*!< WTS1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS2  ========================================================== */
#define FPIO_WTS2_WTS2_Pos                (0UL)                     /*!< WTS2 (Bit 0)                                          */
#define FPIO_WTS2_WTS2_Msk                (0xffffffffUL)            /*!< WTS2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS3  ========================================================== */
#define FPIO_WTS3_WTS3_Pos                (0UL)                     /*!< WTS3 (Bit 0)                                          */
#define FPIO_WTS3_WTS3_Msk                (0xffffffffUL)            /*!< WTS3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS4  ========================================================== */
#define FPIO_WTS4_WTS4_Pos                (0UL)                     /*!< WTS4 (Bit 0)                                          */
#define FPIO_WTS4_WTS4_Msk                (0xffffffffUL)            /*!< WTS4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS5  ========================================================== */
#define FPIO_WTS5_WTS5_Pos                (0UL)                     /*!< WTS5 (Bit 0)                                          */
#define FPIO_WTS5_WTS5_Msk                (0xffffffffUL)            /*!< WTS5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS6  ========================================================== */
#define FPIO_WTS6_WTS6_Pos                (0UL)                     /*!< WTS6 (Bit 0)                                          */
#define FPIO_WTS6_WTS6_Msk                (0xffffffffUL)            /*!< WTS6 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC0  ========================================================== */
#define FPIO_WTC0_WTC0_Pos                (0UL)                     /*!< WTC0 (Bit 0)                                          */
#define FPIO_WTC0_WTC0_Msk                (0xffffffffUL)            /*!< WTC0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC1  ========================================================== */
#define FPIO_WTC1_WTC1_Pos                (0UL)                     /*!< WTC1 (Bit 0)                                          */
#define FPIO_WTC1_WTC1_Msk                (0xffffffffUL)            /*!< WTC1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC2  ========================================================== */
#define FPIO_WTC2_WTC2_Pos                (0UL)                     /*!< WTC2 (Bit 0)                                          */
#define FPIO_WTC2_WTC2_Msk                (0xffffffffUL)            /*!< WTC2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC3  ========================================================== */
#define FPIO_WTC3_WTC3_Pos                (0UL)                     /*!< WTC3 (Bit 0)                                          */
#define FPIO_WTC3_WTC3_Msk                (0xffffffffUL)            /*!< WTC3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC4  ========================================================== */
#define FPIO_WTC4_WTC4_Pos                (0UL)                     /*!< WTC4 (Bit 0)                                          */
#define FPIO_WTC4_WTC4_Msk                (0xffffffffUL)            /*!< WTC4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC5  ========================================================== */
#define FPIO_WTC5_WTC5_Pos                (0UL)                     /*!< WTC5 (Bit 0)                                          */
#define FPIO_WTC5_WTC5_Msk                (0xffffffffUL)            /*!< WTC5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC6  ========================================================== */
#define FPIO_WTC6_WTC6_Pos                (0UL)                     /*!< WTC6 (Bit 0)                                          */
#define FPIO_WTC6_WTC6_Msk                (0xffffffffUL)            /*!< WTC6 (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  EN0  ========================================================== */
#define FPIO_EN0_EN0_Pos                  (0UL)                     /*!< EN0 (Bit 0)                                           */
#define FPIO_EN0_EN0_Msk                  (0xffffffffUL)            /*!< EN0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN1  ========================================================== */
#define FPIO_EN1_EN1_Pos                  (0UL)                     /*!< EN1 (Bit 0)                                           */
#define FPIO_EN1_EN1_Msk                  (0xffffffffUL)            /*!< EN1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN2  ========================================================== */
#define FPIO_EN2_EN2_Pos                  (0UL)                     /*!< EN2 (Bit 0)                                           */
#define FPIO_EN2_EN2_Msk                  (0xffffffffUL)            /*!< EN2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN3  ========================================================== */
#define FPIO_EN3_EN3_Pos                  (0UL)                     /*!< EN3 (Bit 0)                                           */
#define FPIO_EN3_EN3_Msk                  (0xffffffffUL)            /*!< EN3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN4  ========================================================== */
#define FPIO_EN4_EN4_Pos                  (0UL)                     /*!< EN4 (Bit 0)                                           */
#define FPIO_EN4_EN4_Msk                  (0xffffffffUL)            /*!< EN4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN5  ========================================================== */
#define FPIO_EN5_EN5_Pos                  (0UL)                     /*!< EN5 (Bit 0)                                           */
#define FPIO_EN5_EN5_Msk                  (0xffffffffUL)            /*!< EN5 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN6  ========================================================== */
#define FPIO_EN6_EN6_Pos                  (0UL)                     /*!< EN6 (Bit 0)                                           */
#define FPIO_EN6_EN6_Msk                  (0xffffffffUL)            /*!< EN6 (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  ENS0  ========================================================== */
#define FPIO_ENS0_ENS0_Pos                (0UL)                     /*!< ENS0 (Bit 0)                                          */
#define FPIO_ENS0_ENS0_Msk                (0xffffffffUL)            /*!< ENS0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS1  ========================================================== */
#define FPIO_ENS1_ENS1_Pos                (0UL)                     /*!< ENS1 (Bit 0)                                          */
#define FPIO_ENS1_ENS1_Msk                (0xffffffffUL)            /*!< ENS1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS2  ========================================================== */
#define FPIO_ENS2_ENS2_Pos                (0UL)                     /*!< ENS2 (Bit 0)                                          */
#define FPIO_ENS2_ENS2_Msk                (0xffffffffUL)            /*!< ENS2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS3  ========================================================== */
#define FPIO_ENS3_ENS3_Pos                (0UL)                     /*!< ENS3 (Bit 0)                                          */
#define FPIO_ENS3_ENS3_Msk                (0xffffffffUL)            /*!< ENS3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS4  ========================================================== */
#define FPIO_ENS4_ENS4_Pos                (0UL)                     /*!< ENS4 (Bit 0)                                          */
#define FPIO_ENS4_ENS4_Msk                (0xffffffffUL)            /*!< ENS4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS5  ========================================================== */
#define FPIO_ENS5_ENS5_Pos                (0UL)                     /*!< ENS5 (Bit 0)                                          */
#define FPIO_ENS5_ENS5_Msk                (0xffffffffUL)            /*!< ENS5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENS6  ========================================================== */
#define FPIO_ENS6_ENS6_Pos                (0UL)                     /*!< ENS6 (Bit 0)                                          */
#define FPIO_ENS6_ENS6_Msk                (0xffffffffUL)            /*!< ENS6 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC0  ========================================================== */
#define FPIO_ENC0_ENC0_Pos                (0UL)                     /*!< ENC0 (Bit 0)                                          */
#define FPIO_ENC0_ENC0_Msk                (0xffffffffUL)            /*!< ENC0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC1  ========================================================== */
#define FPIO_ENC1_ENC1_Pos                (0UL)                     /*!< ENC1 (Bit 0)                                          */
#define FPIO_ENC1_ENC1_Msk                (0xffffffffUL)            /*!< ENC1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC2  ========================================================== */
#define FPIO_ENC2_ENC2_Pos                (0UL)                     /*!< ENC2 (Bit 0)                                          */
#define FPIO_ENC2_ENC2_Msk                (0xffffffffUL)            /*!< ENC2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC3  ========================================================== */
#define FPIO_ENC3_ENC3_Pos                (0UL)                     /*!< ENC3 (Bit 0)                                          */
#define FPIO_ENC3_ENC3_Msk                (0xffffffffUL)            /*!< ENC3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC4  ========================================================== */
#define FPIO_ENC4_ENC4_Pos                (0UL)                     /*!< ENC4 (Bit 0)                                          */
#define FPIO_ENC4_ENC4_Msk                (0xffffffffUL)            /*!< ENC4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC5  ========================================================== */
#define FPIO_ENC5_ENC5_Pos                (0UL)                     /*!< ENC5 (Bit 0)                                          */
#define FPIO_ENC5_ENC5_Msk                (0xffffffffUL)            /*!< ENC5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  ENC6  ========================================================== */
#define FPIO_ENC6_ENC6_Pos                (0UL)                     /*!< ENC6 (Bit 0)                                          */
#define FPIO_ENC6_ENC6_Msk                (0xffffffffUL)            /*!< ENC6 (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

