AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_PINCFG154_DS154_Msk          (0xc00UL)                 /*!< DS154 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG154_OUTCFG154_Pos      (8UL)                     /*!< OUTCFG154 (Bit 8)                                     */
#define GPIO_PINCFG154_OUTCFG154_Msk      (0x300UL)                 /*!< OUTCFG154 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG154_IRPTEN154_Pos      (6UL)                     /*!< IRPTEN154 (Bit 6)                                     */
#define GPIO_PINCFG154_IRPTEN154_Msk      (0xc0UL)                  /*!< IRPTEN154 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG154_RDZERO154_Pos      (5UL)                     /*!< RDZERO154 (Bit 5)                                     */
#define GPIO_PINCFG154_RDZERO154_Msk      (0x20UL)                  /*!< RDZERO154 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG154_INPEN154_Pos       (4UL)                     /*!< INPEN154 (Bit 4)                                      */
#define GPIO_PINCFG154_INPEN154_Msk       (0x10UL)                  /*!< INPEN154 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG154_FNCSEL154_Pos      (0UL)                     /*!< FNCSEL154 (Bit 0)                                     */
#define GPIO_PINCFG154_FNCSEL154_Msk      (0xfUL)                   /*!< FNCSEL154 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG155  ======================================================= */
#define GPIO_PINCFG155_FOEN155_Pos        (27UL)                    /*!< FOEN155 (Bit 27)                                      */
#define GPIO_PINCFG155_FOEN155_Msk        (0x8000000UL)             /*!< FOEN155 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG155_FIEN155_Pos        (26UL)                    /*!< FIEN155 (Bit 26)                                      */
#define GPIO_PINCFG155_FIEN155_Msk        (0x4000000UL)             /*!< FIEN155 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG155_NCEPOL155_Pos      (22UL)                    /*!< NCEPOL155 (Bit 22)                                    */
#define GPIO_PINCFG155_NCEPOL155_Msk      (0x400000UL)              /*!< NCEPOL155 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG155_NCESRC155_Pos      (16UL)                    /*!< NCESRC155 (Bit 16)                                    */
#define GPIO_PINCFG155_NCESRC155_Msk      (0x3f0000UL)              /*!< NCESRC155 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG155_PULLCFG155_Pos     (13UL)                    /*!< PULLCFG155 (Bit 13)                                   */
#define GPIO_PINCFG155_PULLCFG155_Msk     (0xe000UL)                /*!< PULLCFG155 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG155_SR155_Pos          (12UL)                    /*!< SR155 (Bit 12)                                        */
#define GPIO_PINCFG155_SR155_Msk          (0x1000UL)                /*!< SR155 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG155_DS155_Pos          (10UL)                    /*!< DS155 (Bit 10)                                        */
#define GPIO_PINCFG155_DS155_Msk          (0xc00UL)                 /*!< DS155 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG155_OUTCFG155_Pos      (8UL)                     /*!< OUTCFG155 (Bit 8)                                     */
#define GPIO_PINCFG155_OUTCFG155_Msk      (0x300UL)                 /*!< OUTCFG155 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG155_IRPTEN155_Pos      (6UL)                     /*!< IRPTEN155 (Bit 6)                                     */
#define GPIO_PINCFG155_IRPTEN155_Msk      (0xc0UL)                  /*!< IRPTEN155 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG155_RDZERO155_Pos      (5UL)                     /*!< RDZERO155 (Bit 5)                                     */
#define GPIO_PINCFG155_RDZERO155_Msk      (0x20UL)                  /*!< RDZERO155 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG155_INPEN155_Pos       (4UL)                     /*!< INPEN155 (Bit 4)                                      */
#define GPIO_PINCFG155_INPEN155_Msk       (0x10UL)                  /*!< INPEN155 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG155_FNCSEL155_Pos      (0UL)                     /*!< FNCSEL155 (Bit 0)                                     */
#define GPIO_PINCFG155_FNCSEL155_Msk      (0xfUL)                   /*!< FNCSEL155 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG156  ======================================================= */
#define GPIO_PINCFG156_FOEN156_Pos        (27UL)                    /*!< FOEN156 (Bit 27)                                      */
#define GPIO_PINCFG156_FOEN156_Msk        (0x8000000UL)             /*!< FOEN156 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG156_FIEN156_Pos        (26UL)                    /*!< FIEN156 (Bit 26)                                      */
#define GPIO_PINCFG156_FIEN156_Msk        (0x4000000UL)             /*!< FIEN156 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG156_NCEPOL156_Pos      (22UL)                    /*!< NCEPOL156 (Bit 22)                                    */
#define GPIO_PINCFG156_NCEPOL156_Msk      (0x400000UL)              /*!< NCEPOL156 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG156_NCESRC156_Pos      (16UL)                    /*!< NCESRC156 (Bit 16)                                    */
#define GPIO_PINCFG156_NCESRC156_Msk      (0x3f0000UL)              /*!< NCESRC156 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG156_PULLCFG156_Pos     (13UL)                    /*!< PULLCFG156 (Bit 13)                                   */
#define GPIO_PINCFG156_PULLCFG156_Msk     (0xe000UL)                /*!< PULLCFG156 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG156_SR156_Pos          (12UL)                    /*!< SR156 (Bit 12)                                        */
#define GPIO_PINCFG156_SR156_Msk          (0x1000UL)                /*!< SR156 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG156_DS156_Pos          (10UL)                    /*!< DS156 (Bit 10)                                        */
#define GPIO_PINCFG156_DS156_Msk          (0xc00UL)                 /*!< DS156 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG156_OUTCFG156_Pos      (8UL)                     /*!< OUTCFG156 (Bit 8)                                     */
#define GPIO_PINCFG156_OUTCFG156_Msk      (0x300UL)                 /*!< OUTCFG156 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG156_IRPTEN156_Pos      (6UL)                     /*!< IRPTEN156 (Bit 6)                                     */
#define GPIO_PINCFG156_IRPTEN156_Msk      (0xc0UL)                  /*!< IRPTEN156 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG156_RDZERO156_Pos      (5UL)                     /*!< RDZERO156 (Bit 5)                                     */
#define GPIO_PINCFG156_RDZERO156_Msk      (0x20UL)                  /*!< RDZERO156 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG156_INPEN156_Pos       (4UL)                     /*!< INPEN156 (Bit 4)                                      */
#define GPIO_PINCFG156_INPEN156_Msk       (0x10UL)                  /*!< INPEN156 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG156_FNCSEL156_Pos      (0UL)                     /*!< FNCSEL156 (Bit 0)                                     */
#define GPIO_PINCFG156_FNCSEL156_Msk      (0xfUL)                   /*!< FNCSEL156 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG157  ======================================================= */
#define GPIO_PINCFG157_FOEN157_Pos        (27UL)                    /*!< FOEN157 (Bit 27)                                      */
#define GPIO_PINCFG157_FOEN157_Msk        (0x8000000UL)             /*!< FOEN157 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG157_FIEN157_Pos        (26UL)                    /*!< FIEN157 (Bit 26)                                      */
#define GPIO_PINCFG157_FIEN157_Msk        (0x4000000UL)             /*!< FIEN157 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG157_NCEPOL157_Pos      (22UL)                    /*!< NCEPOL157 (Bit 22)                                    */
#define GPIO_PINCFG157_NCEPOL157_Msk      (0x400000UL)              /*!< NCEPOL157 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG157_NCESRC157_Pos      (16UL)                    /*!< NCESRC157 (Bit 16)                                    */
#define GPIO_PINCFG157_NCESRC157_Msk      (0x3f0000UL)              /*!< NCESRC157 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG157_PULLCFG157_Pos     (13UL)                    /*!< PULLCFG157 (Bit 13)                                   */
#define GPIO_PINCFG157_PULLCFG157_Msk     (0xe000UL)                /*!< PULLCFG157 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG157_SR157_Pos          (12UL)                    /*!< SR157 (Bit 12)                                        */
#define GPIO_PINCFG157_SR157_Msk          (0x1000UL)                /*!< SR157 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG157_DS157_Pos          (10UL)                    /*!< DS157 (Bit 10)                                        */
#define GPIO_PINCFG157_DS157_Msk          (0xc00UL)                 /*!< DS157 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG157_OUTCFG157_Pos      (8UL)                     /*!< OUTCFG157 (Bit 8)                                     */
#define GPIO_PINCFG157_OUTCFG157_Msk      (0x300UL)                 /*!< OUTCFG157 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG157_IRPTEN157_Pos      (6UL)                     /*!< IRPTEN157 (Bit 6)                                     */
#define GPIO_PINCFG157_IRPTEN157_Msk      (0xc0UL)                  /*!< IRPTEN157 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG157_RDZERO157_Pos      (5UL)                     /*!< RDZERO157 (Bit 5)                                     */
#define GPIO_PINCFG157_RDZERO157_Msk      (0x20UL)                  /*!< RDZERO157 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG157_INPEN157_Pos       (4UL)                     /*!< INPEN157 (Bit 4)                                      */
#define GPIO_PINCFG157_INPEN157_Msk       (0x10UL)                  /*!< INPEN157 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG157_FNCSEL157_Pos      (0UL)                     /*!< FNCSEL157 (Bit 0)                                     */
#define GPIO_PINCFG157_FNCSEL157_Msk      (0xfUL)                   /*!< FNCSEL157 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG158  ======================================================= */
#define GPIO_PINCFG158_FOEN158_Pos        (27UL)                    /*!< FOEN158 (Bit 27)                                      */
#define GPIO_PINCFG158_FOEN158_Msk        (0x8000000UL)             /*!< FOEN158 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG158_FIEN158_Pos        (26UL)                    /*!< FIEN158 (Bit 26)                                      */
#define GPIO_PINCFG158_FIEN158_Msk        (0x4000000UL)             /*!< FIEN158 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG158_NCEPOL158_Pos      (22UL)                    /*!< NCEPOL158 (Bit 22)                                    */
#define GPIO_PINCFG158_NCEPOL158_Msk      (0x400000UL)              /*!< NCEPOL158 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG158_NCESRC158_Pos      (16UL)                    /*!< NCESRC158 (Bit 16)                                    */
#define GPIO_PINCFG158_NCESRC158_Msk      (0x3f0000UL)              /*!< NCESRC158 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG158_PULLCFG158_Pos     (13UL)                    /*!< PULLCFG158 (Bit 13)                                   */
#define GPIO_PINCFG158_PULLCFG158_Msk     (0xe000UL)                /*!< PULLCFG158 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG158_SR158_Pos          (12UL)                    /*!< SR158 (Bit 12)                                        */
#define GPIO_PINCFG158_SR158_Msk          (0x1000UL)                /*!< SR158 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG158_DS158_Pos          (10UL)                    /*!< DS158 (Bit 10)                                        */
#define GPIO_PINCFG158_DS158_Msk          (0xc00UL)                 /*!< DS158 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG158_OUTCFG158_Pos      (8UL)                     /*!< OUTCFG158 (Bit 8)                                     */
#define GPIO_PINCFG158_OUTCFG158_Msk      (0x300UL)                 /*!< OUTCFG158 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG158_IRPTEN158_Pos      (6UL)                     /*!< IRPTEN158 (Bit 6)                                     */
#define GPIO_PINCFG158_IRPTEN158_Msk      (0xc0UL)                  /*!< IRPTEN158 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG158_RDZERO158_Pos      (5UL)                     /*!< RDZERO158 (Bit 5)                                     */
#define GPIO_PINCFG158_RDZERO158_Msk      (0x20UL)                  /*!< RDZERO158 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG158_INPEN158_Pos       (4UL)                     /*!< INPEN158 (Bit 4)                                      */
#define GPIO_PINCFG158_INPEN158_Msk       (0x10UL)                  /*!< INPEN158 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG158_FNCSEL158_Pos      (0UL)                     /*!< FNCSEL158 (Bit 0)                                     */
#define GPIO_PINCFG158_FNCSEL158_Msk      (0xfUL)                   /*!< FNCSEL158 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG159  ======================================================= */
#define GPIO_PINCFG159_FOEN159_Pos        (27UL)                    /*!< FOEN159 (Bit 27)                                      */
#define GPIO_PINCFG159_FOEN159_Msk        (0x8000000UL)             /*!< FOEN159 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG159_FIEN159_Pos        (26UL)                    /*!< FIEN159 (Bit 26)                                      */
#define GPIO_PINCFG159_FIEN159_Msk        (0x4000000UL)             /*!< FIEN159 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG159_NCEPOL159_Pos      (22UL)                    /*!< NCEPOL159 (Bit 22)                                    */
#define GPIO_PINCFG159_NCEPOL159_Msk      (0x400000UL)              /*!< NCEPOL159 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG159_NCESRC159_Pos      (16UL)                    /*!< NCESRC159 (Bit 16)                                    */
#define GPIO_PINCFG159_NCESRC159_Msk      (0x3f0000UL)              /*!< NCESRC159 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG159_PULLCFG159_Pos     (13UL)                    /*!< PULLCFG159 (Bit 13)                                   */
#define GPIO_PINCFG159_PULLCFG159_Msk     (0xe000UL)                /*!< PULLCFG159 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG159_SR159_Pos          (12UL)                    /*!< SR159 (Bit 12)                                        */
#define GPIO_PINCFG159_SR159_Msk          (0x1000UL)                /*!< SR159 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG159_DS159_Pos          (10UL)                    /*!< DS159 (Bit 10)                                        */
#define GPIO_PINCFG159_DS159_Msk          (0xc00UL)                 /*!< DS159 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG159_OUTCFG159_Pos      (8UL)                     /*!< OUTCFG159 (Bit 8)                                     */
#define GPIO_PINCFG159_OUTCFG159_Msk      (0x300UL)                 /*!< OUTCFG159 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG159_IRPTEN159_Pos      (6UL)                     /*!< IRPTEN159 (Bit 6)                                     */
#define GPIO_PINCFG159_IRPTEN159_Msk      (0xc0UL)                  /*!< IRPTEN159 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG159_RDZERO159_Pos      (5UL)                     /*!< RDZERO159 (Bit 5)                                     */
#define GPIO_PINCFG159_RDZERO159_Msk      (0x20UL)                  /*!< RDZERO159 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG159_INPEN159_Pos       (4UL)                     /*!< INPEN159 (Bit 4)                                      */
#define GPIO_PINCFG159_INPEN159_Msk       (0x10UL)                  /*!< INPEN159 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG159_FNCSEL159_Pos      (0UL)                     /*!< FNCSEL159 (Bit 0)                                     */
#define GPIO_PINCFG159_FNCSEL159_Msk      (0xfUL)                   /*!< FNCSEL159 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG160  ======================================================= */
#define GPIO_PINCFG160_FOEN160_Pos        (27UL)                    /*!< FOEN160 (Bit 27)                                      */
#define GPIO_PINCFG160_FOEN160_Msk        (0x8000000UL)             /*!< FOEN160 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG160_FIEN160_Pos        (26UL)                    /*!< FIEN160 (Bit 26)                                      */
#define GPIO_PINCFG160_FIEN160_Msk        (0x4000000UL)             /*!< FIEN160 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG160_NCEPOL160_Pos      (22UL)                    /*!< NCEPOL160 (Bit 22)                                    */
#define GPIO_PINCFG160_NCEPOL160_Msk      (0x400000UL)              /*!< NCEPOL160 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG160_NCESRC160_Pos      (16UL)                    /*!< NCESRC160 (Bit 16)                                    */
#define GPIO_PINCFG160_NCESRC160_Msk      (0x3f0000UL)              /*!< NCESRC160 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG160_PULLCFG160_Pos     (13UL)                    /*!< PULLCFG160 (Bit 13)                                   */
#define GPIO_PINCFG160_PULLCFG160_Msk     (0xe000UL)                /*!< PULLCFG160 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG160_SR160_Pos          (12UL)                    /*!< SR160 (Bit 12)                                        */
#define GPIO_PINCFG160_SR160_Msk          (0x1000UL)                /*!< SR160 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG160_DS160_Pos          (10UL)                    /*!< DS160 (Bit 10)                                        */
#define GPIO_PINCFG160_DS160_Msk          (0xc00UL)                 /*!< DS160 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG160_OUTCFG160_Pos      (8UL)                     /*!< OUTCFG160 (Bit 8)                                     */
#define GPIO_PINCFG160_OUTCFG160_Msk      (0x300UL)                 /*!< OUTCFG160 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG160_IRPTEN160_Pos      (6UL)                     /*!< IRPTEN160 (Bit 6)                                     */
#define GPIO_PINCFG160_IRPTEN160_Msk      (0xc0UL)                  /*!< IRPTEN160 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG160_RDZERO160_Pos      (5UL)                     /*!< RDZERO160 (Bit 5)                                     */
#define GPIO_PINCFG160_RDZERO160_Msk      (0x20UL)                  /*!< RDZERO160 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG160_INPEN160_Pos       (4UL)                     /*!< INPEN160 (Bit 4)                                      */
#define GPIO_PINCFG160_INPEN160_Msk       (0x10UL)                  /*!< INPEN160 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG160_FNCSEL160_Pos      (0UL)                     /*!< FNCSEL160 (Bit 0)                                     */
#define GPIO_PINCFG160_FNCSEL160_Msk      (0xfUL)                   /*!< FNCSEL160 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG161  ======================================================= */
#define GPIO_PINCFG161_FOEN161_Pos        (27UL)                    /*!< FOEN161 (Bit 27)                                      */
#define GPIO_PINCFG161_FOEN161_Msk        (0x8000000UL)             /*!< FOEN161 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG161_FIEN161_Pos        (26UL)                    /*!< FIEN161 (Bit 26)                                      */
#define GPIO_PINCFG161_FIEN161_Msk        (0x4000000UL)             /*!< FIEN161 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG161_NCEPOL161_Pos      (22UL)                    /*!< NCEPOL161 (Bit 22)                                    */
#define GPIO_PINCFG161_NCEPOL161_Msk      (0x400000UL)              /*!< NCEPOL161 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG161_NCESRC161_Pos      (16UL)                    /*!< NCESRC161 (Bit 16)                                    */
#define GPIO_PINCFG161_NCESRC161_Msk      (0x3f0000UL)              /*!< NCESRC161 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG161_PULLCFG161_Pos     (13UL)                    /*!< PULLCFG161 (Bit 13)                                   */
#define GPIO_PINCFG161_PULLCFG161_Msk     (0xe000UL)                /*!< PULLCFG161 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG161_SR161_Pos          (12UL)                    /*!< SR161 (Bit 12)                                        */
#define GPIO_PINCFG161_SR161_Msk          (0x1000UL)                /*!< SR161 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG161_DS161_Pos          (10UL)                    /*!< DS161 (Bit 10)                                        */
#define GPIO_PINCFG161_DS161_Msk          (0xc00UL)                 /*!< DS161 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG161_OUTCFG161_Pos      (8UL)                     /*!< OUTCFG161 (Bit 8)                                     */
#define GPIO_PINCFG161_OUTCFG161_Msk      (0x300UL)                 /*!< OUTCFG161 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG161_IRPTEN161_Pos      (6UL)                     /*!< IRPTEN161 (Bit 6)                                     */
#define GPIO_PINCFG161_IRPTEN161_Msk      (0xc0UL)                  /*!< IRPTEN161 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG161_RDZERO161_Pos      (5UL)                     /*!< RDZERO161 (Bit 5)                                     */
#define GPIO_PINCFG161_RDZERO161_Msk      (0x20UL)                  /*!< RDZERO161 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG161_INPEN161_Pos       (4UL)                     /*!< INPEN161 (Bit 4)                                      */
#define GPIO_PINCFG161_INPEN161_Msk       (0x10UL)                  /*!< INPEN161 (Bitfield-Mask: 0x01)                        */
