AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_PINCFG176_OUTCFG176_Msk      (0x300UL)                 /*!< OUTCFG176 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG176_IRPTEN176_Pos      (6UL)                     /*!< IRPTEN176 (Bit 6)                                     */
#define GPIO_PINCFG176_IRPTEN176_Msk      (0xc0UL)                  /*!< IRPTEN176 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG176_RDZERO176_Pos      (5UL)                     /*!< RDZERO176 (Bit 5)                                     */
#define GPIO_PINCFG176_RDZERO176_Msk      (0x20UL)                  /*!< RDZERO176 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG176_INPEN176_Pos       (4UL)                     /*!< INPEN176 (Bit 4)                                      */
#define GPIO_PINCFG176_INPEN176_Msk       (0x10UL)                  /*!< INPEN176 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG176_FNCSEL176_Pos      (0UL)                     /*!< FNCSEL176 (Bit 0)                                     */
#define GPIO_PINCFG176_FNCSEL176_Msk      (0xfUL)                   /*!< FNCSEL176 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG177  ======================================================= */
#define GPIO_PINCFG177_FOEN177_Pos        (27UL)                    /*!< FOEN177 (Bit 27)                                      */
#define GPIO_PINCFG177_FOEN177_Msk        (0x8000000UL)             /*!< FOEN177 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG177_FIEN177_Pos        (26UL)                    /*!< FIEN177 (Bit 26)                                      */
#define GPIO_PINCFG177_FIEN177_Msk        (0x4000000UL)             /*!< FIEN177 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG177_NCEPOL177_Pos      (22UL)                    /*!< NCEPOL177 (Bit 22)                                    */
#define GPIO_PINCFG177_NCEPOL177_Msk      (0x400000UL)              /*!< NCEPOL177 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG177_NCESRC177_Pos      (16UL)                    /*!< NCESRC177 (Bit 16)                                    */
#define GPIO_PINCFG177_NCESRC177_Msk      (0x3f0000UL)              /*!< NCESRC177 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG177_PULLCFG177_Pos     (13UL)                    /*!< PULLCFG177 (Bit 13)                                   */
#define GPIO_PINCFG177_PULLCFG177_Msk     (0xe000UL)                /*!< PULLCFG177 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG177_SR177_Pos          (12UL)                    /*!< SR177 (Bit 12)                                        */
#define GPIO_PINCFG177_SR177_Msk          (0x1000UL)                /*!< SR177 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG177_DS177_Pos          (10UL)                    /*!< DS177 (Bit 10)                                        */
#define GPIO_PINCFG177_DS177_Msk          (0xc00UL)                 /*!< DS177 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG177_OUTCFG177_Pos      (8UL)                     /*!< OUTCFG177 (Bit 8)                                     */
#define GPIO_PINCFG177_OUTCFG177_Msk      (0x300UL)                 /*!< OUTCFG177 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG177_IRPTEN177_Pos      (6UL)                     /*!< IRPTEN177 (Bit 6)                                     */
#define GPIO_PINCFG177_IRPTEN177_Msk      (0xc0UL)                  /*!< IRPTEN177 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG177_RDZERO177_Pos      (5UL)                     /*!< RDZERO177 (Bit 5)                                     */
#define GPIO_PINCFG177_RDZERO177_Msk      (0x20UL)                  /*!< RDZERO177 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG177_INPEN177_Pos       (4UL)                     /*!< INPEN177 (Bit 4)                                      */
#define GPIO_PINCFG177_INPEN177_Msk       (0x10UL)                  /*!< INPEN177 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG177_FNCSEL177_Pos      (0UL)                     /*!< FNCSEL177 (Bit 0)                                     */
#define GPIO_PINCFG177_FNCSEL177_Msk      (0xfUL)                   /*!< FNCSEL177 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG178  ======================================================= */
#define GPIO_PINCFG178_FOEN178_Pos        (27UL)                    /*!< FOEN178 (Bit 27)                                      */
#define GPIO_PINCFG178_FOEN178_Msk        (0x8000000UL)             /*!< FOEN178 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG178_FIEN178_Pos        (26UL)                    /*!< FIEN178 (Bit 26)                                      */
#define GPIO_PINCFG178_FIEN178_Msk        (0x4000000UL)             /*!< FIEN178 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG178_NCEPOL178_Pos      (22UL)                    /*!< NCEPOL178 (Bit 22)                                    */
#define GPIO_PINCFG178_NCEPOL178_Msk      (0x400000UL)              /*!< NCEPOL178 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG178_NCESRC178_Pos      (16UL)                    /*!< NCESRC178 (Bit 16)                                    */
#define GPIO_PINCFG178_NCESRC178_Msk      (0x3f0000UL)              /*!< NCESRC178 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG178_PULLCFG178_Pos     (13UL)                    /*!< PULLCFG178 (Bit 13)                                   */
#define GPIO_PINCFG178_PULLCFG178_Msk     (0xe000UL)                /*!< PULLCFG178 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG178_SR178_Pos          (12UL)                    /*!< SR178 (Bit 12)                                        */
#define GPIO_PINCFG178_SR178_Msk          (0x1000UL)                /*!< SR178 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG178_DS178_Pos          (10UL)                    /*!< DS178 (Bit 10)                                        */
#define GPIO_PINCFG178_DS178_Msk          (0xc00UL)                 /*!< DS178 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG178_OUTCFG178_Pos      (8UL)                     /*!< OUTCFG178 (Bit 8)                                     */
#define GPIO_PINCFG178_OUTCFG178_Msk      (0x300UL)                 /*!< OUTCFG178 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG178_IRPTEN178_Pos      (6UL)                     /*!< IRPTEN178 (Bit 6)                                     */
#define GPIO_PINCFG178_IRPTEN178_Msk      (0xc0UL)                  /*!< IRPTEN178 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG178_RDZERO178_Pos      (5UL)                     /*!< RDZERO178 (Bit 5)                                     */
#define GPIO_PINCFG178_RDZERO178_Msk      (0x20UL)                  /*!< RDZERO178 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG178_INPEN178_Pos       (4UL)                     /*!< INPEN178 (Bit 4)                                      */
#define GPIO_PINCFG178_INPEN178_Msk       (0x10UL)                  /*!< INPEN178 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG178_FNCSEL178_Pos      (0UL)                     /*!< FNCSEL178 (Bit 0)                                     */
#define GPIO_PINCFG178_FNCSEL178_Msk      (0xfUL)                   /*!< FNCSEL178 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG179  ======================================================= */
#define GPIO_PINCFG179_FOEN179_Pos        (27UL)                    /*!< FOEN179 (Bit 27)                                      */
#define GPIO_PINCFG179_FOEN179_Msk        (0x8000000UL)             /*!< FOEN179 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG179_FIEN179_Pos        (26UL)                    /*!< FIEN179 (Bit 26)                                      */
#define GPIO_PINCFG179_FIEN179_Msk        (0x4000000UL)             /*!< FIEN179 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG179_NCEPOL179_Pos      (22UL)                    /*!< NCEPOL179 (Bit 22)                                    */
#define GPIO_PINCFG179_NCEPOL179_Msk      (0x400000UL)              /*!< NCEPOL179 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG179_NCESRC179_Pos      (16UL)                    /*!< NCESRC179 (Bit 16)                                    */
#define GPIO_PINCFG179_NCESRC179_Msk      (0x3f0000UL)              /*!< NCESRC179 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG179_PULLCFG179_Pos     (13UL)                    /*!< PULLCFG179 (Bit 13)                                   */
#define GPIO_PINCFG179_PULLCFG179_Msk     (0xe000UL)                /*!< PULLCFG179 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG179_SR179_Pos          (12UL)                    /*!< SR179 (Bit 12)                                        */
#define GPIO_PINCFG179_SR179_Msk          (0x1000UL)                /*!< SR179 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG179_DS179_Pos          (10UL)                    /*!< DS179 (Bit 10)                                        */
#define GPIO_PINCFG179_DS179_Msk          (0xc00UL)                 /*!< DS179 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG179_OUTCFG179_Pos      (8UL)                     /*!< OUTCFG179 (Bit 8)                                     */
#define GPIO_PINCFG179_OUTCFG179_Msk      (0x300UL)                 /*!< OUTCFG179 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG179_IRPTEN179_Pos      (6UL)                     /*!< IRPTEN179 (Bit 6)                                     */
#define GPIO_PINCFG179_IRPTEN179_Msk      (0xc0UL)                  /*!< IRPTEN179 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG179_RDZERO179_Pos      (5UL)                     /*!< RDZERO179 (Bit 5)                                     */
#define GPIO_PINCFG179_RDZERO179_Msk      (0x20UL)                  /*!< RDZERO179 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG179_INPEN179_Pos       (4UL)                     /*!< INPEN179 (Bit 4)                                      */
#define GPIO_PINCFG179_INPEN179_Msk       (0x10UL)                  /*!< INPEN179 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG179_FNCSEL179_Pos      (0UL)                     /*!< FNCSEL179 (Bit 0)                                     */
#define GPIO_PINCFG179_FNCSEL179_Msk      (0xfUL)                   /*!< FNCSEL179 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG180  ======================================================= */
#define GPIO_PINCFG180_FOEN180_Pos        (27UL)                    /*!< FOEN180 (Bit 27)                                      */
#define GPIO_PINCFG180_FOEN180_Msk        (0x8000000UL)             /*!< FOEN180 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG180_FIEN180_Pos        (26UL)                    /*!< FIEN180 (Bit 26)                                      */
#define GPIO_PINCFG180_FIEN180_Msk        (0x4000000UL)             /*!< FIEN180 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG180_NCEPOL180_Pos      (22UL)                    /*!< NCEPOL180 (Bit 22)                                    */
#define GPIO_PINCFG180_NCEPOL180_Msk      (0x400000UL)              /*!< NCEPOL180 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG180_NCESRC180_Pos      (16UL)                    /*!< NCESRC180 (Bit 16)                                    */
#define GPIO_PINCFG180_NCESRC180_Msk      (0x3f0000UL)              /*!< NCESRC180 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG180_PULLCFG180_Pos     (13UL)                    /*!< PULLCFG180 (Bit 13)                                   */
#define GPIO_PINCFG180_PULLCFG180_Msk     (0xe000UL)                /*!< PULLCFG180 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG180_SR180_Pos          (12UL)                    /*!< SR180 (Bit 12)                                        */
#define GPIO_PINCFG180_SR180_Msk          (0x1000UL)                /*!< SR180 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG180_DS180_Pos          (10UL)                    /*!< DS180 (Bit 10)                                        */
#define GPIO_PINCFG180_DS180_Msk          (0xc00UL)                 /*!< DS180 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG180_OUTCFG180_Pos      (8UL)                     /*!< OUTCFG180 (Bit 8)                                     */
#define GPIO_PINCFG180_OUTCFG180_Msk      (0x300UL)                 /*!< OUTCFG180 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG180_IRPTEN180_Pos      (6UL)                     /*!< IRPTEN180 (Bit 6)                                     */
#define GPIO_PINCFG180_IRPTEN180_Msk      (0xc0UL)                  /*!< IRPTEN180 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG180_RDZERO180_Pos      (5UL)                     /*!< RDZERO180 (Bit 5)                                     */
#define GPIO_PINCFG180_RDZERO180_Msk      (0x20UL)                  /*!< RDZERO180 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG180_INPEN180_Pos       (4UL)                     /*!< INPEN180 (Bit 4)                                      */
#define GPIO_PINCFG180_INPEN180_Msk       (0x10UL)                  /*!< INPEN180 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG180_FNCSEL180_Pos      (0UL)                     /*!< FNCSEL180 (Bit 0)                                     */
#define GPIO_PINCFG180_FNCSEL180_Msk      (0xfUL)                   /*!< FNCSEL180 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG181  ======================================================= */
#define GPIO_PINCFG181_FOEN181_Pos        (27UL)                    /*!< FOEN181 (Bit 27)                                      */
#define GPIO_PINCFG181_FOEN181_Msk        (0x8000000UL)             /*!< FOEN181 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG181_FIEN181_Pos        (26UL)                    /*!< FIEN181 (Bit 26)                                      */
#define GPIO_PINCFG181_FIEN181_Msk        (0x4000000UL)             /*!< FIEN181 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG181_NCEPOL181_Pos      (22UL)                    /*!< NCEPOL181 (Bit 22)                                    */
#define GPIO_PINCFG181_NCEPOL181_Msk      (0x400000UL)              /*!< NCEPOL181 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG181_NCESRC181_Pos      (16UL)                    /*!< NCESRC181 (Bit 16)                                    */
#define GPIO_PINCFG181_NCESRC181_Msk      (0x3f0000UL)              /*!< NCESRC181 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG181_PULLCFG181_Pos     (13UL)                    /*!< PULLCFG181 (Bit 13)                                   */
#define GPIO_PINCFG181_PULLCFG181_Msk     (0xe000UL)                /*!< PULLCFG181 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG181_SR181_Pos          (12UL)                    /*!< SR181 (Bit 12)                                        */
#define GPIO_PINCFG181_SR181_Msk          (0x1000UL)                /*!< SR181 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG181_DS181_Pos          (10UL)                    /*!< DS181 (Bit 10)                                        */
#define GPIO_PINCFG181_DS181_Msk          (0xc00UL)                 /*!< DS181 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG181_OUTCFG181_Pos      (8UL)                     /*!< OUTCFG181 (Bit 8)                                     */
#define GPIO_PINCFG181_OUTCFG181_Msk      (0x300UL)                 /*!< OUTCFG181 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG181_IRPTEN181_Pos      (6UL)                     /*!< IRPTEN181 (Bit 6)                                     */
#define GPIO_PINCFG181_IRPTEN181_Msk      (0xc0UL)                  /*!< IRPTEN181 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG181_RDZERO181_Pos      (5UL)                     /*!< RDZERO181 (Bit 5)                                     */
#define GPIO_PINCFG181_RDZERO181_Msk      (0x20UL)                  /*!< RDZERO181 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG181_INPEN181_Pos       (4UL)                     /*!< INPEN181 (Bit 4)                                      */
#define GPIO_PINCFG181_INPEN181_Msk       (0x10UL)                  /*!< INPEN181 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG181_FNCSEL181_Pos      (0UL)                     /*!< FNCSEL181 (Bit 0)                                     */
#define GPIO_PINCFG181_FNCSEL181_Msk      (0xfUL)                   /*!< FNCSEL181 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG182  ======================================================= */
#define GPIO_PINCFG182_FOEN182_Pos        (27UL)                    /*!< FOEN182 (Bit 27)                                      */
#define GPIO_PINCFG182_FOEN182_Msk        (0x8000000UL)             /*!< FOEN182 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG182_FIEN182_Pos        (26UL)                    /*!< FIEN182 (Bit 26)                                      */
#define GPIO_PINCFG182_FIEN182_Msk        (0x4000000UL)             /*!< FIEN182 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG182_NCEPOL182_Pos      (22UL)                    /*!< NCEPOL182 (Bit 22)                                    */
#define GPIO_PINCFG182_NCEPOL182_Msk      (0x400000UL)              /*!< NCEPOL182 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG182_NCESRC182_Pos      (16UL)                    /*!< NCESRC182 (Bit 16)                                    */
#define GPIO_PINCFG182_NCESRC182_Msk      (0x3f0000UL)              /*!< NCESRC182 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG182_PULLCFG182_Pos     (13UL)                    /*!< PULLCFG182 (Bit 13)                                   */
#define GPIO_PINCFG182_PULLCFG182_Msk     (0xe000UL)                /*!< PULLCFG182 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG182_SR182_Pos          (12UL)                    /*!< SR182 (Bit 12)                                        */
#define GPIO_PINCFG182_SR182_Msk          (0x1000UL)                /*!< SR182 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG182_DS182_Pos          (10UL)                    /*!< DS182 (Bit 10)                                        */
#define GPIO_PINCFG182_DS182_Msk          (0xc00UL)                 /*!< DS182 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG182_OUTCFG182_Pos      (8UL)                     /*!< OUTCFG182 (Bit 8)                                     */
#define GPIO_PINCFG182_OUTCFG182_Msk      (0x300UL)                 /*!< OUTCFG182 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG182_IRPTEN182_Pos      (6UL)                     /*!< IRPTEN182 (Bit 6)                                     */
#define GPIO_PINCFG182_IRPTEN182_Msk      (0xc0UL)                  /*!< IRPTEN182 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG182_RDZERO182_Pos      (5UL)                     /*!< RDZERO182 (Bit 5)                                     */
#define GPIO_PINCFG182_RDZERO182_Msk      (0x20UL)                  /*!< RDZERO182 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG182_INPEN182_Pos       (4UL)                     /*!< INPEN182 (Bit 4)                                      */
#define GPIO_PINCFG182_INPEN182_Msk       (0x10UL)                  /*!< INPEN182 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG182_FNCSEL182_Pos      (0UL)                     /*!< FNCSEL182 (Bit 0)                                     */
#define GPIO_PINCFG182_FNCSEL182_Msk      (0xfUL)                   /*!< FNCSEL182 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG183  ======================================================= */
#define GPIO_PINCFG183_FOEN183_Pos        (27UL)                    /*!< FOEN183 (Bit 27)                                      */
#define GPIO_PINCFG183_FOEN183_Msk        (0x8000000UL)             /*!< FOEN183 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG183_FIEN183_Pos        (26UL)                    /*!< FIEN183 (Bit 26)                                      */
#define GPIO_PINCFG183_FIEN183_Msk        (0x4000000UL)             /*!< FIEN183 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG183_NCEPOL183_Pos      (22UL)                    /*!< NCEPOL183 (Bit 22)                                    */
#define GPIO_PINCFG183_NCEPOL183_Msk      (0x400000UL)              /*!< NCEPOL183 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG183_NCESRC183_Pos      (16UL)                    /*!< NCESRC183 (Bit 16)                                    */
#define GPIO_PINCFG183_NCESRC183_Msk      (0x3f0000UL)              /*!< NCESRC183 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG183_PULLCFG183_Pos     (13UL)                    /*!< PULLCFG183 (Bit 13)                                   */
#define GPIO_PINCFG183_PULLCFG183_Msk     (0xe000UL)                /*!< PULLCFG183 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG183_SR183_Pos          (12UL)                    /*!< SR183 (Bit 12)                                        */
#define GPIO_PINCFG183_SR183_Msk          (0x1000UL)                /*!< SR183 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG183_DS183_Pos          (10UL)                    /*!< DS183 (Bit 10)                                        */
#define GPIO_PINCFG183_DS183_Msk          (0xc00UL)                 /*!< DS183 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG183_OUTCFG183_Pos      (8UL)                     /*!< OUTCFG183 (Bit 8)                                     */
#define GPIO_PINCFG183_OUTCFG183_Msk      (0x300UL)                 /*!< OUTCFG183 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG183_IRPTEN183_Pos      (6UL)                     /*!< IRPTEN183 (Bit 6)                                     */
#define GPIO_PINCFG183_IRPTEN183_Msk      (0xc0UL)                  /*!< IRPTEN183 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG183_RDZERO183_Pos      (5UL)                     /*!< RDZERO183 (Bit 5)                                     */
#define GPIO_PINCFG183_RDZERO183_Msk      (0x20UL)                  /*!< RDZERO183 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG183_INPEN183_Pos       (4UL)                     /*!< INPEN183 (Bit 4)                                      */
#define GPIO_PINCFG183_INPEN183_Msk       (0x10UL)                  /*!< INPEN183 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG183_FNCSEL183_Pos      (0UL)                     /*!< FNCSEL183 (Bit 0)                                     */
#define GPIO_PINCFG183_FNCSEL183_Msk      (0xfUL)                   /*!< FNCSEL183 (Bitfield-Mask: 0x0f)                       */
