AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_PINCFG206_FOEN206_Msk        (0x8000000UL)             /*!< FOEN206 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG206_FIEN206_Pos        (26UL)                    /*!< FIEN206 (Bit 26)                                      */
#define GPIO_PINCFG206_FIEN206_Msk        (0x4000000UL)             /*!< FIEN206 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG206_NCEPOL206_Pos      (22UL)                    /*!< NCEPOL206 (Bit 22)                                    */
#define GPIO_PINCFG206_NCEPOL206_Msk      (0x400000UL)              /*!< NCEPOL206 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG206_NCESRC206_Pos      (16UL)                    /*!< NCESRC206 (Bit 16)                                    */
#define GPIO_PINCFG206_NCESRC206_Msk      (0x3f0000UL)              /*!< NCESRC206 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG206_PULLCFG206_Pos     (13UL)                    /*!< PULLCFG206 (Bit 13)                                   */
#define GPIO_PINCFG206_PULLCFG206_Msk     (0xe000UL)                /*!< PULLCFG206 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG206_SR206_Pos          (12UL)                    /*!< SR206 (Bit 12)                                        */
#define GPIO_PINCFG206_SR206_Msk          (0x1000UL)                /*!< SR206 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG206_DS206_Pos          (10UL)                    /*!< DS206 (Bit 10)                                        */
#define GPIO_PINCFG206_DS206_Msk          (0xc00UL)                 /*!< DS206 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG206_OUTCFG206_Pos      (8UL)                     /*!< OUTCFG206 (Bit 8)                                     */
#define GPIO_PINCFG206_OUTCFG206_Msk      (0x300UL)                 /*!< OUTCFG206 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG206_IRPTEN206_Pos      (6UL)                     /*!< IRPTEN206 (Bit 6)                                     */
#define GPIO_PINCFG206_IRPTEN206_Msk      (0xc0UL)                  /*!< IRPTEN206 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG206_RDZERO206_Pos      (5UL)                     /*!< RDZERO206 (Bit 5)                                     */
#define GPIO_PINCFG206_RDZERO206_Msk      (0x20UL)                  /*!< RDZERO206 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG206_INPEN206_Pos       (4UL)                     /*!< INPEN206 (Bit 4)                                      */
#define GPIO_PINCFG206_INPEN206_Msk       (0x10UL)                  /*!< INPEN206 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG206_FNCSEL206_Pos      (0UL)                     /*!< FNCSEL206 (Bit 0)                                     */
#define GPIO_PINCFG206_FNCSEL206_Msk      (0xfUL)                   /*!< FNCSEL206 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG207  ======================================================= */
#define GPIO_PINCFG207_FOEN207_Pos        (27UL)                    /*!< FOEN207 (Bit 27)                                      */
#define GPIO_PINCFG207_FOEN207_Msk        (0x8000000UL)             /*!< FOEN207 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG207_FIEN207_Pos        (26UL)                    /*!< FIEN207 (Bit 26)                                      */
#define GPIO_PINCFG207_FIEN207_Msk        (0x4000000UL)             /*!< FIEN207 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG207_NCEPOL207_Pos      (22UL)                    /*!< NCEPOL207 (Bit 22)                                    */
#define GPIO_PINCFG207_NCEPOL207_Msk      (0x400000UL)              /*!< NCEPOL207 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG207_NCESRC207_Pos      (16UL)                    /*!< NCESRC207 (Bit 16)                                    */
#define GPIO_PINCFG207_NCESRC207_Msk      (0x3f0000UL)              /*!< NCESRC207 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG207_PULLCFG207_Pos     (13UL)                    /*!< PULLCFG207 (Bit 13)                                   */
#define GPIO_PINCFG207_PULLCFG207_Msk     (0xe000UL)                /*!< PULLCFG207 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG207_SR207_Pos          (12UL)                    /*!< SR207 (Bit 12)                                        */
#define GPIO_PINCFG207_SR207_Msk          (0x1000UL)                /*!< SR207 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG207_DS207_Pos          (10UL)                    /*!< DS207 (Bit 10)                                        */
#define GPIO_PINCFG207_DS207_Msk          (0xc00UL)                 /*!< DS207 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG207_OUTCFG207_Pos      (8UL)                     /*!< OUTCFG207 (Bit 8)                                     */
#define GPIO_PINCFG207_OUTCFG207_Msk      (0x300UL)                 /*!< OUTCFG207 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG207_IRPTEN207_Pos      (6UL)                     /*!< IRPTEN207 (Bit 6)                                     */
#define GPIO_PINCFG207_IRPTEN207_Msk      (0xc0UL)                  /*!< IRPTEN207 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG207_RDZERO207_Pos      (5UL)                     /*!< RDZERO207 (Bit 5)                                     */
#define GPIO_PINCFG207_RDZERO207_Msk      (0x20UL)                  /*!< RDZERO207 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG207_INPEN207_Pos       (4UL)                     /*!< INPEN207 (Bit 4)                                      */
#define GPIO_PINCFG207_INPEN207_Msk       (0x10UL)                  /*!< INPEN207 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG207_FNCSEL207_Pos      (0UL)                     /*!< FNCSEL207 (Bit 0)                                     */
#define GPIO_PINCFG207_FNCSEL207_Msk      (0xfUL)                   /*!< FNCSEL207 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG208  ======================================================= */
#define GPIO_PINCFG208_FOEN208_Pos        (27UL)                    /*!< FOEN208 (Bit 27)                                      */
#define GPIO_PINCFG208_FOEN208_Msk        (0x8000000UL)             /*!< FOEN208 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG208_FIEN208_Pos        (26UL)                    /*!< FIEN208 (Bit 26)                                      */
#define GPIO_PINCFG208_FIEN208_Msk        (0x4000000UL)             /*!< FIEN208 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG208_NCEPOL208_Pos      (22UL)                    /*!< NCEPOL208 (Bit 22)                                    */
#define GPIO_PINCFG208_NCEPOL208_Msk      (0x400000UL)              /*!< NCEPOL208 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG208_NCESRC208_Pos      (16UL)                    /*!< NCESRC208 (Bit 16)                                    */
#define GPIO_PINCFG208_NCESRC208_Msk      (0x3f0000UL)              /*!< NCESRC208 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG208_PULLCFG208_Pos     (13UL)                    /*!< PULLCFG208 (Bit 13)                                   */
#define GPIO_PINCFG208_PULLCFG208_Msk     (0xe000UL)                /*!< PULLCFG208 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG208_SR208_Pos          (12UL)                    /*!< SR208 (Bit 12)                                        */
#define GPIO_PINCFG208_SR208_Msk          (0x1000UL)                /*!< SR208 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG208_DS208_Pos          (10UL)                    /*!< DS208 (Bit 10)                                        */
#define GPIO_PINCFG208_DS208_Msk          (0xc00UL)                 /*!< DS208 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG208_OUTCFG208_Pos      (8UL)                     /*!< OUTCFG208 (Bit 8)                                     */
#define GPIO_PINCFG208_OUTCFG208_Msk      (0x300UL)                 /*!< OUTCFG208 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG208_IRPTEN208_Pos      (6UL)                     /*!< IRPTEN208 (Bit 6)                                     */
#define GPIO_PINCFG208_IRPTEN208_Msk      (0xc0UL)                  /*!< IRPTEN208 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG208_RDZERO208_Pos      (5UL)                     /*!< RDZERO208 (Bit 5)                                     */
#define GPIO_PINCFG208_RDZERO208_Msk      (0x20UL)                  /*!< RDZERO208 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG208_INPEN208_Pos       (4UL)                     /*!< INPEN208 (Bit 4)                                      */
#define GPIO_PINCFG208_INPEN208_Msk       (0x10UL)                  /*!< INPEN208 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG208_FNCSEL208_Pos      (0UL)                     /*!< FNCSEL208 (Bit 0)                                     */
#define GPIO_PINCFG208_FNCSEL208_Msk      (0xfUL)                   /*!< FNCSEL208 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG209  ======================================================= */
#define GPIO_PINCFG209_FOEN209_Pos        (27UL)                    /*!< FOEN209 (Bit 27)                                      */
#define GPIO_PINCFG209_FOEN209_Msk        (0x8000000UL)             /*!< FOEN209 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG209_FIEN209_Pos        (26UL)                    /*!< FIEN209 (Bit 26)                                      */
#define GPIO_PINCFG209_FIEN209_Msk        (0x4000000UL)             /*!< FIEN209 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG209_NCEPOL209_Pos      (22UL)                    /*!< NCEPOL209 (Bit 22)                                    */
#define GPIO_PINCFG209_NCEPOL209_Msk      (0x400000UL)              /*!< NCEPOL209 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG209_NCESRC209_Pos      (16UL)                    /*!< NCESRC209 (Bit 16)                                    */
#define GPIO_PINCFG209_NCESRC209_Msk      (0x3f0000UL)              /*!< NCESRC209 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG209_PULLCFG209_Pos     (13UL)                    /*!< PULLCFG209 (Bit 13)                                   */
#define GPIO_PINCFG209_PULLCFG209_Msk     (0xe000UL)                /*!< PULLCFG209 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG209_SR209_Pos          (12UL)                    /*!< SR209 (Bit 12)                                        */
#define GPIO_PINCFG209_SR209_Msk          (0x1000UL)                /*!< SR209 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG209_DS209_Pos          (10UL)                    /*!< DS209 (Bit 10)                                        */
#define GPIO_PINCFG209_DS209_Msk          (0xc00UL)                 /*!< DS209 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG209_OUTCFG209_Pos      (8UL)                     /*!< OUTCFG209 (Bit 8)                                     */
#define GPIO_PINCFG209_OUTCFG209_Msk      (0x300UL)                 /*!< OUTCFG209 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG209_IRPTEN209_Pos      (6UL)                     /*!< IRPTEN209 (Bit 6)                                     */
#define GPIO_PINCFG209_IRPTEN209_Msk      (0xc0UL)                  /*!< IRPTEN209 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG209_RDZERO209_Pos      (5UL)                     /*!< RDZERO209 (Bit 5)                                     */
#define GPIO_PINCFG209_RDZERO209_Msk      (0x20UL)                  /*!< RDZERO209 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG209_INPEN209_Pos       (4UL)                     /*!< INPEN209 (Bit 4)                                      */
#define GPIO_PINCFG209_INPEN209_Msk       (0x10UL)                  /*!< INPEN209 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG209_FNCSEL209_Pos      (0UL)                     /*!< FNCSEL209 (Bit 0)                                     */
#define GPIO_PINCFG209_FNCSEL209_Msk      (0xfUL)                   /*!< FNCSEL209 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG210  ======================================================= */
#define GPIO_PINCFG210_FOEN210_Pos        (27UL)                    /*!< FOEN210 (Bit 27)                                      */
#define GPIO_PINCFG210_FOEN210_Msk        (0x8000000UL)             /*!< FOEN210 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG210_FIEN210_Pos        (26UL)                    /*!< FIEN210 (Bit 26)                                      */
#define GPIO_PINCFG210_FIEN210_Msk        (0x4000000UL)             /*!< FIEN210 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG210_NCEPOL210_Pos      (22UL)                    /*!< NCEPOL210 (Bit 22)                                    */
#define GPIO_PINCFG210_NCEPOL210_Msk      (0x400000UL)              /*!< NCEPOL210 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG210_NCESRC210_Pos      (16UL)                    /*!< NCESRC210 (Bit 16)                                    */
#define GPIO_PINCFG210_NCESRC210_Msk      (0x3f0000UL)              /*!< NCESRC210 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG210_PULLCFG210_Pos     (13UL)                    /*!< PULLCFG210 (Bit 13)                                   */
#define GPIO_PINCFG210_PULLCFG210_Msk     (0xe000UL)                /*!< PULLCFG210 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG210_SR210_Pos          (12UL)                    /*!< SR210 (Bit 12)                                        */
#define GPIO_PINCFG210_SR210_Msk          (0x1000UL)                /*!< SR210 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG210_DS210_Pos          (10UL)                    /*!< DS210 (Bit 10)                                        */
#define GPIO_PINCFG210_DS210_Msk          (0xc00UL)                 /*!< DS210 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG210_OUTCFG210_Pos      (8UL)                     /*!< OUTCFG210 (Bit 8)                                     */
#define GPIO_PINCFG210_OUTCFG210_Msk      (0x300UL)                 /*!< OUTCFG210 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG210_IRPTEN210_Pos      (6UL)                     /*!< IRPTEN210 (Bit 6)                                     */
#define GPIO_PINCFG210_IRPTEN210_Msk      (0xc0UL)                  /*!< IRPTEN210 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG210_RDZERO210_Pos      (5UL)                     /*!< RDZERO210 (Bit 5)                                     */
#define GPIO_PINCFG210_RDZERO210_Msk      (0x20UL)                  /*!< RDZERO210 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG210_INPEN210_Pos       (4UL)                     /*!< INPEN210 (Bit 4)                                      */
#define GPIO_PINCFG210_INPEN210_Msk       (0x10UL)                  /*!< INPEN210 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG210_FNCSEL210_Pos      (0UL)                     /*!< FNCSEL210 (Bit 0)                                     */
#define GPIO_PINCFG210_FNCSEL210_Msk      (0xfUL)                   /*!< FNCSEL210 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG211  ======================================================= */
#define GPIO_PINCFG211_FOEN211_Pos        (27UL)                    /*!< FOEN211 (Bit 27)                                      */
#define GPIO_PINCFG211_FOEN211_Msk        (0x8000000UL)             /*!< FOEN211 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG211_FIEN211_Pos        (26UL)                    /*!< FIEN211 (Bit 26)                                      */
#define GPIO_PINCFG211_FIEN211_Msk        (0x4000000UL)             /*!< FIEN211 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG211_NCEPOL211_Pos      (22UL)                    /*!< NCEPOL211 (Bit 22)                                    */
#define GPIO_PINCFG211_NCEPOL211_Msk      (0x400000UL)              /*!< NCEPOL211 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG211_NCESRC211_Pos      (16UL)                    /*!< NCESRC211 (Bit 16)                                    */
#define GPIO_PINCFG211_NCESRC211_Msk      (0x3f0000UL)              /*!< NCESRC211 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG211_PULLCFG211_Pos     (13UL)                    /*!< PULLCFG211 (Bit 13)                                   */
#define GPIO_PINCFG211_PULLCFG211_Msk     (0xe000UL)                /*!< PULLCFG211 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG211_SR211_Pos          (12UL)                    /*!< SR211 (Bit 12)                                        */
#define GPIO_PINCFG211_SR211_Msk          (0x1000UL)                /*!< SR211 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG211_DS211_Pos          (10UL)                    /*!< DS211 (Bit 10)                                        */
#define GPIO_PINCFG211_DS211_Msk          (0xc00UL)                 /*!< DS211 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG211_OUTCFG211_Pos      (8UL)                     /*!< OUTCFG211 (Bit 8)                                     */
#define GPIO_PINCFG211_OUTCFG211_Msk      (0x300UL)                 /*!< OUTCFG211 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG211_IRPTEN211_Pos      (6UL)                     /*!< IRPTEN211 (Bit 6)                                     */
#define GPIO_PINCFG211_IRPTEN211_Msk      (0xc0UL)                  /*!< IRPTEN211 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG211_RDZERO211_Pos      (5UL)                     /*!< RDZERO211 (Bit 5)                                     */
#define GPIO_PINCFG211_RDZERO211_Msk      (0x20UL)                  /*!< RDZERO211 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG211_INPEN211_Pos       (4UL)                     /*!< INPEN211 (Bit 4)                                      */
#define GPIO_PINCFG211_INPEN211_Msk       (0x10UL)                  /*!< INPEN211 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG211_FNCSEL211_Pos      (0UL)                     /*!< FNCSEL211 (Bit 0)                                     */
#define GPIO_PINCFG211_FNCSEL211_Msk      (0xfUL)                   /*!< FNCSEL211 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG212  ======================================================= */
#define GPIO_PINCFG212_FOEN212_Pos        (27UL)                    /*!< FOEN212 (Bit 27)                                      */
#define GPIO_PINCFG212_FOEN212_Msk        (0x8000000UL)             /*!< FOEN212 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG212_FIEN212_Pos        (26UL)                    /*!< FIEN212 (Bit 26)                                      */
#define GPIO_PINCFG212_FIEN212_Msk        (0x4000000UL)             /*!< FIEN212 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG212_NCEPOL212_Pos      (22UL)                    /*!< NCEPOL212 (Bit 22)                                    */
#define GPIO_PINCFG212_NCEPOL212_Msk      (0x400000UL)              /*!< NCEPOL212 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG212_NCESRC212_Pos      (16UL)                    /*!< NCESRC212 (Bit 16)                                    */
#define GPIO_PINCFG212_NCESRC212_Msk      (0x3f0000UL)              /*!< NCESRC212 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG212_PULLCFG212_Pos     (13UL)                    /*!< PULLCFG212 (Bit 13)                                   */
#define GPIO_PINCFG212_PULLCFG212_Msk     (0xe000UL)                /*!< PULLCFG212 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG212_SR212_Pos          (12UL)                    /*!< SR212 (Bit 12)                                        */
#define GPIO_PINCFG212_SR212_Msk          (0x1000UL)                /*!< SR212 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG212_DS212_Pos          (10UL)                    /*!< DS212 (Bit 10)                                        */
#define GPIO_PINCFG212_DS212_Msk          (0xc00UL)                 /*!< DS212 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG212_OUTCFG212_Pos      (8UL)                     /*!< OUTCFG212 (Bit 8)                                     */
#define GPIO_PINCFG212_OUTCFG212_Msk      (0x300UL)                 /*!< OUTCFG212 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG212_IRPTEN212_Pos      (6UL)                     /*!< IRPTEN212 (Bit 6)                                     */
#define GPIO_PINCFG212_IRPTEN212_Msk      (0xc0UL)                  /*!< IRPTEN212 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG212_RDZERO212_Pos      (5UL)                     /*!< RDZERO212 (Bit 5)                                     */
#define GPIO_PINCFG212_RDZERO212_Msk      (0x20UL)                  /*!< RDZERO212 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG212_INPEN212_Pos       (4UL)                     /*!< INPEN212 (Bit 4)                                      */
#define GPIO_PINCFG212_INPEN212_Msk       (0x10UL)                  /*!< INPEN212 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG212_FNCSEL212_Pos      (0UL)                     /*!< FNCSEL212 (Bit 0)                                     */
#define GPIO_PINCFG212_FNCSEL212_Msk      (0xfUL)                   /*!< FNCSEL212 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG213  ======================================================= */
#define GPIO_PINCFG213_FOEN213_Pos        (27UL)                    /*!< FOEN213 (Bit 27)                                      */
#define GPIO_PINCFG213_FOEN213_Msk        (0x8000000UL)             /*!< FOEN213 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG213_FIEN213_Pos        (26UL)                    /*!< FIEN213 (Bit 26)                                      */
#define GPIO_PINCFG213_FIEN213_Msk        (0x4000000UL)             /*!< FIEN213 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG213_NCEPOL213_Pos      (22UL)                    /*!< NCEPOL213 (Bit 22)                                    */
#define GPIO_PINCFG213_NCEPOL213_Msk      (0x400000UL)              /*!< NCEPOL213 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG213_NCESRC213_Pos      (16UL)                    /*!< NCESRC213 (Bit 16)                                    */
#define GPIO_PINCFG213_NCESRC213_Msk      (0x3f0000UL)              /*!< NCESRC213 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG213_PULLCFG213_Pos     (13UL)                    /*!< PULLCFG213 (Bit 13)                                   */
#define GPIO_PINCFG213_PULLCFG213_Msk     (0xe000UL)                /*!< PULLCFG213 (Bitfield-Mask: 0x07)                      */
