AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_PINCFG213_SR213_Pos          (12UL)                    /*!< SR213 (Bit 12)                                        */
#define GPIO_PINCFG213_SR213_Msk          (0x1000UL)                /*!< SR213 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG213_DS213_Pos          (10UL)                    /*!< DS213 (Bit 10)                                        */
#define GPIO_PINCFG213_DS213_Msk          (0xc00UL)                 /*!< DS213 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG213_OUTCFG213_Pos      (8UL)                     /*!< OUTCFG213 (Bit 8)                                     */
#define GPIO_PINCFG213_OUTCFG213_Msk      (0x300UL)                 /*!< OUTCFG213 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG213_IRPTEN213_Pos      (6UL)                     /*!< IRPTEN213 (Bit 6)                                     */
#define GPIO_PINCFG213_IRPTEN213_Msk      (0xc0UL)                  /*!< IRPTEN213 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG213_RDZERO213_Pos      (5UL)                     /*!< RDZERO213 (Bit 5)                                     */
#define GPIO_PINCFG213_RDZERO213_Msk      (0x20UL)                  /*!< RDZERO213 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG213_INPEN213_Pos       (4UL)                     /*!< INPEN213 (Bit 4)                                      */
#define GPIO_PINCFG213_INPEN213_Msk       (0x10UL)                  /*!< INPEN213 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG213_FNCSEL213_Pos      (0UL)                     /*!< FNCSEL213 (Bit 0)                                     */
#define GPIO_PINCFG213_FNCSEL213_Msk      (0xfUL)                   /*!< FNCSEL213 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG214  ======================================================= */
#define GPIO_PINCFG214_FOEN214_Pos        (27UL)                    /*!< FOEN214 (Bit 27)                                      */
#define GPIO_PINCFG214_FOEN214_Msk        (0x8000000UL)             /*!< FOEN214 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG214_FIEN214_Pos        (26UL)                    /*!< FIEN214 (Bit 26)                                      */
#define GPIO_PINCFG214_FIEN214_Msk        (0x4000000UL)             /*!< FIEN214 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG214_NCEPOL214_Pos      (22UL)                    /*!< NCEPOL214 (Bit 22)                                    */
#define GPIO_PINCFG214_NCEPOL214_Msk      (0x400000UL)              /*!< NCEPOL214 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG214_NCESRC214_Pos      (16UL)                    /*!< NCESRC214 (Bit 16)                                    */
#define GPIO_PINCFG214_NCESRC214_Msk      (0x3f0000UL)              /*!< NCESRC214 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG214_PULLCFG214_Pos     (13UL)                    /*!< PULLCFG214 (Bit 13)                                   */
#define GPIO_PINCFG214_PULLCFG214_Msk     (0xe000UL)                /*!< PULLCFG214 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG214_SR214_Pos          (12UL)                    /*!< SR214 (Bit 12)                                        */
#define GPIO_PINCFG214_SR214_Msk          (0x1000UL)                /*!< SR214 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG214_DS214_Pos          (10UL)                    /*!< DS214 (Bit 10)                                        */
#define GPIO_PINCFG214_DS214_Msk          (0xc00UL)                 /*!< DS214 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG214_OUTCFG214_Pos      (8UL)                     /*!< OUTCFG214 (Bit 8)                                     */
#define GPIO_PINCFG214_OUTCFG214_Msk      (0x300UL)                 /*!< OUTCFG214 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG214_IRPTEN214_Pos      (6UL)                     /*!< IRPTEN214 (Bit 6)                                     */
#define GPIO_PINCFG214_IRPTEN214_Msk      (0xc0UL)                  /*!< IRPTEN214 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG214_RDZERO214_Pos      (5UL)                     /*!< RDZERO214 (Bit 5)                                     */
#define GPIO_PINCFG214_RDZERO214_Msk      (0x20UL)                  /*!< RDZERO214 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG214_INPEN214_Pos       (4UL)                     /*!< INPEN214 (Bit 4)                                      */
#define GPIO_PINCFG214_INPEN214_Msk       (0x10UL)                  /*!< INPEN214 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG214_FNCSEL214_Pos      (0UL)                     /*!< FNCSEL214 (Bit 0)                                     */
#define GPIO_PINCFG214_FNCSEL214_Msk      (0xfUL)                   /*!< FNCSEL214 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG215  ======================================================= */
#define GPIO_PINCFG215_FOEN215_Pos        (27UL)                    /*!< FOEN215 (Bit 27)                                      */
#define GPIO_PINCFG215_FOEN215_Msk        (0x8000000UL)             /*!< FOEN215 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG215_FIEN215_Pos        (26UL)                    /*!< FIEN215 (Bit 26)                                      */
#define GPIO_PINCFG215_FIEN215_Msk        (0x4000000UL)             /*!< FIEN215 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG215_NCEPOL215_Pos      (22UL)                    /*!< NCEPOL215 (Bit 22)                                    */
#define GPIO_PINCFG215_NCEPOL215_Msk      (0x400000UL)              /*!< NCEPOL215 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG215_NCESRC215_Pos      (16UL)                    /*!< NCESRC215 (Bit 16)                                    */
#define GPIO_PINCFG215_NCESRC215_Msk      (0x3f0000UL)              /*!< NCESRC215 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG215_PULLCFG215_Pos     (13UL)                    /*!< PULLCFG215 (Bit 13)                                   */
#define GPIO_PINCFG215_PULLCFG215_Msk     (0xe000UL)                /*!< PULLCFG215 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG215_SR215_Pos          (12UL)                    /*!< SR215 (Bit 12)                                        */
#define GPIO_PINCFG215_SR215_Msk          (0x1000UL)                /*!< SR215 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG215_DS215_Pos          (10UL)                    /*!< DS215 (Bit 10)                                        */
#define GPIO_PINCFG215_DS215_Msk          (0xc00UL)                 /*!< DS215 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG215_OUTCFG215_Pos      (8UL)                     /*!< OUTCFG215 (Bit 8)                                     */
#define GPIO_PINCFG215_OUTCFG215_Msk      (0x300UL)                 /*!< OUTCFG215 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG215_IRPTEN215_Pos      (6UL)                     /*!< IRPTEN215 (Bit 6)                                     */
#define GPIO_PINCFG215_IRPTEN215_Msk      (0xc0UL)                  /*!< IRPTEN215 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG215_RDZERO215_Pos      (5UL)                     /*!< RDZERO215 (Bit 5)                                     */
#define GPIO_PINCFG215_RDZERO215_Msk      (0x20UL)                  /*!< RDZERO215 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG215_INPEN215_Pos       (4UL)                     /*!< INPEN215 (Bit 4)                                      */
#define GPIO_PINCFG215_INPEN215_Msk       (0x10UL)                  /*!< INPEN215 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG215_FNCSEL215_Pos      (0UL)                     /*!< FNCSEL215 (Bit 0)                                     */
#define GPIO_PINCFG215_FNCSEL215_Msk      (0xfUL)                   /*!< FNCSEL215 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG216  ======================================================= */
#define GPIO_PINCFG216_FOEN216_Pos        (27UL)                    /*!< FOEN216 (Bit 27)                                      */
#define GPIO_PINCFG216_FOEN216_Msk        (0x8000000UL)             /*!< FOEN216 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG216_FIEN216_Pos        (26UL)                    /*!< FIEN216 (Bit 26)                                      */
#define GPIO_PINCFG216_FIEN216_Msk        (0x4000000UL)             /*!< FIEN216 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG216_NCEPOL216_Pos      (22UL)                    /*!< NCEPOL216 (Bit 22)                                    */
#define GPIO_PINCFG216_NCEPOL216_Msk      (0x400000UL)              /*!< NCEPOL216 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG216_NCESRC216_Pos      (16UL)                    /*!< NCESRC216 (Bit 16)                                    */
#define GPIO_PINCFG216_NCESRC216_Msk      (0x3f0000UL)              /*!< NCESRC216 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG216_PULLCFG216_Pos     (13UL)                    /*!< PULLCFG216 (Bit 13)                                   */
#define GPIO_PINCFG216_PULLCFG216_Msk     (0xe000UL)                /*!< PULLCFG216 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG216_SR216_Pos          (12UL)                    /*!< SR216 (Bit 12)                                        */
#define GPIO_PINCFG216_SR216_Msk          (0x1000UL)                /*!< SR216 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG216_DS216_Pos          (10UL)                    /*!< DS216 (Bit 10)                                        */
#define GPIO_PINCFG216_DS216_Msk          (0xc00UL)                 /*!< DS216 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG216_OUTCFG216_Pos      (8UL)                     /*!< OUTCFG216 (Bit 8)                                     */
#define GPIO_PINCFG216_OUTCFG216_Msk      (0x300UL)                 /*!< OUTCFG216 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG216_IRPTEN216_Pos      (6UL)                     /*!< IRPTEN216 (Bit 6)                                     */
#define GPIO_PINCFG216_IRPTEN216_Msk      (0xc0UL)                  /*!< IRPTEN216 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG216_RDZERO216_Pos      (5UL)                     /*!< RDZERO216 (Bit 5)                                     */
#define GPIO_PINCFG216_RDZERO216_Msk      (0x20UL)                  /*!< RDZERO216 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG216_INPEN216_Pos       (4UL)                     /*!< INPEN216 (Bit 4)                                      */
#define GPIO_PINCFG216_INPEN216_Msk       (0x10UL)                  /*!< INPEN216 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG216_FNCSEL216_Pos      (0UL)                     /*!< FNCSEL216 (Bit 0)                                     */
#define GPIO_PINCFG216_FNCSEL216_Msk      (0xfUL)                   /*!< FNCSEL216 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG217  ======================================================= */
#define GPIO_PINCFG217_FOEN217_Pos        (27UL)                    /*!< FOEN217 (Bit 27)                                      */
#define GPIO_PINCFG217_FOEN217_Msk        (0x8000000UL)             /*!< FOEN217 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG217_FIEN217_Pos        (26UL)                    /*!< FIEN217 (Bit 26)                                      */
#define GPIO_PINCFG217_FIEN217_Msk        (0x4000000UL)             /*!< FIEN217 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG217_NCEPOL217_Pos      (22UL)                    /*!< NCEPOL217 (Bit 22)                                    */
#define GPIO_PINCFG217_NCEPOL217_Msk      (0x400000UL)              /*!< NCEPOL217 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG217_NCESRC217_Pos      (16UL)                    /*!< NCESRC217 (Bit 16)                                    */
#define GPIO_PINCFG217_NCESRC217_Msk      (0x3f0000UL)              /*!< NCESRC217 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG217_PULLCFG217_Pos     (13UL)                    /*!< PULLCFG217 (Bit 13)                                   */
#define GPIO_PINCFG217_PULLCFG217_Msk     (0xe000UL)                /*!< PULLCFG217 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG217_SR217_Pos          (12UL)                    /*!< SR217 (Bit 12)                                        */
#define GPIO_PINCFG217_SR217_Msk          (0x1000UL)                /*!< SR217 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG217_DS217_Pos          (10UL)                    /*!< DS217 (Bit 10)                                        */
#define GPIO_PINCFG217_DS217_Msk          (0xc00UL)                 /*!< DS217 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG217_OUTCFG217_Pos      (8UL)                     /*!< OUTCFG217 (Bit 8)                                     */
#define GPIO_PINCFG217_OUTCFG217_Msk      (0x300UL)                 /*!< OUTCFG217 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG217_IRPTEN217_Pos      (6UL)                     /*!< IRPTEN217 (Bit 6)                                     */
#define GPIO_PINCFG217_IRPTEN217_Msk      (0xc0UL)                  /*!< IRPTEN217 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG217_RDZERO217_Pos      (5UL)                     /*!< RDZERO217 (Bit 5)                                     */
#define GPIO_PINCFG217_RDZERO217_Msk      (0x20UL)                  /*!< RDZERO217 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG217_INPEN217_Pos       (4UL)                     /*!< INPEN217 (Bit 4)                                      */
#define GPIO_PINCFG217_INPEN217_Msk       (0x10UL)                  /*!< INPEN217 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG217_FNCSEL217_Pos      (0UL)                     /*!< FNCSEL217 (Bit 0)                                     */
#define GPIO_PINCFG217_FNCSEL217_Msk      (0xfUL)                   /*!< FNCSEL217 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG218  ======================================================= */
#define GPIO_PINCFG218_FOEN218_Pos        (27UL)                    /*!< FOEN218 (Bit 27)                                      */
#define GPIO_PINCFG218_FOEN218_Msk        (0x8000000UL)             /*!< FOEN218 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG218_FIEN218_Pos        (26UL)                    /*!< FIEN218 (Bit 26)                                      */
#define GPIO_PINCFG218_FIEN218_Msk        (0x4000000UL)             /*!< FIEN218 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG218_NCEPOL218_Pos      (22UL)                    /*!< NCEPOL218 (Bit 22)                                    */
#define GPIO_PINCFG218_NCEPOL218_Msk      (0x400000UL)              /*!< NCEPOL218 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG218_NCESRC218_Pos      (16UL)                    /*!< NCESRC218 (Bit 16)                                    */
#define GPIO_PINCFG218_NCESRC218_Msk      (0x3f0000UL)              /*!< NCESRC218 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG218_PULLCFG218_Pos     (13UL)                    /*!< PULLCFG218 (Bit 13)                                   */
#define GPIO_PINCFG218_PULLCFG218_Msk     (0xe000UL)                /*!< PULLCFG218 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG218_SR218_Pos          (12UL)                    /*!< SR218 (Bit 12)                                        */
#define GPIO_PINCFG218_SR218_Msk          (0x1000UL)                /*!< SR218 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG218_DS218_Pos          (10UL)                    /*!< DS218 (Bit 10)                                        */
#define GPIO_PINCFG218_DS218_Msk          (0xc00UL)                 /*!< DS218 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG218_OUTCFG218_Pos      (8UL)                     /*!< OUTCFG218 (Bit 8)                                     */
#define GPIO_PINCFG218_OUTCFG218_Msk      (0x300UL)                 /*!< OUTCFG218 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG218_IRPTEN218_Pos      (6UL)                     /*!< IRPTEN218 (Bit 6)                                     */
#define GPIO_PINCFG218_IRPTEN218_Msk      (0xc0UL)                  /*!< IRPTEN218 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG218_RDZERO218_Pos      (5UL)                     /*!< RDZERO218 (Bit 5)                                     */
#define GPIO_PINCFG218_RDZERO218_Msk      (0x20UL)                  /*!< RDZERO218 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG218_INPEN218_Pos       (4UL)                     /*!< INPEN218 (Bit 4)                                      */
#define GPIO_PINCFG218_INPEN218_Msk       (0x10UL)                  /*!< INPEN218 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG218_FNCSEL218_Pos      (0UL)                     /*!< FNCSEL218 (Bit 0)                                     */
#define GPIO_PINCFG218_FNCSEL218_Msk      (0xfUL)                   /*!< FNCSEL218 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG219  ======================================================= */
#define GPIO_PINCFG219_FOEN219_Pos        (27UL)                    /*!< FOEN219 (Bit 27)                                      */
#define GPIO_PINCFG219_FOEN219_Msk        (0x8000000UL)             /*!< FOEN219 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG219_FIEN219_Pos        (26UL)                    /*!< FIEN219 (Bit 26)                                      */
#define GPIO_PINCFG219_FIEN219_Msk        (0x4000000UL)             /*!< FIEN219 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG219_NCEPOL219_Pos      (22UL)                    /*!< NCEPOL219 (Bit 22)                                    */
#define GPIO_PINCFG219_NCEPOL219_Msk      (0x400000UL)              /*!< NCEPOL219 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG219_NCESRC219_Pos      (16UL)                    /*!< NCESRC219 (Bit 16)                                    */
#define GPIO_PINCFG219_NCESRC219_Msk      (0x3f0000UL)              /*!< NCESRC219 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG219_PULLCFG219_Pos     (13UL)                    /*!< PULLCFG219 (Bit 13)                                   */
#define GPIO_PINCFG219_PULLCFG219_Msk     (0xe000UL)                /*!< PULLCFG219 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG219_SR219_Pos          (12UL)                    /*!< SR219 (Bit 12)                                        */
#define GPIO_PINCFG219_SR219_Msk          (0x1000UL)                /*!< SR219 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG219_DS219_Pos          (10UL)                    /*!< DS219 (Bit 10)                                        */
#define GPIO_PINCFG219_DS219_Msk          (0xc00UL)                 /*!< DS219 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG219_OUTCFG219_Pos      (8UL)                     /*!< OUTCFG219 (Bit 8)                                     */
#define GPIO_PINCFG219_OUTCFG219_Msk      (0x300UL)                 /*!< OUTCFG219 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG219_IRPTEN219_Pos      (6UL)                     /*!< IRPTEN219 (Bit 6)                                     */
#define GPIO_PINCFG219_IRPTEN219_Msk      (0xc0UL)                  /*!< IRPTEN219 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG219_RDZERO219_Pos      (5UL)                     /*!< RDZERO219 (Bit 5)                                     */
#define GPIO_PINCFG219_RDZERO219_Msk      (0x20UL)                  /*!< RDZERO219 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG219_INPEN219_Pos       (4UL)                     /*!< INPEN219 (Bit 4)                                      */
#define GPIO_PINCFG219_INPEN219_Msk       (0x10UL)                  /*!< INPEN219 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG219_FNCSEL219_Pos      (0UL)                     /*!< FNCSEL219 (Bit 0)                                     */
#define GPIO_PINCFG219_FNCSEL219_Msk      (0xfUL)                   /*!< FNCSEL219 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG220  ======================================================= */
#define GPIO_PINCFG220_FOEN220_Pos        (27UL)                    /*!< FOEN220 (Bit 27)                                      */
#define GPIO_PINCFG220_FOEN220_Msk        (0x8000000UL)             /*!< FOEN220 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG220_FIEN220_Pos        (26UL)                    /*!< FIEN220 (Bit 26)                                      */
#define GPIO_PINCFG220_FIEN220_Msk        (0x4000000UL)             /*!< FIEN220 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG220_NCEPOL220_Pos      (22UL)                    /*!< NCEPOL220 (Bit 22)                                    */
#define GPIO_PINCFG220_NCEPOL220_Msk      (0x400000UL)              /*!< NCEPOL220 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG220_NCESRC220_Pos      (16UL)                    /*!< NCESRC220 (Bit 16)                                    */
#define GPIO_PINCFG220_NCESRC220_Msk      (0x3f0000UL)              /*!< NCESRC220 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG220_PULLCFG220_Pos     (13UL)                    /*!< PULLCFG220 (Bit 13)                                   */
#define GPIO_PINCFG220_PULLCFG220_Msk     (0xe000UL)                /*!< PULLCFG220 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG220_SR220_Pos          (12UL)                    /*!< SR220 (Bit 12)                                        */
#define GPIO_PINCFG220_SR220_Msk          (0x1000UL)                /*!< SR220 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG220_DS220_Pos          (10UL)                    /*!< DS220 (Bit 10)                                        */
#define GPIO_PINCFG220_DS220_Msk          (0xc00UL)                 /*!< DS220 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG220_OUTCFG220_Pos      (8UL)                     /*!< OUTCFG220 (Bit 8)                                     */
#define GPIO_PINCFG220_OUTCFG220_Msk      (0x300UL)                 /*!< OUTCFG220 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG220_IRPTEN220_Pos      (6UL)                     /*!< IRPTEN220 (Bit 6)                                     */
#define GPIO_PINCFG220_IRPTEN220_Msk      (0xc0UL)                  /*!< IRPTEN220 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG220_RDZERO220_Pos      (5UL)                     /*!< RDZERO220 (Bit 5)                                     */
