AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_MCUN0INT3SET_MCUN0GPIO126_Msk (0x40000000UL)           /*!< MCUN0GPIO126 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO125_Pos (29UL)                   /*!< MCUN0GPIO125 (Bit 29)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO125_Msk (0x20000000UL)           /*!< MCUN0GPIO125 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO124_Pos (28UL)                   /*!< MCUN0GPIO124 (Bit 28)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO124_Msk (0x10000000UL)           /*!< MCUN0GPIO124 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO123_Pos (27UL)                   /*!< MCUN0GPIO123 (Bit 27)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO123_Msk (0x8000000UL)            /*!< MCUN0GPIO123 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO122_Pos (26UL)                   /*!< MCUN0GPIO122 (Bit 26)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO122_Msk (0x4000000UL)            /*!< MCUN0GPIO122 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO121_Pos (25UL)                   /*!< MCUN0GPIO121 (Bit 25)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO121_Msk (0x2000000UL)            /*!< MCUN0GPIO121 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO120_Pos (24UL)                   /*!< MCUN0GPIO120 (Bit 24)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO120_Msk (0x1000000UL)            /*!< MCUN0GPIO120 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO119_Pos (23UL)                   /*!< MCUN0GPIO119 (Bit 23)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO119_Msk (0x800000UL)             /*!< MCUN0GPIO119 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO118_Pos (22UL)                   /*!< MCUN0GPIO118 (Bit 22)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO118_Msk (0x400000UL)             /*!< MCUN0GPIO118 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO117_Pos (21UL)                   /*!< MCUN0GPIO117 (Bit 21)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO117_Msk (0x200000UL)             /*!< MCUN0GPIO117 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO116_Pos (20UL)                   /*!< MCUN0GPIO116 (Bit 20)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO116_Msk (0x100000UL)             /*!< MCUN0GPIO116 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO115_Pos (19UL)                   /*!< MCUN0GPIO115 (Bit 19)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO115_Msk (0x80000UL)              /*!< MCUN0GPIO115 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO114_Pos (18UL)                   /*!< MCUN0GPIO114 (Bit 18)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO114_Msk (0x40000UL)              /*!< MCUN0GPIO114 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO113_Pos (17UL)                   /*!< MCUN0GPIO113 (Bit 17)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO113_Msk (0x20000UL)              /*!< MCUN0GPIO113 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO112_Pos (16UL)                   /*!< MCUN0GPIO112 (Bit 16)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO112_Msk (0x10000UL)              /*!< MCUN0GPIO112 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO111_Pos (15UL)                   /*!< MCUN0GPIO111 (Bit 15)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO111_Msk (0x8000UL)               /*!< MCUN0GPIO111 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO110_Pos (14UL)                   /*!< MCUN0GPIO110 (Bit 14)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO110_Msk (0x4000UL)               /*!< MCUN0GPIO110 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO109_Pos (13UL)                   /*!< MCUN0GPIO109 (Bit 13)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO109_Msk (0x2000UL)               /*!< MCUN0GPIO109 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO108_Pos (12UL)                   /*!< MCUN0GPIO108 (Bit 12)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO108_Msk (0x1000UL)               /*!< MCUN0GPIO108 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO107_Pos (11UL)                   /*!< MCUN0GPIO107 (Bit 11)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO107_Msk (0x800UL)                /*!< MCUN0GPIO107 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO106_Pos (10UL)                   /*!< MCUN0GPIO106 (Bit 10)                                 */
#define GPIO_MCUN0INT3SET_MCUN0GPIO106_Msk (0x400UL)                /*!< MCUN0GPIO106 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO105_Pos (9UL)                    /*!< MCUN0GPIO105 (Bit 9)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO105_Msk (0x200UL)                /*!< MCUN0GPIO105 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO104_Pos (8UL)                    /*!< MCUN0GPIO104 (Bit 8)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO104_Msk (0x100UL)                /*!< MCUN0GPIO104 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO103_Pos (7UL)                    /*!< MCUN0GPIO103 (Bit 7)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO103_Msk (0x80UL)                 /*!< MCUN0GPIO103 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO102_Pos (6UL)                    /*!< MCUN0GPIO102 (Bit 6)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO102_Msk (0x40UL)                 /*!< MCUN0GPIO102 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO101_Pos (5UL)                    /*!< MCUN0GPIO101 (Bit 5)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO101_Msk (0x20UL)                 /*!< MCUN0GPIO101 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO100_Pos (4UL)                    /*!< MCUN0GPIO100 (Bit 4)                                  */
#define GPIO_MCUN0INT3SET_MCUN0GPIO100_Msk (0x10UL)                 /*!< MCUN0GPIO100 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT3SET_MCUN0GPIO99_Pos (3UL)                     /*!< MCUN0GPIO99 (Bit 3)                                   */
#define GPIO_MCUN0INT3SET_MCUN0GPIO99_Msk (0x8UL)                   /*!< MCUN0GPIO99 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN0INT3SET_MCUN0GPIO98_Pos (2UL)                     /*!< MCUN0GPIO98 (Bit 2)                                   */
#define GPIO_MCUN0INT3SET_MCUN0GPIO98_Msk (0x4UL)                   /*!< MCUN0GPIO98 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN0INT3SET_MCUN0GPIO97_Pos (1UL)                     /*!< MCUN0GPIO97 (Bit 1)                                   */
#define GPIO_MCUN0INT3SET_MCUN0GPIO97_Msk (0x2UL)                   /*!< MCUN0GPIO97 (Bitfield-Mask: 0x01)                     */
#define GPIO_MCUN0INT3SET_MCUN0GPIO96_Pos (0UL)                     /*!< MCUN0GPIO96 (Bit 0)                                   */
#define GPIO_MCUN0INT3SET_MCUN0GPIO96_Msk (0x1UL)                   /*!< MCUN0GPIO96 (Bitfield-Mask: 0x01)                     */
/* ======================================================  MCUN0INT4EN  ====================================================== */
#define GPIO_MCUN0INT4EN_MCUN0GPIO159_Pos (31UL)                    /*!< MCUN0GPIO159 (Bit 31)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO159_Msk (0x80000000UL)            /*!< MCUN0GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO158_Pos (30UL)                    /*!< MCUN0GPIO158 (Bit 30)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO158_Msk (0x40000000UL)            /*!< MCUN0GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO157_Pos (29UL)                    /*!< MCUN0GPIO157 (Bit 29)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO157_Msk (0x20000000UL)            /*!< MCUN0GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO156_Pos (28UL)                    /*!< MCUN0GPIO156 (Bit 28)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO156_Msk (0x10000000UL)            /*!< MCUN0GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO155_Pos (27UL)                    /*!< MCUN0GPIO155 (Bit 27)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO155_Msk (0x8000000UL)             /*!< MCUN0GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO154_Pos (26UL)                    /*!< MCUN0GPIO154 (Bit 26)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO154_Msk (0x4000000UL)             /*!< MCUN0GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO153_Pos (25UL)                    /*!< MCUN0GPIO153 (Bit 25)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO153_Msk (0x2000000UL)             /*!< MCUN0GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO152_Pos (24UL)                    /*!< MCUN0GPIO152 (Bit 24)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO152_Msk (0x1000000UL)             /*!< MCUN0GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO151_Pos (23UL)                    /*!< MCUN0GPIO151 (Bit 23)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO151_Msk (0x800000UL)              /*!< MCUN0GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO150_Pos (22UL)                    /*!< MCUN0GPIO150 (Bit 22)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO150_Msk (0x400000UL)              /*!< MCUN0GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO149_Pos (21UL)                    /*!< MCUN0GPIO149 (Bit 21)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO149_Msk (0x200000UL)              /*!< MCUN0GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO148_Pos (20UL)                    /*!< MCUN0GPIO148 (Bit 20)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO148_Msk (0x100000UL)              /*!< MCUN0GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO147_Pos (19UL)                    /*!< MCUN0GPIO147 (Bit 19)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO147_Msk (0x80000UL)               /*!< MCUN0GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO146_Pos (18UL)                    /*!< MCUN0GPIO146 (Bit 18)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO146_Msk (0x40000UL)               /*!< MCUN0GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO145_Pos (17UL)                    /*!< MCUN0GPIO145 (Bit 17)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO145_Msk (0x20000UL)               /*!< MCUN0GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO144_Pos (16UL)                    /*!< MCUN0GPIO144 (Bit 16)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO144_Msk (0x10000UL)               /*!< MCUN0GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO143_Pos (15UL)                    /*!< MCUN0GPIO143 (Bit 15)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO143_Msk (0x8000UL)                /*!< MCUN0GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO142_Pos (14UL)                    /*!< MCUN0GPIO142 (Bit 14)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO142_Msk (0x4000UL)                /*!< MCUN0GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO141_Pos (13UL)                    /*!< MCUN0GPIO141 (Bit 13)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO141_Msk (0x2000UL)                /*!< MCUN0GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO140_Pos (12UL)                    /*!< MCUN0GPIO140 (Bit 12)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO140_Msk (0x1000UL)                /*!< MCUN0GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO139_Pos (11UL)                    /*!< MCUN0GPIO139 (Bit 11)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO139_Msk (0x800UL)                 /*!< MCUN0GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO138_Pos (10UL)                    /*!< MCUN0GPIO138 (Bit 10)                                 */
#define GPIO_MCUN0INT4EN_MCUN0GPIO138_Msk (0x400UL)                 /*!< MCUN0GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO137_Pos (9UL)                     /*!< MCUN0GPIO137 (Bit 9)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO137_Msk (0x200UL)                 /*!< MCUN0GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO136_Pos (8UL)                     /*!< MCUN0GPIO136 (Bit 8)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO136_Msk (0x100UL)                 /*!< MCUN0GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO135_Pos (7UL)                     /*!< MCUN0GPIO135 (Bit 7)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO135_Msk (0x80UL)                  /*!< MCUN0GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO134_Pos (6UL)                     /*!< MCUN0GPIO134 (Bit 6)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO134_Msk (0x40UL)                  /*!< MCUN0GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO133_Pos (5UL)                     /*!< MCUN0GPIO133 (Bit 5)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO133_Msk (0x20UL)                  /*!< MCUN0GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO132_Pos (4UL)                     /*!< MCUN0GPIO132 (Bit 4)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO132_Msk (0x10UL)                  /*!< MCUN0GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO131_Pos (3UL)                     /*!< MCUN0GPIO131 (Bit 3)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO131_Msk (0x8UL)                   /*!< MCUN0GPIO131 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO130_Pos (2UL)                     /*!< MCUN0GPIO130 (Bit 2)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO130_Msk (0x4UL)                   /*!< MCUN0GPIO130 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO129_Pos (1UL)                     /*!< MCUN0GPIO129 (Bit 1)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO129_Msk (0x2UL)                   /*!< MCUN0GPIO129 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4EN_MCUN0GPIO128_Pos (0UL)                     /*!< MCUN0GPIO128 (Bit 0)                                  */
#define GPIO_MCUN0INT4EN_MCUN0GPIO128_Msk (0x1UL)                   /*!< MCUN0GPIO128 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN0INT4STAT  ===================================================== */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO159_Pos (31UL)                  /*!< MCUN0GPIO159 (Bit 31)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO159_Msk (0x80000000UL)          /*!< MCUN0GPIO159 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO158_Pos (30UL)                  /*!< MCUN0GPIO158 (Bit 30)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO158_Msk (0x40000000UL)          /*!< MCUN0GPIO158 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO157_Pos (29UL)                  /*!< MCUN0GPIO157 (Bit 29)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO157_Msk (0x20000000UL)          /*!< MCUN0GPIO157 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO156_Pos (28UL)                  /*!< MCUN0GPIO156 (Bit 28)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO156_Msk (0x10000000UL)          /*!< MCUN0GPIO156 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO155_Pos (27UL)                  /*!< MCUN0GPIO155 (Bit 27)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO155_Msk (0x8000000UL)           /*!< MCUN0GPIO155 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO154_Pos (26UL)                  /*!< MCUN0GPIO154 (Bit 26)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO154_Msk (0x4000000UL)           /*!< MCUN0GPIO154 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO153_Pos (25UL)                  /*!< MCUN0GPIO153 (Bit 25)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO153_Msk (0x2000000UL)           /*!< MCUN0GPIO153 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO152_Pos (24UL)                  /*!< MCUN0GPIO152 (Bit 24)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO152_Msk (0x1000000UL)           /*!< MCUN0GPIO152 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO151_Pos (23UL)                  /*!< MCUN0GPIO151 (Bit 23)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO151_Msk (0x800000UL)            /*!< MCUN0GPIO151 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO150_Pos (22UL)                  /*!< MCUN0GPIO150 (Bit 22)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO150_Msk (0x400000UL)            /*!< MCUN0GPIO150 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO149_Pos (21UL)                  /*!< MCUN0GPIO149 (Bit 21)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO149_Msk (0x200000UL)            /*!< MCUN0GPIO149 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO148_Pos (20UL)                  /*!< MCUN0GPIO148 (Bit 20)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO148_Msk (0x100000UL)            /*!< MCUN0GPIO148 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO147_Pos (19UL)                  /*!< MCUN0GPIO147 (Bit 19)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO147_Msk (0x80000UL)             /*!< MCUN0GPIO147 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO146_Pos (18UL)                  /*!< MCUN0GPIO146 (Bit 18)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO146_Msk (0x40000UL)             /*!< MCUN0GPIO146 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO145_Pos (17UL)                  /*!< MCUN0GPIO145 (Bit 17)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO145_Msk (0x20000UL)             /*!< MCUN0GPIO145 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO144_Pos (16UL)                  /*!< MCUN0GPIO144 (Bit 16)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO144_Msk (0x10000UL)             /*!< MCUN0GPIO144 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO143_Pos (15UL)                  /*!< MCUN0GPIO143 (Bit 15)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO143_Msk (0x8000UL)              /*!< MCUN0GPIO143 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO142_Pos (14UL)                  /*!< MCUN0GPIO142 (Bit 14)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO142_Msk (0x4000UL)              /*!< MCUN0GPIO142 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO141_Pos (13UL)                  /*!< MCUN0GPIO141 (Bit 13)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO141_Msk (0x2000UL)              /*!< MCUN0GPIO141 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO140_Pos (12UL)                  /*!< MCUN0GPIO140 (Bit 12)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO140_Msk (0x1000UL)              /*!< MCUN0GPIO140 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO139_Pos (11UL)                  /*!< MCUN0GPIO139 (Bit 11)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO139_Msk (0x800UL)               /*!< MCUN0GPIO139 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO138_Pos (10UL)                  /*!< MCUN0GPIO138 (Bit 10)                                 */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO138_Msk (0x400UL)               /*!< MCUN0GPIO138 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO137_Pos (9UL)                   /*!< MCUN0GPIO137 (Bit 9)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO137_Msk (0x200UL)               /*!< MCUN0GPIO137 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO136_Pos (8UL)                   /*!< MCUN0GPIO136 (Bit 8)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO136_Msk (0x100UL)               /*!< MCUN0GPIO136 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO135_Pos (7UL)                   /*!< MCUN0GPIO135 (Bit 7)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO135_Msk (0x80UL)                /*!< MCUN0GPIO135 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO134_Pos (6UL)                   /*!< MCUN0GPIO134 (Bit 6)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO134_Msk (0x40UL)                /*!< MCUN0GPIO134 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO133_Pos (5UL)                   /*!< MCUN0GPIO133 (Bit 5)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO133_Msk (0x20UL)                /*!< MCUN0GPIO133 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO132_Pos (4UL)                   /*!< MCUN0GPIO132 (Bit 4)                                  */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO132_Msk (0x10UL)                /*!< MCUN0GPIO132 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN0INT4STAT_MCUN0GPIO131_Pos (3UL)                   /*!< MCUN0GPIO131 (Bit 3)                                  */
