AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define GPIO_MCUN1INT5SET_MCUN1GPIO164_Msk (0x10UL)                 /*!< MCUN1GPIO164 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO163_Pos (3UL)                    /*!< MCUN1GPIO163 (Bit 3)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO163_Msk (0x8UL)                  /*!< MCUN1GPIO163 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO162_Pos (2UL)                    /*!< MCUN1GPIO162 (Bit 2)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO162_Msk (0x4UL)                  /*!< MCUN1GPIO162 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO161_Pos (1UL)                    /*!< MCUN1GPIO161 (Bit 1)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO161_Msk (0x2UL)                  /*!< MCUN1GPIO161 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT5SET_MCUN1GPIO160_Pos (0UL)                    /*!< MCUN1GPIO160 (Bit 0)                                  */
#define GPIO_MCUN1INT5SET_MCUN1GPIO160_Msk (0x1UL)                  /*!< MCUN1GPIO160 (Bitfield-Mask: 0x01)                    */
/* ======================================================  MCUN1INT6EN  ====================================================== */
#define GPIO_MCUN1INT6EN_MCUN1GPIO223_Pos (31UL)                    /*!< MCUN1GPIO223 (Bit 31)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO223_Msk (0x80000000UL)            /*!< MCUN1GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO222_Pos (30UL)                    /*!< MCUN1GPIO222 (Bit 30)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO222_Msk (0x40000000UL)            /*!< MCUN1GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO221_Pos (29UL)                    /*!< MCUN1GPIO221 (Bit 29)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO221_Msk (0x20000000UL)            /*!< MCUN1GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO220_Pos (28UL)                    /*!< MCUN1GPIO220 (Bit 28)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO220_Msk (0x10000000UL)            /*!< MCUN1GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO219_Pos (27UL)                    /*!< MCUN1GPIO219 (Bit 27)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO219_Msk (0x8000000UL)             /*!< MCUN1GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO218_Pos (26UL)                    /*!< MCUN1GPIO218 (Bit 26)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO218_Msk (0x4000000UL)             /*!< MCUN1GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO217_Pos (25UL)                    /*!< MCUN1GPIO217 (Bit 25)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO217_Msk (0x2000000UL)             /*!< MCUN1GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO216_Pos (24UL)                    /*!< MCUN1GPIO216 (Bit 24)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO216_Msk (0x1000000UL)             /*!< MCUN1GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO215_Pos (23UL)                    /*!< MCUN1GPIO215 (Bit 23)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO215_Msk (0x800000UL)              /*!< MCUN1GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO214_Pos (22UL)                    /*!< MCUN1GPIO214 (Bit 22)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO214_Msk (0x400000UL)              /*!< MCUN1GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO213_Pos (21UL)                    /*!< MCUN1GPIO213 (Bit 21)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO213_Msk (0x200000UL)              /*!< MCUN1GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO212_Pos (20UL)                    /*!< MCUN1GPIO212 (Bit 20)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO212_Msk (0x100000UL)              /*!< MCUN1GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO211_Pos (19UL)                    /*!< MCUN1GPIO211 (Bit 19)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO211_Msk (0x80000UL)               /*!< MCUN1GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO210_Pos (18UL)                    /*!< MCUN1GPIO210 (Bit 18)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO210_Msk (0x40000UL)               /*!< MCUN1GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO209_Pos (17UL)                    /*!< MCUN1GPIO209 (Bit 17)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO209_Msk (0x20000UL)               /*!< MCUN1GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO208_Pos (16UL)                    /*!< MCUN1GPIO208 (Bit 16)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO208_Msk (0x10000UL)               /*!< MCUN1GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO207_Pos (15UL)                    /*!< MCUN1GPIO207 (Bit 15)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO207_Msk (0x8000UL)                /*!< MCUN1GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO206_Pos (14UL)                    /*!< MCUN1GPIO206 (Bit 14)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO206_Msk (0x4000UL)                /*!< MCUN1GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO205_Pos (13UL)                    /*!< MCUN1GPIO205 (Bit 13)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO205_Msk (0x2000UL)                /*!< MCUN1GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO204_Pos (12UL)                    /*!< MCUN1GPIO204 (Bit 12)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO204_Msk (0x1000UL)                /*!< MCUN1GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO203_Pos (11UL)                    /*!< MCUN1GPIO203 (Bit 11)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO203_Msk (0x800UL)                 /*!< MCUN1GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO202_Pos (10UL)                    /*!< MCUN1GPIO202 (Bit 10)                                 */
#define GPIO_MCUN1INT6EN_MCUN1GPIO202_Msk (0x400UL)                 /*!< MCUN1GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO201_Pos (9UL)                     /*!< MCUN1GPIO201 (Bit 9)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO201_Msk (0x200UL)                 /*!< MCUN1GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO200_Pos (8UL)                     /*!< MCUN1GPIO200 (Bit 8)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO200_Msk (0x100UL)                 /*!< MCUN1GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO199_Pos (7UL)                     /*!< MCUN1GPIO199 (Bit 7)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO199_Msk (0x80UL)                  /*!< MCUN1GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO198_Pos (6UL)                     /*!< MCUN1GPIO198 (Bit 6)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO198_Msk (0x40UL)                  /*!< MCUN1GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO197_Pos (5UL)                     /*!< MCUN1GPIO197 (Bit 5)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO197_Msk (0x20UL)                  /*!< MCUN1GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO196_Pos (4UL)                     /*!< MCUN1GPIO196 (Bit 4)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO196_Msk (0x10UL)                  /*!< MCUN1GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO195_Pos (3UL)                     /*!< MCUN1GPIO195 (Bit 3)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO195_Msk (0x8UL)                   /*!< MCUN1GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO194_Pos (2UL)                     /*!< MCUN1GPIO194 (Bit 2)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO194_Msk (0x4UL)                   /*!< MCUN1GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO193_Pos (1UL)                     /*!< MCUN1GPIO193 (Bit 1)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO193_Msk (0x2UL)                   /*!< MCUN1GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6EN_MCUN1GPIO192_Pos (0UL)                     /*!< MCUN1GPIO192 (Bit 0)                                  */
#define GPIO_MCUN1INT6EN_MCUN1GPIO192_Msk (0x1UL)                   /*!< MCUN1GPIO192 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT6STAT  ===================================================== */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO223_Pos (31UL)                  /*!< MCUN1GPIO223 (Bit 31)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO223_Msk (0x80000000UL)          /*!< MCUN1GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO222_Pos (30UL)                  /*!< MCUN1GPIO222 (Bit 30)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO222_Msk (0x40000000UL)          /*!< MCUN1GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO221_Pos (29UL)                  /*!< MCUN1GPIO221 (Bit 29)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO221_Msk (0x20000000UL)          /*!< MCUN1GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO220_Pos (28UL)                  /*!< MCUN1GPIO220 (Bit 28)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO220_Msk (0x10000000UL)          /*!< MCUN1GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO219_Pos (27UL)                  /*!< MCUN1GPIO219 (Bit 27)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO219_Msk (0x8000000UL)           /*!< MCUN1GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO218_Pos (26UL)                  /*!< MCUN1GPIO218 (Bit 26)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO218_Msk (0x4000000UL)           /*!< MCUN1GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO217_Pos (25UL)                  /*!< MCUN1GPIO217 (Bit 25)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO217_Msk (0x2000000UL)           /*!< MCUN1GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO216_Pos (24UL)                  /*!< MCUN1GPIO216 (Bit 24)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO216_Msk (0x1000000UL)           /*!< MCUN1GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO215_Pos (23UL)                  /*!< MCUN1GPIO215 (Bit 23)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO215_Msk (0x800000UL)            /*!< MCUN1GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO214_Pos (22UL)                  /*!< MCUN1GPIO214 (Bit 22)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO214_Msk (0x400000UL)            /*!< MCUN1GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO213_Pos (21UL)                  /*!< MCUN1GPIO213 (Bit 21)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO213_Msk (0x200000UL)            /*!< MCUN1GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO212_Pos (20UL)                  /*!< MCUN1GPIO212 (Bit 20)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO212_Msk (0x100000UL)            /*!< MCUN1GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO211_Pos (19UL)                  /*!< MCUN1GPIO211 (Bit 19)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO211_Msk (0x80000UL)             /*!< MCUN1GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO210_Pos (18UL)                  /*!< MCUN1GPIO210 (Bit 18)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO210_Msk (0x40000UL)             /*!< MCUN1GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO209_Pos (17UL)                  /*!< MCUN1GPIO209 (Bit 17)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO209_Msk (0x20000UL)             /*!< MCUN1GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO208_Pos (16UL)                  /*!< MCUN1GPIO208 (Bit 16)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO208_Msk (0x10000UL)             /*!< MCUN1GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO207_Pos (15UL)                  /*!< MCUN1GPIO207 (Bit 15)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO207_Msk (0x8000UL)              /*!< MCUN1GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO206_Pos (14UL)                  /*!< MCUN1GPIO206 (Bit 14)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO206_Msk (0x4000UL)              /*!< MCUN1GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO205_Pos (13UL)                  /*!< MCUN1GPIO205 (Bit 13)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO205_Msk (0x2000UL)              /*!< MCUN1GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO204_Pos (12UL)                  /*!< MCUN1GPIO204 (Bit 12)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO204_Msk (0x1000UL)              /*!< MCUN1GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO203_Pos (11UL)                  /*!< MCUN1GPIO203 (Bit 11)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO203_Msk (0x800UL)               /*!< MCUN1GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO202_Pos (10UL)                  /*!< MCUN1GPIO202 (Bit 10)                                 */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO202_Msk (0x400UL)               /*!< MCUN1GPIO202 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO201_Pos (9UL)                   /*!< MCUN1GPIO201 (Bit 9)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO201_Msk (0x200UL)               /*!< MCUN1GPIO201 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO200_Pos (8UL)                   /*!< MCUN1GPIO200 (Bit 8)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO200_Msk (0x100UL)               /*!< MCUN1GPIO200 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO199_Pos (7UL)                   /*!< MCUN1GPIO199 (Bit 7)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO199_Msk (0x80UL)                /*!< MCUN1GPIO199 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO198_Pos (6UL)                   /*!< MCUN1GPIO198 (Bit 6)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO198_Msk (0x40UL)                /*!< MCUN1GPIO198 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO197_Pos (5UL)                   /*!< MCUN1GPIO197 (Bit 5)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO197_Msk (0x20UL)                /*!< MCUN1GPIO197 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO196_Pos (4UL)                   /*!< MCUN1GPIO196 (Bit 4)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO196_Msk (0x10UL)                /*!< MCUN1GPIO196 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO195_Pos (3UL)                   /*!< MCUN1GPIO195 (Bit 3)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO195_Msk (0x8UL)                 /*!< MCUN1GPIO195 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO194_Pos (2UL)                   /*!< MCUN1GPIO194 (Bit 2)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO194_Msk (0x4UL)                 /*!< MCUN1GPIO194 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO193_Pos (1UL)                   /*!< MCUN1GPIO193 (Bit 1)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO193_Msk (0x2UL)                 /*!< MCUN1GPIO193 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO192_Pos (0UL)                   /*!< MCUN1GPIO192 (Bit 0)                                  */
#define GPIO_MCUN1INT6STAT_MCUN1GPIO192_Msk (0x1UL)                 /*!< MCUN1GPIO192 (Bitfield-Mask: 0x01)                    */
/* =====================================================  MCUN1INT6CLR  ====================================================== */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO223_Pos (31UL)                   /*!< MCUN1GPIO223 (Bit 31)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO223_Msk (0x80000000UL)           /*!< MCUN1GPIO223 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO222_Pos (30UL)                   /*!< MCUN1GPIO222 (Bit 30)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO222_Msk (0x40000000UL)           /*!< MCUN1GPIO222 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO221_Pos (29UL)                   /*!< MCUN1GPIO221 (Bit 29)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO221_Msk (0x20000000UL)           /*!< MCUN1GPIO221 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO220_Pos (28UL)                   /*!< MCUN1GPIO220 (Bit 28)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO220_Msk (0x10000000UL)           /*!< MCUN1GPIO220 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO219_Pos (27UL)                   /*!< MCUN1GPIO219 (Bit 27)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO219_Msk (0x8000000UL)            /*!< MCUN1GPIO219 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO218_Pos (26UL)                   /*!< MCUN1GPIO218 (Bit 26)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO218_Msk (0x4000000UL)            /*!< MCUN1GPIO218 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO217_Pos (25UL)                   /*!< MCUN1GPIO217 (Bit 25)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO217_Msk (0x2000000UL)            /*!< MCUN1GPIO217 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO216_Pos (24UL)                   /*!< MCUN1GPIO216 (Bit 24)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO216_Msk (0x1000000UL)            /*!< MCUN1GPIO216 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO215_Pos (23UL)                   /*!< MCUN1GPIO215 (Bit 23)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO215_Msk (0x800000UL)             /*!< MCUN1GPIO215 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO214_Pos (22UL)                   /*!< MCUN1GPIO214 (Bit 22)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO214_Msk (0x400000UL)             /*!< MCUN1GPIO214 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO213_Pos (21UL)                   /*!< MCUN1GPIO213 (Bit 21)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO213_Msk (0x200000UL)             /*!< MCUN1GPIO213 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO212_Pos (20UL)                   /*!< MCUN1GPIO212 (Bit 20)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO212_Msk (0x100000UL)             /*!< MCUN1GPIO212 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO211_Pos (19UL)                   /*!< MCUN1GPIO211 (Bit 19)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO211_Msk (0x80000UL)              /*!< MCUN1GPIO211 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO210_Pos (18UL)                   /*!< MCUN1GPIO210 (Bit 18)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO210_Msk (0x40000UL)              /*!< MCUN1GPIO210 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO209_Pos (17UL)                   /*!< MCUN1GPIO209 (Bit 17)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO209_Msk (0x20000UL)              /*!< MCUN1GPIO209 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO208_Pos (16UL)                   /*!< MCUN1GPIO208 (Bit 16)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO208_Msk (0x10000UL)              /*!< MCUN1GPIO208 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO207_Pos (15UL)                   /*!< MCUN1GPIO207 (Bit 15)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO207_Msk (0x8000UL)               /*!< MCUN1GPIO207 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO206_Pos (14UL)                   /*!< MCUN1GPIO206 (Bit 14)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO206_Msk (0x4000UL)               /*!< MCUN1GPIO206 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO205_Pos (13UL)                   /*!< MCUN1GPIO205 (Bit 13)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO205_Msk (0x2000UL)               /*!< MCUN1GPIO205 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO204_Pos (12UL)                   /*!< MCUN1GPIO204 (Bit 12)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO204_Msk (0x1000UL)               /*!< MCUN1GPIO204 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO203_Pos (11UL)                   /*!< MCUN1GPIO203 (Bit 11)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO203_Msk (0x800UL)                /*!< MCUN1GPIO203 (Bitfield-Mask: 0x01)                    */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO202_Pos (10UL)                   /*!< MCUN1GPIO202 (Bit 10)                                 */
#define GPIO_MCUN1INT6CLR_MCUN1GPIO202_Msk (0x400UL)                /*!< MCUN1GPIO202 (Bitfield-Mask: 0x01)                    */
