AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define MCUCTRL_D2ASPARE_D2ASPARE_Pos     (0UL)                     /*!< D2ASPARE (Bit 0)                                      */
#define MCUCTRL_D2ASPARE_D2ASPARE_Msk     (0xffffffffUL)            /*!< D2ASPARE (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  BOOTLOADER  ======================================================= */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Pos (30UL)                  /*!< SECBOOTONRST (Bit 30)                                 */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Msk (0xc0000000UL)          /*!< SECBOOTONRST (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_BOOTLOADER_SECBOOT_Pos    (28UL)                    /*!< SECBOOT (Bit 28)                                      */
#define MCUCTRL_BOOTLOADER_SECBOOT_Msk    (0x30000000UL)            /*!< SECBOOT (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Pos (26UL)                /*!< SECBOOTFEATURE (Bit 26)                               */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Msk (0xc000000UL)         /*!< SECBOOTFEATURE (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_BOOTLOADER_SBLLOCK_Pos    (3UL)                     /*!< SBLLOCK (Bit 3)                                       */
#define MCUCTRL_BOOTLOADER_SBLLOCK_Msk    (0x8UL)                   /*!< SBLLOCK (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Pos   (2UL)                     /*!< PROTLOCK (Bit 2)                                      */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Msk   (0x4UL)                   /*!< PROTLOCK (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_BOOTLOADER_SBRLOCK_Pos    (1UL)                     /*!< SBRLOCK (Bit 1)                                       */
#define MCUCTRL_BOOTLOADER_SBRLOCK_Msk    (0x2UL)                   /*!< SBRLOCK (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BOOTLOADER_RSVD0_Pos      (0UL)                     /*!< RSVD0 (Bit 0)                                         */
#define MCUCTRL_BOOTLOADER_RSVD0_Msk      (0x1UL)                   /*!< RSVD0 (Bitfield-Mask: 0x01)                           */
/* ======================================================  SHADOWVALID  ====================================================== */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Pos (7UL)                  /*!< OTPBOOTFAULT (Bit 7)                                  */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Msk (0x1f80UL)             /*!< OTPBOOTFAULT (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_SHADOWVALID_OTPREADY_Pos  (6UL)                     /*!< OTPREADY (Bit 6)                                      */
#define MCUCTRL_SHADOWVALID_OTPREADY_Msk  (0x40UL)                  /*!< OTPREADY (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Pos (4UL)                   /*!< INFO0SELOTP (Bit 4)                                   */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Msk (0x10UL)                /*!< INFO0SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Pos (3UL)                   /*!< INFO1SELOTP (Bit 3)                                   */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Msk (0x8UL)                 /*!< INFO1SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_VALID_Pos     (0UL)                     /*!< VALID (Bit 0)                                         */
#define MCUCTRL_SHADOWVALID_VALID_Msk     (0x1UL)                   /*!< VALID (Bitfield-Mask: 0x01)                           */
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< SCRATCH0 (Bit 0)                                      */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< SCRATCH0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< SCRATCH1 (Bit 0)                                      */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< SCRATCH1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< ONETO8 (Bit 0)                                        */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< ONETO8 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< COOLCODE (Bit 0)                                      */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< COOLCODE (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  WICCONTROL  ======================================================= */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Pos  (0UL)                     /*!< DEEPISWIC (Bit 0)                                     */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Msk  (0x1UL)                   /*!< DEEPISWIC (Bitfield-Mask: 0x01)                       */
/* ========================================================  DBGCTRL  ======================================================== */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Pos   (12UL)                    /*!< DBGTSCLKSEL (Bit 12)                                  */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Msk   (0x7000UL)                /*!< DBGTSCLKSEL (Bitfield-Mask: 0x07)                     */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Pos  (8UL)                     /*!< DBGETBENABLE (Bit 8)                                  */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Msk  (0x100UL)                 /*!< DBGETBENABLE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Pos (1UL)                     /*!< DBGTPIUCLKSEL (Bit 1)                                 */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Msk (0xeUL)                   /*!< DBGTPIUCLKSEL (Bitfield-Mask: 0x07)                   */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Pos (0UL)                /*!< DBGTPIUTRACEENABLE (Bit 0)                            */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Msk (0x1UL)              /*!< DBGTPIUTRACEENABLE (Bitfield-Mask: 0x01)              */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (2UL)                     /*!< OTAPOINTER (Bit 2)                                    */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffffcUL)            /*!< OTAPOINTER (Bitfield-Mask: 0x3fffffff)                */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Pos (1UL)                   /*!< OTASBLUPDATE (Bit 1)                                  */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Msk (0x2UL)                 /*!< OTASBLUPDATE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< OTAVALID (Bit 0)                                      */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< OTAVALID (Bitfield-Mask: 0x01)                        */
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< HYSTERESIS (Bit 8)                                    */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< HYSTERESIS (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Pos (1UL)                    /*!< DECODEABORT (Bit 1)                                   */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Msk (0x2UL)                  /*!< DECODEABORT (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Pos  (0UL)                     /*!< DMAENABLE (Bit 0)                                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Msk  (0x1UL)                   /*!< DMAENABLE (Bitfield-Mask: 0x01)                       */
/* =====================================================  FORCEAXICLKEN  ===================================================== */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Pos (0UL)                 /*!< FRCAXICLKEN (Bit 0)                                   */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Msk (0x1UL)               /*!< FRCAXICLKEN (Bitfield-Mask: 0x01)                     */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK0  ======================================================= */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Pos (4UL)               /*!< TONTOFFNODEGLITCH (Bit 4)                             */
#define MCUCTRL_SIMOBUCK0_TONTOFFNODEGLITCH_Msk (0x10UL)            /*!< TONTOFFNODEGLITCH (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Pos (3UL)                  /*!< VDDCLVRXCOMPEN (Bit 3)                                */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Msk (0x8UL)                /*!< VDDCLVRXCOMPEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Pos (2UL)                    /*!< VDDSRXCOMPEN (Bit 2)                                  */
#define MCUCTRL_SIMOBUCK0_VDDSRXCOMPEN_Msk (0x4UL)                  /*!< VDDSRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Pos (1UL)                    /*!< VDDFRXCOMPEN (Bit 1)                                  */
#define MCUCTRL_SIMOBUCK0_VDDFRXCOMPEN_Msk (0x2UL)                  /*!< VDDFRXCOMPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Pos (0UL)                    /*!< VDDCRXCOMPEN (Bit 0)                                  */
#define MCUCTRL_SIMOBUCK0_VDDCRXCOMPEN_Msk (0x1UL)                  /*!< VDDCRXCOMPEN (Bitfield-Mask: 0x01)                    */
/* =======================================================  SIMOBUCK1  ======================================================= */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Pos (31UL)               /*!< SIMOBUCKHPTRIMEN (Bit 31)                             */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Msk (0x80000000UL)       /*!< SIMOBUCKHPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Pos (30UL)                  /*!< SIMOBUCKOBSEN (Bit 30)                                */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Msk (0x40000000UL)          /*!< SIMOBUCKOBSEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_BUCKMODE_Pos    (29UL)                    /*!< BUCKMODE (Bit 29)                                     */
#define MCUCTRL_SIMOBUCK1_BUCKMODE_Msk    (0x20000000UL)            /*!< BUCKMODE (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Pos (28UL)                   /*!< FORCEBUCKOFF (Bit 28)                                 */
#define MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Msk (0x10000000UL)           /*!< FORCEBUCKOFF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SIMOBUCK1_TPNDTRIM_Pos    (26UL)                    /*!< TPNDTRIM (Bit 26)                                     */
#define MCUCTRL_SIMOBUCK1_TPNDTRIM_Msk    (0xc000000UL)             /*!< TPNDTRIM (Bitfield-Mask: 0x03)                        */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Pos  (22UL)                    /*!< TONCLKTRIM (Bit 22)                                   */
#define MCUCTRL_SIMOBUCK1_TONCLKTRIM_Msk  (0x3c00000UL)             /*!< TONCLKTRIM (Bitfield-Mask: 0x0f)                      */
#define MCUCTRL_SIMOBUCK1_WSELVDDSBSMODE_Pos (21UL)                 /*!< WSELVDDSBSMODE (Bit 21)                               */
#define MCUCTRL_SIMOBUCK1_WSELVDDSBSMODE_Msk (0x200000UL)           /*!< WSELVDDSBSMODE (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK1_WSELDELAYTRIM_Pos (20UL)                  /*!< WSELDELAYTRIM (Bit 20)                                */
#define MCUCTRL_SIMOBUCK1_WSELDELAYTRIM_Msk (0x100000UL)            /*!< WSELDELAYTRIM (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_RXSCHEDULINGCODE_Pos (18UL)               /*!< RXSCHEDULINGCODE (Bit 18)                             */
#define MCUCTRL_SIMOBUCK1_RXSCHEDULINGCODE_Msk (0xc0000UL)          /*!< RXSCHEDULINGCODE (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK1_OBSMODE_Pos     (16UL)                    /*!< OBSMODE (Bit 16)                                      */
#define MCUCTRL_SIMOBUCK1_OBSMODE_Msk     (0x30000UL)               /*!< OBSMODE (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_SIMOBUCK1_RXCLKLPTRIM_Pos (11UL)                    /*!< RXCLKLPTRIM (Bit 11)                                  */
#define MCUCTRL_SIMOBUCK1_RXCLKLPTRIM_Msk (0xf800UL)                /*!< RXCLKLPTRIM (Bitfield-Mask: 0x1f)                     */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Pos (6UL)                    /*!< RXCLKACTTRIM (Bit 6)                                  */
#define MCUCTRL_SIMOBUCK1_RXCLKACTTRIM_Msk (0x7c0UL)                /*!< RXCLKACTTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK1_RXCLKACTSEL_Pos (5UL)                     /*!< RXCLKACTSEL (Bit 5)                                   */
#define MCUCTRL_SIMOBUCK1_RXCLKACTSEL_Msk (0x20UL)                  /*!< RXCLKACTSEL (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SIMOBUCK1_LPFBEN_Pos      (4UL)                     /*!< LPFBEN (Bit 4)                                        */
#define MCUCTRL_SIMOBUCK1_LPFBEN_Msk      (0x10UL)                  /*!< LPFBEN (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Pos (3UL)                   /*!< FORCETONCLKEN (Bit 3)                                 */
#define MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Msk (0x8UL)                 /*!< FORCETONCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK1_DCMMODEEN_Pos   (2UL)                     /*!< DCMMODEEN (Bit 2)                                     */
#define MCUCTRL_SIMOBUCK1_DCMMODEEN_Msk   (0x4UL)                   /*!< DCMMODEEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK1_COARSESEL_Pos   (1UL)                     /*!< COARSESEL (Bit 1)                                     */
#define MCUCTRL_SIMOBUCK1_COARSESEL_Msk   (0x2UL)                   /*!< COARSESEL (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK1_ACTFBEN_Pos     (0UL)                     /*!< ACTFBEN (Bit 0)                                       */
#define MCUCTRL_SIMOBUCK1_ACTFBEN_Msk     (0x1UL)                   /*!< ACTFBEN (Bitfield-Mask: 0x01)                         */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Pos (25UL)              /*!< VDDCACTLOWTONTRIM (Bit 25)                            */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTONTRIM_Msk (0x3e000000UL)      /*!< VDDCACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTOFFTRIM_Pos (20UL)             /*!< VDDCACTLOWTOFFTRIM (Bit 20)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTLOWTOFFTRIM_Msk (0x1f00000UL)      /*!< VDDCACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Pos (11UL)             /*!< VDDCACTHIGHTONTRIM (Bit 11)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTONTRIM_Msk (0xf800UL)         /*!< VDDCACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTOFFTRIM_Pos (6UL)             /*!< VDDCACTHIGHTOFFTRIM (Bit 6)                           */
#define MCUCTRL_SIMOBUCK2_VDDCACTHIGHTOFFTRIM_Msk (0x7c0UL)         /*!< VDDCACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK2_VDDCACTDRVSTRTRIM_Pos (0UL)               /*!< VDDCACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK2_VDDCACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDCACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Pos (27UL)               /*!< VDDCLPLOWTONTRIM (Bit 27)                             */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTONTRIM_Msk (0xf8000000UL)       /*!< VDDCLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIM_Pos (22UL)              /*!< VDDCLPLOWTOFFTRIM (Bit 22)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIM_Msk (0x7c00000UL)       /*!< VDDCLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIMFINE_Pos (18UL)          /*!< VDDCLPLOWTOFFTRIMFINE (Bit 18)                        */
#define MCUCTRL_SIMOBUCK3_VDDCLPLOWTOFFTRIMFINE_Msk (0x3c0000UL)    /*!< VDDCLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Pos (13UL)              /*!< VDDCLPHIGHTONTRIM (Bit 13)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTONTRIM_Msk (0x3e000UL)         /*!< VDDCLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIM_Pos (8UL)              /*!< VDDCLPHIGHTOFFTRIM (Bit 8)                            */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIM_Msk (0x1f00UL)         /*!< VDDCLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIMFINE_Pos (4UL)          /*!< VDDCLPHIGHTOFFTRIMFINE (Bit 4)                        */
#define MCUCTRL_SIMOBUCK3_VDDCLPHIGHTOFFTRIMFINE_Msk (0xf0UL)       /*!< VDDCLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
#define MCUCTRL_SIMOBUCK3_VDDCLPDRVSTRTRIM_Pos (2UL)                /*!< VDDCLPDRVSTRTRIM (Bit 2)                              */
#define MCUCTRL_SIMOBUCK3_VDDCLPDRVSTRTRIM_Msk (0xcUL)              /*!< VDDCLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK3_VDDCLEAKAGETRIM_Pos (0UL)                 /*!< VDDCLEAKAGETRIM (Bit 0)                               */
#define MCUCTRL_SIMOBUCK3_VDDCLEAKAGETRIM_Msk (0x3UL)               /*!< VDDCLEAKAGETRIM (Bitfield-Mask: 0x03)                 */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_VDDCLVINPREFSEL_Pos (30UL)                /*!< VDDCLVINPREFSEL (Bit 30)                              */
#define MCUCTRL_SIMOBUCK4_VDDCLVINPREFSEL_Msk (0x40000000UL)        /*!< VDDCLVINPREFSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Pos (25UL)            /*!< VDDCLVACTLOWTONTRIM (Bit 25)                          */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Msk (0x3e000000UL)    /*!< VDDCLVACTLOWTONTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Pos (20UL)           /*!< VDDCLVACTLOWTOFFTRIM (Bit 20)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Msk (0x1f00000UL)    /*!< VDDCLVACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIMFINE_Pos (16UL)       /*!< VDDCLVACTLOWTOFFTRIMFINE (Bit 16)                     */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIMFINE_Msk (0xf0000UL)  /*!< VDDCLVACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)        */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Pos (11UL)           /*!< VDDCLVACTHIGHTONTRIM (Bit 11)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Msk (0xf800UL)       /*!< VDDCLVACTHIGHTONTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Pos (6UL)           /*!< VDDCLVACTHIGHTOFFTRIM (Bit 6)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Msk (0x7c0UL)       /*!< VDDCLVACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIMFINE_Pos (2UL)       /*!< VDDCLVACTHIGHTOFFTRIMFINE (Bit 2)                     */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIMFINE_Msk (0x3cUL)    /*!< VDDCLVACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Pos (0UL)             /*!< VDDCLVACTDRVSTRTRIM (Bit 0)                           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Msk (0x3UL)           /*!< VDDCLVACTDRVSTRTRIM (Bitfield-Mask: 0x03)             */
/* =======================================================  SIMOBUCK5  ======================================================= */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTONTRIM_Pos (27UL)             /*!< VDDCLVLPLOWTONTRIM (Bit 27)                           */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTONTRIM_Msk (0xf8000000UL)     /*!< VDDCLVLPLOWTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIM_Pos (22UL)            /*!< VDDCLVLPLOWTOFFTRIM (Bit 22)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIM_Msk (0x7c00000UL)     /*!< VDDCLVLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIMFINE_Pos (18UL)        /*!< VDDCLVLPLOWTOFFTRIMFINE (Bit 18)                      */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPLOWTOFFTRIMFINE_Msk (0x3c0000UL)  /*!< VDDCLVLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTONTRIM_Pos (13UL)            /*!< VDDCLVLPHIGHTONTRIM (Bit 13)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTONTRIM_Msk (0x3e000UL)       /*!< VDDCLVLPHIGHTONTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIM_Pos (8UL)            /*!< VDDCLVLPHIGHTOFFTRIM (Bit 8)                          */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIM_Msk (0x1f00UL)       /*!< VDDCLVLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIMFINE_Pos (4UL)        /*!< VDDCLVLPHIGHTOFFTRIMFINE (Bit 4)                      */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPHIGHTOFFTRIMFINE_Msk (0xf0UL)     /*!< VDDCLVLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)        */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPDRVSTRTRIM_Pos (2UL)              /*!< VDDCLVLPDRVSTRTRIM (Bit 2)                            */
#define MCUCTRL_SIMOBUCK5_VDDCLVLPDRVSTRTRIM_Msk (0xcUL)            /*!< VDDCLVLPDRVSTRTRIM (Bitfield-Mask: 0x03)              */
#define MCUCTRL_SIMOBUCK5_VDDCLVLEAKAGETRIM_Pos (0UL)               /*!< VDDCLVLEAKAGETRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK5_VDDCLVLEAKAGETRIM_Msk (0x3UL)             /*!< VDDCLVLEAKAGETRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK6  ======================================================= */
#define MCUCTRL_SIMOBUCK6_VDDFLEAKAGETRIM_Pos (30UL)                /*!< VDDFLEAKAGETRIM (Bit 30)                              */
