AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define MCUCTRL_SIMOBUCK6_VDDFLEAKAGETRIM_Msk (0xc0000000UL)        /*!< VDDFLEAKAGETRIM (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_SIMOBUCK6_VDDFINPREFSEL_Pos (29UL)                  /*!< VDDFINPREFSEL (Bit 29)                                */
#define MCUCTRL_SIMOBUCK6_VDDFINPREFSEL_Msk (0x20000000UL)          /*!< VDDFINPREFSEL (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK6_VDDFACTTRIM_Pos (23UL)                    /*!< VDDFACTTRIM (Bit 23)                                  */
#define MCUCTRL_SIMOBUCK6_VDDFACTTRIM_Msk (0x1f800000UL)            /*!< VDDFACTTRIM (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK6_VDDFACTINPREFSEL_Pos (22UL)               /*!< VDDFACTINPREFSEL (Bit 22)                             */
#define MCUCTRL_SIMOBUCK6_VDDFACTINPREFSEL_Msk (0x400000UL)         /*!< VDDFACTINPREFSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Pos (17UL)             /*!< VDDFACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTONTRIM_Msk (0x3e0000UL)       /*!< VDDFACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIM_Pos (12UL)            /*!< VDDFACTHIGHTOFFTRIM (Bit 12)                          */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIM_Msk (0x1f000UL)       /*!< VDDFACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIMFINE_Pos (8UL)         /*!< VDDFACTHIGHTOFFTRIMFINE (Bit 8)                       */
#define MCUCTRL_SIMOBUCK6_VDDFACTHIGHTOFFTRIMFINE_Msk (0xf00UL)     /*!< VDDFACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK6_VDDFACTFBTRIM_Pos (2UL)                   /*!< VDDFACTFBTRIM (Bit 2)                                 */
#define MCUCTRL_SIMOBUCK6_VDDFACTFBTRIM_Msk (0xfcUL)                /*!< VDDFACTFBTRIM (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_SIMOBUCK6_VDDFACTDRVSTRTRIM_Pos (0UL)               /*!< VDDFACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK6_VDDFACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDFACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* =======================================================  SIMOBUCK7  ======================================================= */
#define MCUCTRL_SIMOBUCK7_VDDFLPTRIM_Pos  (25UL)                    /*!< VDDFLPTRIM (Bit 25)                                   */
#define MCUCTRL_SIMOBUCK7_VDDFLPTRIM_Msk  (0x7e000000UL)            /*!< VDDFLPTRIM (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK7_VDDFLPINPREFSEL_Pos (23UL)                /*!< VDDFLPINPREFSEL (Bit 23)                              */
#define MCUCTRL_SIMOBUCK7_VDDFLPINPREFSEL_Msk (0x1800000UL)         /*!< VDDFLPINPREFSEL (Bitfield-Mask: 0x03)                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Pos (18UL)                   /*!< ZXCOMPZXTRIM (Bit 18)                                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Msk (0x7c0000UL)             /*!< ZXCOMPZXTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACTRIM_Pos (16UL)               /*!< VDDFLPFBCDACTRIM (Bit 16)                             */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACTRIM_Msk (0x30000UL)          /*!< VDDFLPFBCDACTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACEN_Pos (15UL)                 /*!< VDDFLPFBCDACEN (Bit 15)                               */
#define MCUCTRL_SIMOBUCK7_VDDFLPFBCDACEN_Msk (0x8000UL)             /*!< VDDFLPFBCDACEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Pos (13UL)               /*!< VDDFLPDRVSTRTRIM (Bit 13)                             */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Msk (0x6000UL)           /*!< VDDFLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Pos (8UL)               /*!< VDDFACTLOWTONTRIM (Bit 8)                             */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Msk (0x1f00UL)          /*!< VDDFACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Pos (3UL)              /*!< VDDFACTLOWTOFFTRIM (Bit 3)                            */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Msk (0xf8UL)           /*!< VDDFACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIMFINE_Pos (0UL)          /*!< VDDFACTLOWTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIMFINE_Msk (0x7UL)        /*!< VDDFACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x07)          */
/* =======================================================  SIMOBUCK8  ======================================================= */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Pos (23UL)               /*!< VDDFLPLOWTONTRIM (Bit 23)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTONTRIM_Msk (0xf800000UL)        /*!< VDDFLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIM_Pos (18UL)              /*!< VDDFLPLOWTOFFTRIM (Bit 18)                            */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIM_Msk (0x7c0000UL)        /*!< VDDFLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIMFINE_Pos (14UL)          /*!< VDDFLPLOWTOFFTRIMFINE (Bit 14)                        */
#define MCUCTRL_SIMOBUCK8_VDDFLPLOWTOFFTRIMFINE_Msk (0x3c000UL)     /*!< VDDFLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Pos (9UL)               /*!< VDDFLPHIGHTONTRIM (Bit 9)                             */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTONTRIM_Msk (0x3e00UL)          /*!< VDDFLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIM_Pos (4UL)              /*!< VDDFLPHIGHTOFFTRIM (Bit 4)                            */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIM_Msk (0x1f0UL)          /*!< VDDFLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIMFINE_Pos (0UL)          /*!< VDDFLPHIGHTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK8_VDDFLPHIGHTOFFTRIMFINE_Msk (0xfUL)        /*!< VDDFLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
/* =======================================================  SIMOBUCK9  ======================================================= */
#define MCUCTRL_SIMOBUCK9_VDDSLEAKAGETRIM_Pos (28UL)                /*!< VDDSLEAKAGETRIM (Bit 28)                              */
#define MCUCTRL_SIMOBUCK9_VDDSLEAKAGETRIM_Msk (0x10000000UL)        /*!< VDDSLEAKAGETRIM (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Pos (23UL)              /*!< VDDSACTLOWTONTRIM (Bit 23)                            */
#define MCUCTRL_SIMOBUCK9_VDDSACTLOWTONTRIM_Msk (0xf800000UL)       /*!< VDDSACTLOWTONTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK9_VDDSACTINPREFSEL_Pos (22UL)               /*!< VDDSACTINPREFSEL (Bit 22)                             */
#define MCUCTRL_SIMOBUCK9_VDDSACTINPREFSEL_Msk (0x400000UL)         /*!< VDDSACTINPREFSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Pos (17UL)             /*!< VDDSACTHIGHTONTRIM (Bit 17)                           */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTONTRIM_Msk (0x3e0000UL)       /*!< VDDSACTHIGHTONTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIM_Pos (12UL)            /*!< VDDSACTHIGHTOFFTRIM (Bit 12)                          */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIM_Msk (0x1f000UL)       /*!< VDDSACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)             */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIMFINE_Pos (8UL)         /*!< VDDSACTHIGHTOFFTRIMFINE (Bit 8)                       */
#define MCUCTRL_SIMOBUCK9_VDDSACTHIGHTOFFTRIMFINE_Msk (0xf00UL)     /*!< VDDSACTHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_SIMOBUCK9_VDDSACTFBTRIM_Pos (2UL)                   /*!< VDDSACTFBTRIM (Bit 2)                                 */
#define MCUCTRL_SIMOBUCK9_VDDSACTFBTRIM_Msk (0xfcUL)                /*!< VDDSACTFBTRIM (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_SIMOBUCK9_VDDSACTDRVSTRTRIM_Pos (0UL)               /*!< VDDSACTDRVSTRTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK9_VDDSACTDRVSTRTRIM_Msk (0x3UL)             /*!< VDDSACTDRVSTRTRIM (Bitfield-Mask: 0x03)               */
/* ======================================================  SIMOBUCK10  ======================================================= */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIM_Pos (24UL)            /*!< VDDSLPHIGHTOFFTRIM (Bit 24)                           */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIM_Msk (0x1f000000UL)    /*!< VDDSLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIMFINE_Pos (20UL)        /*!< VDDSLPHIGHTOFFTRIMFINE (Bit 20)                       */
#define MCUCTRL_SIMOBUCK10_VDDSLPHIGHTOFFTRIMFINE_Msk (0xf00000UL)  /*!< VDDSLPHIGHTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBTRIM_Pos (14UL)                  /*!< VDDSLPFBTRIM (Bit 14)                                 */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBTRIM_Msk (0xfc000UL)             /*!< VDDSLPFBTRIM (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACTRIM_Pos (12UL)              /*!< VDDSLPFBCDACTRIM (Bit 12)                             */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACTRIM_Msk (0x3000UL)          /*!< VDDSLPFBCDACTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACEN_Pos (11UL)                /*!< VDDSLPFBCDACEN (Bit 11)                               */
#define MCUCTRL_SIMOBUCK10_VDDSLPFBCDACEN_Msk (0x800UL)             /*!< VDDSLPFBCDACEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK10_VDDSLPDRVSTRTRIM_Pos (9UL)               /*!< VDDSLPDRVSTRTRIM (Bit 9)                              */
#define MCUCTRL_SIMOBUCK10_VDDSLPDRVSTRTRIM_Msk (0x600UL)           /*!< VDDSLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIM_Pos (4UL)             /*!< VDDSACTLOWTOFFTRIM (Bit 4)                            */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIM_Msk (0x1f0UL)         /*!< VDDSACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIMFINE_Pos (0UL)         /*!< VDDSACTLOWTOFFTRIMFINE (Bit 0)                        */
#define MCUCTRL_SIMOBUCK10_VDDSACTLOWTOFFTRIMFINE_Msk (0xfUL)       /*!< VDDSACTLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)          */
/* ======================================================  SIMOBUCK11  ======================================================= */
#define MCUCTRL_SIMOBUCK11_ENBRNOUT_Pos   (24UL)                    /*!< ENBRNOUT (Bit 24)                                     */
#define MCUCTRL_SIMOBUCK11_ENBRNOUT_Msk   (0xf000000UL)             /*!< ENBRNOUT (Bitfield-Mask: 0x0f)                        */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPOST_Pos (22UL)             /*!< TRIMCHANGEDLYPOST (Bit 22)                            */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPOST_Msk (0xc00000UL)       /*!< TRIMCHANGEDLYPOST (Bitfield-Mask: 0x03)               */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPRE_Pos (20UL)              /*!< TRIMCHANGEDLYPRE (Bit 20)                             */
#define MCUCTRL_SIMOBUCK11_TRIMCHANGEDLYPRE_Msk (0x300000UL)        /*!< TRIMCHANGEDLYPRE (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTONTRIM_Pos (15UL)              /*!< VDDSLPLOWTONTRIM (Bit 15)                             */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTONTRIM_Msk (0xf8000UL)         /*!< VDDSLPLOWTONTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIM_Pos (10UL)             /*!< VDDSLPLOWTOFFTRIM (Bit 10)                            */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIM_Msk (0x7c00UL)         /*!< VDDSLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)               */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIMFINE_Pos (6UL)          /*!< VDDSLPLOWTOFFTRIMFINE (Bit 6)                         */
#define MCUCTRL_SIMOBUCK11_VDDSLPLOWTOFFTRIMFINE_Msk (0x3c0UL)      /*!< VDDSLPLOWTOFFTRIMFINE (Bitfield-Mask: 0x0f)           */
#define MCUCTRL_SIMOBUCK11_VDDSLPINPREFSEL_Pos (5UL)                /*!< VDDSLPINPREFSEL (Bit 5)                               */
#define MCUCTRL_SIMOBUCK11_VDDSLPINPREFSEL_Msk (0x20UL)             /*!< VDDSLPINPREFSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SIMOBUCK11_VDDSLPHIGHTONTRIM_Pos (0UL)              /*!< VDDSLPHIGHTONTRIM (Bit 0)                             */
#define MCUCTRL_SIMOBUCK11_VDDSLPHIGHTONTRIM_Msk (0x1fUL)           /*!< VDDSLPHIGHTONTRIM (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK12  ======================================================= */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Pos (26UL)                    /*!< LPTRIMVDDF (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Msk (0xfc000000UL)            /*!< LPTRIMVDDF (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Pos (20UL)                   /*!< ACTTRIMVDDF (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Msk (0x3f00000UL)            /*!< ACTTRIMVDDF (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Pos (10UL)              /*!< VDDCLVBRNOUTTRIM (Bit 10)                             */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Msk (0xffc00UL)         /*!< VDDCLVBRNOUTTRIM (Bitfield-Mask: 0x3ff)               */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Pos (5UL)             /*!< VDDCLVCOMPTRIMPLUS (Bit 5)                            */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Msk (0x3e0UL)         /*!< VDDCLVCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Pos (0UL)            /*!< VDDCLVCOMPTRIMMINUS (Bit 0)                           */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Msk (0x1fUL)         /*!< VDDCLVCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
/* ======================================================  SIMOBUCK13  ======================================================= */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Pos (26UL)                    /*!< LPTRIMVDDS (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK13_LPTRIMVDDS_Msk (0xfc000000UL)            /*!< LPTRIMVDDS (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Pos (20UL)                   /*!< ACTTRIMVDDS (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK13_ACTTRIMVDDS_Msk (0x3f00000UL)            /*!< ACTTRIMVDDS (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK13_VDDSBRNOUTTRIM_Pos (10UL)                /*!< VDDSBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK13_VDDSBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDSBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMPLUS_Pos (5UL)               /*!< VDDSCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDSCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMMINUS_Pos (0UL)              /*!< VDDSCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK13_VDDSCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDSCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK14  ======================================================= */
#define MCUCTRL_SIMOBUCK14_VDDCLKGEN_Pos  (31UL)                    /*!< VDDCLKGEN (Bit 31)                                    */
#define MCUCTRL_SIMOBUCK14_VDDCLKGEN_Msk  (0x80000000UL)            /*!< VDDCLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDCLKGTRIM_Pos (29UL)                   /*!< VDDCLKGTRIM (Bit 29)                                  */
#define MCUCTRL_SIMOBUCK14_VDDCLKGTRIM_Msk (0x60000000UL)           /*!< VDDCLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDFLKGEN_Pos  (28UL)                    /*!< VDDFLKGEN (Bit 28)                                    */
#define MCUCTRL_SIMOBUCK14_VDDFLKGEN_Msk  (0x10000000UL)            /*!< VDDFLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDFLKGTRIM_Pos (26UL)                   /*!< VDDFLKGTRIM (Bit 26)                                  */
#define MCUCTRL_SIMOBUCK14_VDDFLKGTRIM_Msk (0xc000000UL)            /*!< VDDFLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDSLKGEN_Pos  (25UL)                    /*!< VDDSLKGEN (Bit 25)                                    */
#define MCUCTRL_SIMOBUCK14_VDDSLKGEN_Msk  (0x2000000UL)             /*!< VDDSLKGEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_SIMOBUCK14_VDDSLKGTRIM_Pos (23UL)                   /*!< VDDSLKGTRIM (Bit 23)                                  */
#define MCUCTRL_SIMOBUCK14_VDDSLKGTRIM_Msk (0x1800000UL)            /*!< VDDSLKGTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGEN_Pos (22UL)                   /*!< VDDCLVLKGEN (Bit 22)                                  */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGEN_Msk (0x400000UL)             /*!< VDDCLVLKGEN (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGTRIM_Pos (20UL)                 /*!< VDDCLVLKGTRIM (Bit 20)                                */
#define MCUCTRL_SIMOBUCK14_VDDCLVLKGTRIM_Msk (0x300000UL)           /*!< VDDCLVLKGTRIM (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_SIMOBUCK14_VDDFBRNOUTTRIM_Pos (10UL)                /*!< VDDFBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK14_VDDFBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDFBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMPLUS_Pos (5UL)               /*!< VDDFCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDFCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMMINUS_Pos (0UL)              /*!< VDDFCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDFCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK15  ======================================================= */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Pos (31UL)                 /*!< TRIMLATCHOVER (Bit 31)                                */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Msk (0x80000000UL)         /*!< TRIMLATCHOVER (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Pos (24UL)              /*!< ZXCOMPOFFSETTRIM (Bit 24)                             */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Msk (0x1f000000UL)      /*!< ZXCOMPOFFSETTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Pos (23UL)              /*!< VDDCRXCOMPTRIMEN (Bit 23)                             */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Msk (0x800000UL)        /*!< VDDCRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Pos (22UL)              /*!< VDDFRXCOMPTRIMEN (Bit 22)                             */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Msk (0x400000UL)        /*!< VDDFRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Pos (21UL)              /*!< VDDSRXCOMPTRIMEN (Bit 21)                             */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Msk (0x200000UL)        /*!< VDDSRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Pos (20UL)            /*!< VDDCLVRXCOMPTRIMEN (Bit 20)                           */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Msk (0x100000UL)      /*!< VDDCLVRXCOMPTRIMEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Pos (10UL)                /*!< VDDCBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDCBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Pos (5UL)               /*!< VDDCCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDCCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Pos (0UL)              /*!< VDDCCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDCCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Pos (31UL)              /*!< PWRSWVDDRCPUOVERRIDE (Bit 31)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Msk (0x80000000UL)      /*!< PWRSWVDDRCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Pos (30UL)               /*!< PWRSWVDDRCPUSTATSEL (Bit 30)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Msk (0x40000000UL)       /*!< PWRSWVDDRCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Pos (29UL)                   /*!< PWRSWVDDRCPUPGN (Bit 29)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Msk (0x20000000UL)           /*!< PWRSWVDDRCPUPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x8000000UL)         /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Pos (25UL)                 /*!< PWRSWVDDMLSTATSEL (Bit 25)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Msk (0x2000000UL)          /*!< PWRSWVDDMLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
