AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define MCUCTRL_PGACTRL1_PGACHAVCMGENQCHARGEEN_Msk (0x2000000UL)    /*!< PGACHAVCMGENQCHARGEEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENPDNB_Pos (24UL)                /*!< PGACHAVCMGENPDNB (Bit 24)                             */
#define MCUCTRL_PGACTRL1_PGACHAVCMGENPDNB_Msk (0x1000000UL)         /*!< PGACHAVCMGENPDNB (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPOUTPDNB_Pos (22UL)              /*!< PGACHAOPAMPOUTPDNB (Bit 22)                           */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPOUTPDNB_Msk (0xc00000UL)        /*!< PGACHAOPAMPOUTPDNB (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPINPDNB_Pos (20UL)               /*!< PGACHAOPAMPINPDNB (Bit 20)                            */
#define MCUCTRL_PGACTRL1_PGACHAOPAMPINPDNB_Msk (0x300000UL)         /*!< PGACHAOPAMPINPDNB (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PGACTRL1_PGACHABYPASSEN_Pos (18UL)                  /*!< PGACHABYPASSEN (Bit 18)                               */
#define MCUCTRL_PGACTRL1_PGACHABYPASSEN_Msk (0xc0000UL)             /*!< PGACHABYPASSEN (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2SEL_Pos (13UL)                 /*!< PGACHA1GAIN2SEL (Bit 13)                              */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2SEL_Msk (0x3e000UL)            /*!< PGACHA1GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2DIV2SEL_Pos (12UL)             /*!< PGACHA1GAIN2DIV2SEL (Bit 12)                          */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN2DIV2SEL_Msk (0x1000UL)         /*!< PGACHA1GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN1SEL_Pos (9UL)                  /*!< PGACHA1GAIN1SEL (Bit 9)                               */
#define MCUCTRL_PGACTRL1_PGACHA1GAIN1SEL_Msk (0xe00UL)              /*!< PGACHA1GAIN1SEL (Bitfield-Mask: 0x07)                 */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2SEL_Pos (4UL)                  /*!< PGACHA0GAIN2SEL (Bit 4)                               */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2SEL_Msk (0x1f0UL)              /*!< PGACHA0GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2DIV2SEL_Pos (3UL)              /*!< PGACHA0GAIN2DIV2SEL (Bit 3)                           */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN2DIV2SEL_Msk (0x8UL)            /*!< PGACHA0GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN1SEL_Pos (0UL)                  /*!< PGACHA0GAIN1SEL (Bit 0)                               */
#define MCUCTRL_PGACTRL1_PGACHA0GAIN1SEL_Msk (0x7UL)                /*!< PGACHA0GAIN1SEL (Bitfield-Mask: 0x07)                 */
/* =======================================================  PGACTRL2  ======================================================== */
#define MCUCTRL_PGACTRL2_PGAGAINBOVRD_Pos (31UL)                    /*!< PGAGAINBOVRD (Bit 31)                                 */
#define MCUCTRL_PGACTRL2_PGAGAINBOVRD_Msk (0x80000000UL)            /*!< PGAGAINBOVRD (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENQCHARGEEN_Pos (25UL)           /*!< PGACHBVCMGENQCHARGEEN (Bit 25)                        */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENQCHARGEEN_Msk (0x2000000UL)    /*!< PGACHBVCMGENQCHARGEEN (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENPDNB_Pos (24UL)                /*!< PGACHBVCMGENPDNB (Bit 24)                             */
#define MCUCTRL_PGACTRL2_PGACHBVCMGENPDNB_Msk (0x1000000UL)         /*!< PGACHBVCMGENPDNB (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPOUTPDNB_Pos (22UL)              /*!< PGACHBOPAMPOUTPDNB (Bit 22)                           */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPOUTPDNB_Msk (0xc00000UL)        /*!< PGACHBOPAMPOUTPDNB (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPINPDNB_Pos (20UL)               /*!< PGACHBOPAMPINPDNB (Bit 20)                            */
#define MCUCTRL_PGACTRL2_PGACHBOPAMPINPDNB_Msk (0x300000UL)         /*!< PGACHBOPAMPINPDNB (Bitfield-Mask: 0x03)               */
#define MCUCTRL_PGACTRL2_PGACHBBYPASSEN_Pos (18UL)                  /*!< PGACHBBYPASSEN (Bit 18)                               */
#define MCUCTRL_PGACTRL2_PGACHBBYPASSEN_Msk (0xc0000UL)             /*!< PGACHBBYPASSEN (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2SEL_Pos (13UL)                 /*!< PGACHB1GAIN2SEL (Bit 13)                              */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2SEL_Msk (0x3e000UL)            /*!< PGACHB1GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2DIV2SEL_Pos (12UL)             /*!< PGACHB1GAIN2DIV2SEL (Bit 12)                          */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN2DIV2SEL_Msk (0x1000UL)         /*!< PGACHB1GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN1SEL_Pos (9UL)                  /*!< PGACHB1GAIN1SEL (Bit 9)                               */
#define MCUCTRL_PGACTRL2_PGACHB1GAIN1SEL_Msk (0xe00UL)              /*!< PGACHB1GAIN1SEL (Bitfield-Mask: 0x07)                 */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2SEL_Pos (4UL)                  /*!< PGACHB0GAIN2SEL (Bit 4)                               */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2SEL_Msk (0x1f0UL)              /*!< PGACHB0GAIN2SEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2DIV2SEL_Pos (3UL)              /*!< PGACHB0GAIN2DIV2SEL (Bit 3)                           */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN2DIV2SEL_Msk (0x8UL)            /*!< PGACHB0GAIN2DIV2SEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN1SEL_Pos (0UL)                  /*!< PGACHB0GAIN1SEL (Bit 0)                               */
#define MCUCTRL_PGACTRL2_PGACHB0GAIN1SEL_Msk (0x7UL)                /*!< PGACHB0GAIN1SEL (Bitfield-Mask: 0x07)                 */
/* =====================================================  AUDADCPWRDLY  ====================================================== */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR1_Pos (8UL)                   /*!< AUDADCPWR1 (Bit 8)                                    */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR1_Msk (0xff00UL)              /*!< AUDADCPWR1 (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR0_Pos (0UL)                   /*!< AUDADCPWR0 (Bit 0)                                    */
#define MCUCTRL_AUDADCPWRDLY_AUDADCPWR0_Msk (0xffUL)                /*!< AUDADCPWR0 (Bitfield-Mask: 0xff)                      */
/* =======================================================  SDIO0CTRL  ======================================================= */
#define MCUCTRL_SDIO0CTRL_SDIO0DATOPENDRAINEN_Pos (18UL)            /*!< SDIO0DATOPENDRAINEN (Bit 18)                          */
#define MCUCTRL_SDIO0CTRL_SDIO0DATOPENDRAINEN_Msk (0x40000UL)       /*!< SDIO0DATOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO0CTRL_SDIO0CMDOPENDRAINEN_Pos (17UL)            /*!< SDIO0CMDOPENDRAINEN (Bit 17)                          */
#define MCUCTRL_SDIO0CTRL_SDIO0CMDOPENDRAINEN_Msk (0x20000UL)       /*!< SDIO0CMDOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Pos (15UL)                 /*!< SDIO0XINCLKSEL (Bit 15)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Msk (0x18000UL)            /*!< SDIO0XINCLKSEL (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_SDIO0CTRL_SDIO0ASYNCWKUPENA_Pos (14UL)              /*!< SDIO0ASYNCWKUPENA (Bit 14)                            */
#define MCUCTRL_SDIO0CTRL_SDIO0ASYNCWKUPENA_Msk (0x4000UL)          /*!< SDIO0ASYNCWKUPENA (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYSEL_Pos (10UL)                /*!< SDIO0OTAPDLYSEL (Bit 10)                              */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYSEL_Msk (0x3c00UL)            /*!< SDIO0OTAPDLYSEL (Bitfield-Mask: 0x0f)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYENA_Pos (9UL)                 /*!< SDIO0OTAPDLYENA (Bit 9)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYENA_Msk (0x200UL)             /*!< SDIO0OTAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYSEL_Pos (4UL)                 /*!< SDIO0ITAPDLYSEL (Bit 4)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYSEL_Msk (0x1f0UL)             /*!< SDIO0ITAPDLYSEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYENA_Pos (3UL)                 /*!< SDIO0ITAPDLYENA (Bit 3)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYENA_Msk (0x8UL)               /*!< SDIO0ITAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPCHGWIN_Pos (2UL)                 /*!< SDIO0ITAPCHGWIN (Bit 2)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPCHGWIN_Msk (0x4UL)               /*!< SDIO0ITAPCHGWIN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKEN_Pos (1UL)                   /*!< SDIO0XINCLKEN (Bit 1)                                 */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKEN_Msk (0x2UL)                 /*!< SDIO0XINCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SDIO0CTRL_SDIO0SYSCLKEN_Pos (0UL)                   /*!< SDIO0SYSCLKEN (Bit 0)                                 */
#define MCUCTRL_SDIO0CTRL_SDIO0SYSCLKEN_Msk (0x1UL)                 /*!< SDIO0SYSCLKEN (Bitfield-Mask: 0x01)                   */
/* =======================================================  SDIO1CTRL  ======================================================= */
#define MCUCTRL_SDIO1CTRL_SDIO1DATOPENDRAINEN_Pos (18UL)            /*!< SDIO1DATOPENDRAINEN (Bit 18)                          */
#define MCUCTRL_SDIO1CTRL_SDIO1DATOPENDRAINEN_Msk (0x40000UL)       /*!< SDIO1DATOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO1CTRL_SDIO1CMDOPENDRAINEN_Pos (17UL)            /*!< SDIO1CMDOPENDRAINEN (Bit 17)                          */
#define MCUCTRL_SDIO1CTRL_SDIO1CMDOPENDRAINEN_Msk (0x20000UL)       /*!< SDIO1CMDOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Pos (15UL)                 /*!< SDIO1XINCLKSEL (Bit 15)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Msk (0x18000UL)            /*!< SDIO1XINCLKSEL (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_SDIO1CTRL_SDIO1ASYNCWKUPENA_Pos (14UL)              /*!< SDIO1ASYNCWKUPENA (Bit 14)                            */
#define MCUCTRL_SDIO1CTRL_SDIO1ASYNCWKUPENA_Msk (0x4000UL)          /*!< SDIO1ASYNCWKUPENA (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYSEL_Pos (10UL)                /*!< SDIO1OTAPDLYSEL (Bit 10)                              */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYSEL_Msk (0x3c00UL)            /*!< SDIO1OTAPDLYSEL (Bitfield-Mask: 0x0f)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYENA_Pos (9UL)                 /*!< SDIO1OTAPDLYENA (Bit 9)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYENA_Msk (0x200UL)             /*!< SDIO1OTAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYSEL_Pos (4UL)                 /*!< SDIO1ITAPDLYSEL (Bit 4)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYSEL_Msk (0x1f0UL)             /*!< SDIO1ITAPDLYSEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYENA_Pos (3UL)                 /*!< SDIO1ITAPDLYENA (Bit 3)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYENA_Msk (0x8UL)               /*!< SDIO1ITAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPCHGWIN_Pos (2UL)                 /*!< SDIO1ITAPCHGWIN (Bit 2)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPCHGWIN_Msk (0x4UL)               /*!< SDIO1ITAPCHGWIN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKEN_Pos (1UL)                   /*!< SDIO1XINCLKEN (Bit 1)                                 */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKEN_Msk (0x2UL)                 /*!< SDIO1XINCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SDIO1CTRL_SDIO1SYSCLKEN_Pos (0UL)                   /*!< SDIO1SYSCLKEN (Bit 0)                                 */
#define MCUCTRL_SDIO1CTRL_SDIO1SYSCLKEN_Msk (0x1UL)                 /*!< SDIO1SYSCLKEN (Bitfield-Mask: 0x01)                   */
/* ========================================================  PDMCTRL  ======================================================== */
#define MCUCTRL_PDMCTRL_PDMGLOBALEN_Pos   (0UL)                     /*!< PDMGLOBALEN (Bit 0)                                   */
#define MCUCTRL_PDMCTRL_PDMGLOBALEN_Msk   (0x1UL)                   /*!< PDMGLOBALEN (Bitfield-Mask: 0x01)                     */
/* ========================================================  DSIBIST  ======================================================== */
#define MCUCTRL_DSIBIST_DSIBISTDONE_Pos   (31UL)                    /*!< DSIBISTDONE (Bit 31)                                  */
#define MCUCTRL_DSIBIST_DSIBISTDONE_Msk   (0x80000000UL)            /*!< DSIBISTDONE (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESC_Pos (30UL)                  /*!< DSIBISTERRRXESC (Bit 30)                              */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESC_Msk (0x40000000UL)          /*!< DSIBISTERRRXESC (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESCSYNC_Pos (29UL)              /*!< DSIBISTERRRXESCSYNC (Bit 29)                          */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESCSYNC_Msk (0x20000000UL)      /*!< DSIBISTERRRXESCSYNC (Bitfield-Mask: 0x01)             */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHS_Pos (28UL)                   /*!< DSIBISTERRRXHS (Bit 28)                               */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHS_Msk (0x10000000UL)           /*!< DSIBISTERRRXHS (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHSSYNC_Pos (27UL)               /*!< DSIBISTERRRXHSSYNC (Bit 27)                           */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHSSYNC_Msk (0x8000000UL)        /*!< DSIBISTERRRXHSSYNC (Bitfield-Mask: 0x01)              */
#define MCUCTRL_DSIBIST_DSIBISTSEED_Pos   (8UL)                     /*!< DSIBISTSEED (Bit 8)                                   */
#define MCUCTRL_DSIBIST_DSIBISTSEED_Msk   (0xff00UL)                /*!< DSIBISTSEED (Bitfield-Mask: 0xff)                     */
#define MCUCTRL_DSIBIST_DSIBISTMODE_Pos   (2UL)                     /*!< DSIBISTMODE (Bit 2)                                   */
#define MCUCTRL_DSIBIST_DSIBISTMODE_Msk   (0xcUL)                   /*!< DSIBISTMODE (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_DSIBIST_DSIBISTFORCEERR_Pos (1UL)                   /*!< DSIBISTFORCEERR (Bit 1)                               */
#define MCUCTRL_DSIBIST_DSIBISTFORCEERR_Msk (0x2UL)                 /*!< DSIBISTFORCEERR (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_DSIBIST_DSIBISTLP_Pos     (0UL)                     /*!< DSIBISTLP (Bit 0)                                     */
#define MCUCTRL_DSIBIST_DSIBISTLP_Msk     (0x1UL)                   /*!< DSIBISTLP (Bitfield-Mask: 0x01)                       */
/* ======================================================  MMSMISCCTRL  ====================================================== */
#define MCUCTRL_MMSMISCCTRL_DISPSRAMCHK_Pos (1UL)                   /*!< DISPSRAMCHK (Bit 1)                                   */
#define MCUCTRL_MMSMISCCTRL_DISPSRAMCHK_Msk (0x2UL)                 /*!< DISPSRAMCHK (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_MMSMISCCTRL_GFXSRAMCHK_Pos (0UL)                    /*!< GFXSRAMCHK (Bit 0)                                    */
#define MCUCTRL_MMSMISCCTRL_GFXSRAMCHK_Msk (0x1UL)                  /*!< GFXSRAMCHK (Bitfield-Mask: 0x01)                      */
/* ======================================================  FLASHWPROT4  ====================================================== */
#define MCUCTRL_FLASHWPROT4_FW4BITS_Pos   (0UL)                     /*!< FW4BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT4_FW4BITS_Msk   (0xffffffffUL)            /*!< FW4BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT5  ====================================================== */
#define MCUCTRL_FLASHWPROT5_FW5BITS_Pos   (0UL)                     /*!< FW5BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT5_FW5BITS_Msk   (0xffffffffUL)            /*!< FW5BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT6  ====================================================== */
#define MCUCTRL_FLASHWPROT6_FW6BITS_Pos   (0UL)                     /*!< FW6BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT6_FW6BITS_Msk   (0xffffffffUL)            /*!< FW6BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT7  ====================================================== */
#define MCUCTRL_FLASHWPROT7_FW7BITS_Pos   (0UL)                     /*!< FW7BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT7_FW7BITS_Msk   (0xffffffffUL)            /*!< FW7BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT4  ====================================================== */
#define MCUCTRL_FLASHRPROT4_FR4BITS_Pos   (0UL)                     /*!< FR4BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT4_FR4BITS_Msk   (0xffffffffUL)            /*!< FR4BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT5  ====================================================== */
#define MCUCTRL_FLASHRPROT5_FR5BITS_Pos   (0UL)                     /*!< FR5BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT5_FR5BITS_Msk   (0xffffffffUL)            /*!< FR5BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT6  ====================================================== */
#define MCUCTRL_FLASHRPROT6_FR6BITS_Pos   (0UL)                     /*!< FR6BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT6_FR6BITS_Msk   (0xffffffffUL)            /*!< FR6BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT7  ====================================================== */
#define MCUCTRL_FLASHRPROT7_FR7BITS_Pos   (0UL)                     /*!< FR7BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT7_FR7BITS_Msk   (0xffffffffUL)            /*!< FR7BITS (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  PWRSW2  ========================================================= */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXOVERRIDE_Pos (2UL)                /*!< PWRSWVDDGFXOVERRIDE (Bit 2)                           */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXOVERRIDE_Msk (0x4UL)              /*!< PWRSWVDDGFXOVERRIDE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXSTATSEL_Pos (1UL)                 /*!< PWRSWVDDGFXSTATSEL (Bit 1)                            */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXSTATSEL_Msk (0x2UL)               /*!< PWRSWVDDGFXSTATSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXDYNSEL_Pos (0UL)                  /*!< PWRSWVDDGFXDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW2_PWRSWVDDGFXDYNSEL_Msk (0x1UL)                /*!< PWRSWVDDGFXDYNSEL (Bitfield-Mask: 0x01)               */
/* ========================================================  CPUCFG  ========================================================= */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Pos   (4UL)                     /*!< CFGNSSTCALIB (Bit 4)                                  */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Msk   (0x3ffffff0UL)            /*!< CFGNSSTCALIB (Bitfield-Mask: 0x3ffffff)               */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Pos   (3UL)                     /*!< INITL1RSTDIS (Bit 3)                                  */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Msk   (0x8UL)                   /*!< INITL1RSTDIS (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Pos    (2UL)                     /*!< INITPAHBDIS (Bit 2)                                   */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Msk    (0x4UL)                   /*!< INITPAHBDIS (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_CPUCFG_INITTCMDIS_Pos     (0UL)                     /*!< INITTCMDIS (Bit 0)                                    */
#define MCUCTRL_CPUCFG_INITTCMDIS_Msk     (0x3UL)                   /*!< INITTCMDIS (Bitfield-Mask: 0x03)                      */
/* ========================================================  PLLCTL0  ======================================================== */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_Pos (31UL)                   /*!< SYSPLLVDDFPDNB (Bit 31)                               */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDNB_Msk (0x80000000UL)           /*!< SYSPLLVDDFPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_Pos (30UL)                   /*!< SYSPLLVDDHPDNB (Bit 30)                               */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDNB_Msk (0x40000000UL)           /*!< SYSPLLVDDHPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Pos     (29UL)                    /*!< SYSPLLPDB (Bit 29)                                    */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Msk     (0x20000000UL)            /*!< SYSPLLPDB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_VCOSELECT_Pos     (9UL)                     /*!< VCOSELECT (Bit 9)                                     */
#define MCUCTRL_PLLCTL0_VCOSELECT_Msk     (0x200UL)                 /*!< VCOSELECT (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_BYPASS_Pos        (8UL)                     /*!< BYPASS (Bit 8)                                        */
#define MCUCTRL_PLLCTL0_BYPASS_Msk        (0x100UL)                 /*!< BYPASS (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_PLLCTL0_FREFSEL_Pos       (5UL)                     /*!< FREFSEL (Bit 5)                                       */
#define MCUCTRL_PLLCTL0_FREFSEL_Msk       (0x20UL)                  /*!< FREFSEL (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_PLLCTL0_DACPD_Pos         (4UL)                     /*!< DACPD (Bit 4)                                         */
#define MCUCTRL_PLLCTL0_DACPD_Msk         (0x10UL)                  /*!< DACPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_DSMPD_Pos         (3UL)                     /*!< DSMPD (Bit 3)                                         */
#define MCUCTRL_PLLCTL0_DSMPD_Msk         (0x8UL)                   /*!< DSMPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Pos  (2UL)                     /*!< FOUT4PHASEPD (Bit 2)                                  */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Msk  (0x4UL)                   /*!< FOUT4PHASEPD (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Pos (1UL)                     /*!< FOUTPOSTDIVPD (Bit 1)                                 */
