AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =======================================================  INTERRUPT  ======================================================= */
#define OTP_INTERRUPT_IERNGCLKOFF_Pos     (25UL)                    /*!< IERNGCLKOFF (Bit 25)                                  */
#define OTP_INTERRUPT_IERNGCLKOFF_Msk     (0x2000000UL)             /*!< IERNGCLKOFF (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_IERNGFAIL_Pos       (24UL)                    /*!< IERNGFAIL (Bit 24)                                    */
#define OTP_INTERRUPT_IERNGFAIL_Msk       (0x1000000UL)             /*!< IERNGFAIL (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_IEPARITYCRITREG_Pos (22UL)                    /*!< IEPARITYCRITREG (Bit 22)                              */
#define OTP_INTERRUPT_IEPARITYCRITREG_Msk (0x400000UL)              /*!< IEPARITYCRITREG (Bitfield-Mask: 0x01)                 */
#define OTP_INTERRUPT_IEPARITYPSM_Pos     (21UL)                    /*!< IEPARITYPSM (Bit 21)                                  */
#define OTP_INTERRUPT_IEPARITYPSM_Msk     (0x200000UL)              /*!< IEPARITYPSM (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_IEACCESSPERMISSION_Pos (20UL)                 /*!< IEACCESSPERMISSION (Bit 20)                           */
#define OTP_INTERRUPT_IEACCESSPERMISSION_Msk (0x100000UL)           /*!< IEACCESSPERMISSION (Bitfield-Mask: 0x01)              */
#define OTP_INTERRUPT_IESHIELFFAULT_Pos   (19UL)                    /*!< IESHIELFFAULT (Bit 19)                                */
#define OTP_INTERRUPT_IESHIELFFAULT_Msk   (0x80000UL)               /*!< IESHIELFFAULT (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_IEPARITYINPUT_Pos   (18UL)                    /*!< IEPARITYINPUT (Bit 18)                                */
#define OTP_INTERRUPT_IEPARITYINPUT_Msk   (0x40000UL)               /*!< IEPARITYINPUT (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_IEOUTDATA_Pos       (17UL)                    /*!< IEOUTDATA (Bit 17)                                    */
#define OTP_INTERRUPT_IEOUTDATA_Msk       (0x20000UL)               /*!< IEOUTDATA (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_IEPWRSUPPLY_Pos     (16UL)                    /*!< IEPWRSUPPLY (Bit 16)                                  */
#define OTP_INTERRUPT_IEPWRSUPPLY_Msk     (0x10000UL)               /*!< IEPWRSUPPLY (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_RNGCLKOFF_Pos       (9UL)                     /*!< RNGCLKOFF (Bit 9)                                     */
#define OTP_INTERRUPT_RNGCLKOFF_Msk       (0x200UL)                 /*!< RNGCLKOFF (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_RNGFAIL_Pos         (8UL)                     /*!< RNGFAIL (Bit 8)                                       */
#define OTP_INTERRUPT_RNGFAIL_Msk         (0x100UL)                 /*!< RNGFAIL (Bitfield-Mask: 0x01)                         */
#define OTP_INTERRUPT_PARITYCRITREG_Pos   (6UL)                     /*!< PARITYCRITREG (Bit 6)                                 */
#define OTP_INTERRUPT_PARITYCRITREG_Msk   (0x40UL)                  /*!< PARITYCRITREG (Bitfield-Mask: 0x01)                   */
#define OTP_INTERRUPT_PARITYPSM_Pos       (5UL)                     /*!< PARITYPSM (Bit 5)                                     */
#define OTP_INTERRUPT_PARITYPSM_Msk       (0x20UL)                  /*!< PARITYPSM (Bitfield-Mask: 0x01)                       */
#define OTP_INTERRUPT_ACCESSPERMISSION_Pos (4UL)                    /*!< ACCESSPERMISSION (Bit 4)                              */
#define OTP_INTERRUPT_ACCESSPERMISSION_Msk (0x10UL)                 /*!< ACCESSPERMISSION (Bitfield-Mask: 0x01)                */
#define OTP_INTERRUPT_SHIELDFAULT_Pos     (3UL)                     /*!< SHIELDFAULT (Bit 3)                                   */
#define OTP_INTERRUPT_SHIELDFAULT_Msk     (0x8UL)                   /*!< SHIELDFAULT (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_PARITYINPUT_Pos     (2UL)                     /*!< PARITYINPUT (Bit 2)                                   */
#define OTP_INTERRUPT_PARITYINPUT_Msk     (0x4UL)                   /*!< PARITYINPUT (Bitfield-Mask: 0x01)                     */
#define OTP_INTERRUPT_OUTDATA_Pos         (1UL)                     /*!< OUTDATA (Bit 1)                                       */
#define OTP_INTERRUPT_OUTDATA_Msk         (0x2UL)                   /*!< OUTDATA (Bitfield-Mask: 0x01)                         */
#define OTP_INTERRUPT_PWRSUPPLY_Pos       (0UL)                     /*!< PWRSUPPLY (Bit 0)                                     */
#define OTP_INTERRUPT_PWRSUPPLY_Msk       (0x1UL)                   /*!< PWRSUPPLY (Bitfield-Mask: 0x01)                       */
/* ========================================================  PTMSTAT  ======================================================== */
#define OTP_PTMSTAT_FAILCNT_Pos           (8UL)                     /*!< FAILCNT (Bit 8)                                       */
#define OTP_PTMSTAT_FAILCNT_Msk           (0xf00UL)                 /*!< FAILCNT (Bitfield-Mask: 0x0f)                         */
#define OTP_PTMSTAT_FORBID_Pos            (4UL)                     /*!< FORBID (Bit 4)                                        */
#define OTP_PTMSTAT_FORBID_Msk            (0x10UL)                  /*!< FORBID (Bitfield-Mask: 0x01)                          */
#define OTP_PTMSTAT_INCORRECT_Pos         (3UL)                     /*!< INCORRECT (Bit 3)                                     */
#define OTP_PTMSTAT_INCORRECT_Msk         (0x8UL)                   /*!< INCORRECT (Bitfield-Mask: 0x01)                       */
#define OTP_PTMSTAT_WARNING_Pos           (2UL)                     /*!< WARNING (Bit 2)                                       */
#define OTP_PTMSTAT_WARNING_Msk           (0x4UL)                   /*!< WARNING (Bitfield-Mask: 0x01)                         */
#define OTP_PTMSTAT_ERROR_Pos             (1UL)                     /*!< ERROR (Bit 1)                                         */
#define OTP_PTMSTAT_ERROR_Msk             (0x2UL)                   /*!< ERROR (Bitfield-Mask: 0x01)                           */
#define OTP_PTMSTAT_BUSY_Pos              (0UL)                     /*!< BUSY (Bit 0)                                          */
#define OTP_PTMSTAT_BUSY_Msk              (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                           PDM0                                            ================ */
/* =========================================================================================================================== */

