AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =========================================================  CTRL  ========================================================== */
#define SECURITY_CTRL_CRCERROR_Pos        (31UL)                    /*!< CRCERROR (Bit 31)                                     */
#define SECURITY_CTRL_CRCERROR_Msk        (0x80000000UL)            /*!< CRCERROR (Bitfield-Mask: 0x01)                        */
#define SECURITY_CTRL_FUNCTION_Pos        (4UL)                     /*!< FUNCTION (Bit 4)                                      */
#define SECURITY_CTRL_FUNCTION_Msk        (0xf0UL)                  /*!< FUNCTION (Bitfield-Mask: 0x0f)                        */
#define SECURITY_CTRL_ENABLE_Pos          (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define SECURITY_CTRL_ENABLE_Msk          (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  SRCADDR  ======================================================== */
#define SECURITY_SRCADDR_ADDR_Pos         (0UL)                     /*!< ADDR (Bit 0)                                          */
#define SECURITY_SRCADDR_ADDR_Msk         (0xffffffffUL)            /*!< ADDR (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  LEN  ========================================================== */
#define SECURITY_LEN_LEN_Pos              (2UL)                     /*!< LEN (Bit 2)                                           */
#define SECURITY_LEN_LEN_Msk              (0xfffffcUL)              /*!< LEN (Bitfield-Mask: 0x3fffff)                         */
/* ========================================================  RESULT  ========================================================= */
#define SECURITY_RESULT_CRC_Pos           (0UL)                     /*!< CRC (Bit 0)                                           */
#define SECURITY_RESULT_CRC_Msk           (0xffffffffUL)            /*!< CRC (Bitfield-Mask: 0xffffffff)                       */
/* =======================================================  LOCKCTRL  ======================================================== */
#define SECURITY_LOCKCTRL_SELECT_Pos      (0UL)                     /*!< SELECT (Bit 0)                                        */
#define SECURITY_LOCKCTRL_SELECT_Msk      (0xffUL)                  /*!< SELECT (Bitfield-Mask: 0xff)                          */
/* =======================================================  LOCKSTAT  ======================================================== */
#define SECURITY_LOCKSTAT_STATUS_Pos      (0UL)                     /*!< STATUS (Bit 0)                                        */
#define SECURITY_LOCKSTAT_STATUS_Msk      (0xffffffffUL)            /*!< STATUS (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  KEY0  ========================================================== */
#define SECURITY_KEY0_KEY0_Pos            (0UL)                     /*!< KEY0 (Bit 0)                                          */
#define SECURITY_KEY0_KEY0_Msk            (0xffffffffUL)            /*!< KEY0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY1  ========================================================== */
#define SECURITY_KEY1_KEY1_Pos            (0UL)                     /*!< KEY1 (Bit 0)                                          */
#define SECURITY_KEY1_KEY1_Msk            (0xffffffffUL)            /*!< KEY1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY2  ========================================================== */
#define SECURITY_KEY2_KEY2_Pos            (0UL)                     /*!< KEY2 (Bit 0)                                          */
#define SECURITY_KEY2_KEY2_Msk            (0xffffffffUL)            /*!< KEY2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY3  ========================================================== */
#define SECURITY_KEY3_KEY3_Pos            (0UL)                     /*!< KEY3 (Bit 0)                                          */
#define SECURITY_KEY3_KEY3_Msk            (0xffffffffUL)            /*!< KEY3 (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                            SSC                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  SRLOCKS  ======================================================== */
#define SSC_SRLOCKS_LOCKSSRAMPROT_Pos     (10UL)                    /*!< LOCKSSRAMPROT (Bit 10)                                */
#define SSC_SRLOCKS_LOCKSSRAMPROT_Msk     (0x400UL)                 /*!< LOCKSSRAMPROT (Bitfield-Mask: 0x01)                   */
#define SSC_SRLOCKS_LOCKSVTAIRCR_Pos      (9UL)                     /*!< LOCKSVTAIRCR (Bit 9)                                  */
#define SSC_SRLOCKS_LOCKSVTAIRCR_Msk      (0x200UL)                 /*!< LOCKSVTAIRCR (Bitfield-Mask: 0x01)                    */
#define SSC_SRLOCKS_LOCKNSVTOR_Pos        (8UL)                     /*!< LOCKNSVTOR (Bit 8)                                    */
#define SSC_SRLOCKS_LOCKNSVTOR_Msk        (0x100UL)                 /*!< LOCKNSVTOR (Bitfield-Mask: 0x01)                      */
#define SSC_SRLOCKS_LOCKSMPU_Pos          (7UL)                     /*!< LOCKSMPU (Bit 7)                                      */
#define SSC_SRLOCKS_LOCKSMPU_Msk          (0x80UL)                  /*!< LOCKSMPU (Bitfield-Mask: 0x01)                        */
#define SSC_SRLOCKS_LOCKNSMPU_Pos         (6UL)                     /*!< LOCKNSMPU (Bit 6)                                     */
#define SSC_SRLOCKS_LOCKNSMPU_Msk         (0x40UL)                  /*!< LOCKNSMPU (Bitfield-Mask: 0x01)                       */
#define SSC_SRLOCKS_LOCKSAU_Pos           (5UL)                     /*!< LOCKSAU (Bit 5)                                       */
#define SSC_SRLOCKS_LOCKSAU_Msk           (0x20UL)                  /*!< LOCKSAU (Bitfield-Mask: 0x01)                         */
#define SSC_SRLOCKS_LOCKTCM_Pos           (4UL)                     /*!< LOCKTCM (Bit 4)                                       */
#define SSC_SRLOCKS_LOCKTCM_Msk           (0x10UL)                  /*!< LOCKTCM (Bitfield-Mask: 0x01)                         */
#define SSC_SRLOCKS_LOCKITGU_Pos          (3UL)                     /*!< LOCKITGU (Bit 3)                                      */
#define SSC_SRLOCKS_LOCKITGU_Msk          (0x8UL)                   /*!< LOCKITGU (Bitfield-Mask: 0x01)                        */
#define SSC_SRLOCKS_LOCKDTGU_Pos          (2UL)                     /*!< LOCKDTGU (Bit 2)                                      */
#define SSC_SRLOCKS_LOCKDTGU_Msk          (0x4UL)                   /*!< LOCKDTGU (Bitfield-Mask: 0x01)                        */
#define SSC_SRLOCKS_LOCKPAHB_Pos          (1UL)                     /*!< LOCKPAHB (Bit 1)                                      */
#define SSC_SRLOCKS_LOCKPAHB_Msk          (0x2UL)                   /*!< LOCKPAHB (Bitfield-Mask: 0x01)                        */
#define SSC_SRLOCKS_LOCKDCAIC_Pos         (0UL)                     /*!< LOCKDCAIC (Bit 0)                                     */
#define SSC_SRLOCKS_LOCKDCAIC_Msk         (0x1UL)                   /*!< LOCKDCAIC (Bitfield-Mask: 0x01)                       */
/* ========================================================  SSLOCKS  ======================================================== */
#define SSC_SSLOCKS_TCMALLSECDISABLE_Pos  (0UL)                     /*!< TCMALLSECDISABLE (Bit 0)                              */
#define SSC_SSLOCKS_TCMALLSECDISABLE_Msk  (0x1UL)                   /*!< TCMALLSECDISABLE (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          STIMER                                           ================ */
/* =========================================================================================================================== */

