AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define TIMER_OUTCFG24_OUTCFG98_Pos       (16UL)                    /*!< OUTCFG98 (Bit 16)                                     */
#define TIMER_OUTCFG24_OUTCFG98_Msk       (0x3f0000UL)              /*!< OUTCFG98 (Bitfield-Mask: 0x3f)                        */
#define TIMER_OUTCFG24_OUTCFG97_Pos       (8UL)                     /*!< OUTCFG97 (Bit 8)                                      */
#define TIMER_OUTCFG24_OUTCFG97_Msk       (0x3f00UL)                /*!< OUTCFG97 (Bitfield-Mask: 0x3f)                        */
#define TIMER_OUTCFG24_OUTCFG96_Pos       (0UL)                     /*!< OUTCFG96 (Bit 0)                                      */
#define TIMER_OUTCFG24_OUTCFG96_Msk       (0x3fUL)                  /*!< OUTCFG96 (Bitfield-Mask: 0x3f)                        */
/* =======================================================  OUTCFG25  ======================================================== */
#define TIMER_OUTCFG25_OUTCFG103_Pos      (24UL)                    /*!< OUTCFG103 (Bit 24)                                    */
#define TIMER_OUTCFG25_OUTCFG103_Msk      (0x3f000000UL)            /*!< OUTCFG103 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG25_OUTCFG102_Pos      (16UL)                    /*!< OUTCFG102 (Bit 16)                                    */
#define TIMER_OUTCFG25_OUTCFG102_Msk      (0x3f0000UL)              /*!< OUTCFG102 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG25_OUTCFG101_Pos      (8UL)                     /*!< OUTCFG101 (Bit 8)                                     */
#define TIMER_OUTCFG25_OUTCFG101_Msk      (0x3f00UL)                /*!< OUTCFG101 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG25_OUTCFG100_Pos      (0UL)                     /*!< OUTCFG100 (Bit 0)                                     */
#define TIMER_OUTCFG25_OUTCFG100_Msk      (0x3fUL)                  /*!< OUTCFG100 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG26  ======================================================== */
#define TIMER_OUTCFG26_OUTCFG107_Pos      (24UL)                    /*!< OUTCFG107 (Bit 24)                                    */
#define TIMER_OUTCFG26_OUTCFG107_Msk      (0x3f000000UL)            /*!< OUTCFG107 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG26_OUTCFG106_Pos      (16UL)                    /*!< OUTCFG106 (Bit 16)                                    */
#define TIMER_OUTCFG26_OUTCFG106_Msk      (0x3f0000UL)              /*!< OUTCFG106 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG26_OUTCFG105_Pos      (8UL)                     /*!< OUTCFG105 (Bit 8)                                     */
#define TIMER_OUTCFG26_OUTCFG105_Msk      (0x3f00UL)                /*!< OUTCFG105 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG26_OUTCFG104_Pos      (0UL)                     /*!< OUTCFG104 (Bit 0)                                     */
#define TIMER_OUTCFG26_OUTCFG104_Msk      (0x3fUL)                  /*!< OUTCFG104 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG27  ======================================================== */
#define TIMER_OUTCFG27_OUTCFG111_Pos      (24UL)                    /*!< OUTCFG111 (Bit 24)                                    */
#define TIMER_OUTCFG27_OUTCFG111_Msk      (0x3f000000UL)            /*!< OUTCFG111 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG27_OUTCFG110_Pos      (16UL)                    /*!< OUTCFG110 (Bit 16)                                    */
#define TIMER_OUTCFG27_OUTCFG110_Msk      (0x3f0000UL)              /*!< OUTCFG110 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG27_OUTCFG109_Pos      (8UL)                     /*!< OUTCFG109 (Bit 8)                                     */
#define TIMER_OUTCFG27_OUTCFG109_Msk      (0x3f00UL)                /*!< OUTCFG109 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG27_OUTCFG108_Pos      (0UL)                     /*!< OUTCFG108 (Bit 0)                                     */
#define TIMER_OUTCFG27_OUTCFG108_Msk      (0x3fUL)                  /*!< OUTCFG108 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG28  ======================================================== */
#define TIMER_OUTCFG28_OUTCFG115_Pos      (24UL)                    /*!< OUTCFG115 (Bit 24)                                    */
#define TIMER_OUTCFG28_OUTCFG115_Msk      (0x3f000000UL)            /*!< OUTCFG115 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG28_OUTCFG114_Pos      (16UL)                    /*!< OUTCFG114 (Bit 16)                                    */
#define TIMER_OUTCFG28_OUTCFG114_Msk      (0x3f0000UL)              /*!< OUTCFG114 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG28_OUTCFG113_Pos      (8UL)                     /*!< OUTCFG113 (Bit 8)                                     */
#define TIMER_OUTCFG28_OUTCFG113_Msk      (0x3f00UL)                /*!< OUTCFG113 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG28_OUTCFG112_Pos      (0UL)                     /*!< OUTCFG112 (Bit 0)                                     */
#define TIMER_OUTCFG28_OUTCFG112_Msk      (0x3fUL)                  /*!< OUTCFG112 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG29  ======================================================== */
#define TIMER_OUTCFG29_OUTCFG119_Pos      (24UL)                    /*!< OUTCFG119 (Bit 24)                                    */
#define TIMER_OUTCFG29_OUTCFG119_Msk      (0x3f000000UL)            /*!< OUTCFG119 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG29_OUTCFG118_Pos      (16UL)                    /*!< OUTCFG118 (Bit 16)                                    */
#define TIMER_OUTCFG29_OUTCFG118_Msk      (0x3f0000UL)              /*!< OUTCFG118 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG29_OUTCFG117_Pos      (8UL)                     /*!< OUTCFG117 (Bit 8)                                     */
#define TIMER_OUTCFG29_OUTCFG117_Msk      (0x3f00UL)                /*!< OUTCFG117 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG29_OUTCFG116_Pos      (0UL)                     /*!< OUTCFG116 (Bit 0)                                     */
#define TIMER_OUTCFG29_OUTCFG116_Msk      (0x3fUL)                  /*!< OUTCFG116 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG30  ======================================================== */
#define TIMER_OUTCFG30_OUTCFG123_Pos      (24UL)                    /*!< OUTCFG123 (Bit 24)                                    */
#define TIMER_OUTCFG30_OUTCFG123_Msk      (0x3f000000UL)            /*!< OUTCFG123 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG30_OUTCFG122_Pos      (16UL)                    /*!< OUTCFG122 (Bit 16)                                    */
#define TIMER_OUTCFG30_OUTCFG122_Msk      (0x3f0000UL)              /*!< OUTCFG122 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG30_OUTCFG121_Pos      (8UL)                     /*!< OUTCFG121 (Bit 8)                                     */
#define TIMER_OUTCFG30_OUTCFG121_Msk      (0x3f00UL)                /*!< OUTCFG121 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG30_OUTCFG120_Pos      (0UL)                     /*!< OUTCFG120 (Bit 0)                                     */
#define TIMER_OUTCFG30_OUTCFG120_Msk      (0x3fUL)                  /*!< OUTCFG120 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG31  ======================================================== */
#define TIMER_OUTCFG31_OUTCFG127_Pos      (24UL)                    /*!< OUTCFG127 (Bit 24)                                    */
#define TIMER_OUTCFG31_OUTCFG127_Msk      (0x3f000000UL)            /*!< OUTCFG127 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG31_OUTCFG126_Pos      (16UL)                    /*!< OUTCFG126 (Bit 16)                                    */
#define TIMER_OUTCFG31_OUTCFG126_Msk      (0x3f0000UL)              /*!< OUTCFG126 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG31_OUTCFG125_Pos      (8UL)                     /*!< OUTCFG125 (Bit 8)                                     */
#define TIMER_OUTCFG31_OUTCFG125_Msk      (0x3f00UL)                /*!< OUTCFG125 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG31_OUTCFG124_Pos      (0UL)                     /*!< OUTCFG124 (Bit 0)                                     */
#define TIMER_OUTCFG31_OUTCFG124_Msk      (0x3fUL)                  /*!< OUTCFG124 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG32  ======================================================== */
#define TIMER_OUTCFG32_OUTCFG131_Pos      (24UL)                    /*!< OUTCFG131 (Bit 24)                                    */
#define TIMER_OUTCFG32_OUTCFG131_Msk      (0x3f000000UL)            /*!< OUTCFG131 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG32_OUTCFG130_Pos      (16UL)                    /*!< OUTCFG130 (Bit 16)                                    */
#define TIMER_OUTCFG32_OUTCFG130_Msk      (0x3f0000UL)              /*!< OUTCFG130 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG32_OUTCFG129_Pos      (8UL)                     /*!< OUTCFG129 (Bit 8)                                     */
#define TIMER_OUTCFG32_OUTCFG129_Msk      (0x3f00UL)                /*!< OUTCFG129 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG32_OUTCFG128_Pos      (0UL)                     /*!< OUTCFG128 (Bit 0)                                     */
#define TIMER_OUTCFG32_OUTCFG128_Msk      (0x3fUL)                  /*!< OUTCFG128 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG33  ======================================================== */
#define TIMER_OUTCFG33_OUTCFG135_Pos      (24UL)                    /*!< OUTCFG135 (Bit 24)                                    */
#define TIMER_OUTCFG33_OUTCFG135_Msk      (0x3f000000UL)            /*!< OUTCFG135 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG33_OUTCFG134_Pos      (16UL)                    /*!< OUTCFG134 (Bit 16)                                    */
#define TIMER_OUTCFG33_OUTCFG134_Msk      (0x3f0000UL)              /*!< OUTCFG134 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG33_OUTCFG133_Pos      (8UL)                     /*!< OUTCFG133 (Bit 8)                                     */
#define TIMER_OUTCFG33_OUTCFG133_Msk      (0x3f00UL)                /*!< OUTCFG133 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG33_OUTCFG132_Pos      (0UL)                     /*!< OUTCFG132 (Bit 0)                                     */
#define TIMER_OUTCFG33_OUTCFG132_Msk      (0x3fUL)                  /*!< OUTCFG132 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG34  ======================================================== */
#define TIMER_OUTCFG34_OUTCFG139_Pos      (24UL)                    /*!< OUTCFG139 (Bit 24)                                    */
#define TIMER_OUTCFG34_OUTCFG139_Msk      (0x3f000000UL)            /*!< OUTCFG139 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG34_OUTCFG138_Pos      (16UL)                    /*!< OUTCFG138 (Bit 16)                                    */
#define TIMER_OUTCFG34_OUTCFG138_Msk      (0x3f0000UL)              /*!< OUTCFG138 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG34_OUTCFG137_Pos      (8UL)                     /*!< OUTCFG137 (Bit 8)                                     */
#define TIMER_OUTCFG34_OUTCFG137_Msk      (0x3f00UL)                /*!< OUTCFG137 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG34_OUTCFG136_Pos      (0UL)                     /*!< OUTCFG136 (Bit 0)                                     */
#define TIMER_OUTCFG34_OUTCFG136_Msk      (0x3fUL)                  /*!< OUTCFG136 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG35  ======================================================== */
#define TIMER_OUTCFG35_OUTCFG143_Pos      (24UL)                    /*!< OUTCFG143 (Bit 24)                                    */
#define TIMER_OUTCFG35_OUTCFG143_Msk      (0x3f000000UL)            /*!< OUTCFG143 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG35_OUTCFG142_Pos      (16UL)                    /*!< OUTCFG142 (Bit 16)                                    */
#define TIMER_OUTCFG35_OUTCFG142_Msk      (0x3f0000UL)              /*!< OUTCFG142 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG35_OUTCFG141_Pos      (8UL)                     /*!< OUTCFG141 (Bit 8)                                     */
#define TIMER_OUTCFG35_OUTCFG141_Msk      (0x3f00UL)                /*!< OUTCFG141 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG35_OUTCFG140_Pos      (0UL)                     /*!< OUTCFG140 (Bit 0)                                     */
#define TIMER_OUTCFG35_OUTCFG140_Msk      (0x3fUL)                  /*!< OUTCFG140 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG36  ======================================================== */
#define TIMER_OUTCFG36_OUTCFG147_Pos      (24UL)                    /*!< OUTCFG147 (Bit 24)                                    */
#define TIMER_OUTCFG36_OUTCFG147_Msk      (0x3f000000UL)            /*!< OUTCFG147 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG36_OUTCFG146_Pos      (16UL)                    /*!< OUTCFG146 (Bit 16)                                    */
#define TIMER_OUTCFG36_OUTCFG146_Msk      (0x3f0000UL)              /*!< OUTCFG146 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG36_OUTCFG145_Pos      (8UL)                     /*!< OUTCFG145 (Bit 8)                                     */
#define TIMER_OUTCFG36_OUTCFG145_Msk      (0x3f00UL)                /*!< OUTCFG145 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG36_OUTCFG144_Pos      (0UL)                     /*!< OUTCFG144 (Bit 0)                                     */
#define TIMER_OUTCFG36_OUTCFG144_Msk      (0x3fUL)                  /*!< OUTCFG144 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG37  ======================================================== */
#define TIMER_OUTCFG37_OUTCFG151_Pos      (24UL)                    /*!< OUTCFG151 (Bit 24)                                    */
#define TIMER_OUTCFG37_OUTCFG151_Msk      (0x3f000000UL)            /*!< OUTCFG151 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG37_OUTCFG150_Pos      (16UL)                    /*!< OUTCFG150 (Bit 16)                                    */
#define TIMER_OUTCFG37_OUTCFG150_Msk      (0x3f0000UL)              /*!< OUTCFG150 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG37_OUTCFG149_Pos      (8UL)                     /*!< OUTCFG149 (Bit 8)                                     */
#define TIMER_OUTCFG37_OUTCFG149_Msk      (0x3f00UL)                /*!< OUTCFG149 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG37_OUTCFG148_Pos      (0UL)                     /*!< OUTCFG148 (Bit 0)                                     */
#define TIMER_OUTCFG37_OUTCFG148_Msk      (0x3fUL)                  /*!< OUTCFG148 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG38  ======================================================== */
#define TIMER_OUTCFG38_OUTCFG155_Pos      (24UL)                    /*!< OUTCFG155 (Bit 24)                                    */
#define TIMER_OUTCFG38_OUTCFG155_Msk      (0x3f000000UL)            /*!< OUTCFG155 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG38_OUTCFG154_Pos      (16UL)                    /*!< OUTCFG154 (Bit 16)                                    */
#define TIMER_OUTCFG38_OUTCFG154_Msk      (0x3f0000UL)              /*!< OUTCFG154 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG38_OUTCFG153_Pos      (8UL)                     /*!< OUTCFG153 (Bit 8)                                     */
#define TIMER_OUTCFG38_OUTCFG153_Msk      (0x3f00UL)                /*!< OUTCFG153 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG38_OUTCFG152_Pos      (0UL)                     /*!< OUTCFG152 (Bit 0)                                     */
#define TIMER_OUTCFG38_OUTCFG152_Msk      (0x3fUL)                  /*!< OUTCFG152 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG39  ======================================================== */
#define TIMER_OUTCFG39_OUTCFG159_Pos      (24UL)                    /*!< OUTCFG159 (Bit 24)                                    */
#define TIMER_OUTCFG39_OUTCFG159_Msk      (0x3f000000UL)            /*!< OUTCFG159 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG39_OUTCFG158_Pos      (16UL)                    /*!< OUTCFG158 (Bit 16)                                    */
#define TIMER_OUTCFG39_OUTCFG158_Msk      (0x3f0000UL)              /*!< OUTCFG158 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG39_OUTCFG157_Pos      (8UL)                     /*!< OUTCFG157 (Bit 8)                                     */
#define TIMER_OUTCFG39_OUTCFG157_Msk      (0x3f00UL)                /*!< OUTCFG157 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG39_OUTCFG156_Pos      (0UL)                     /*!< OUTCFG156 (Bit 0)                                     */
#define TIMER_OUTCFG39_OUTCFG156_Msk      (0x3fUL)                  /*!< OUTCFG156 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG40  ======================================================== */
#define TIMER_OUTCFG40_OUTCFG163_Pos      (24UL)                    /*!< OUTCFG163 (Bit 24)                                    */
#define TIMER_OUTCFG40_OUTCFG163_Msk      (0x3f000000UL)            /*!< OUTCFG163 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG40_OUTCFG162_Pos      (16UL)                    /*!< OUTCFG162 (Bit 16)                                    */
#define TIMER_OUTCFG40_OUTCFG162_Msk      (0x3f0000UL)              /*!< OUTCFG162 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG40_OUTCFG161_Pos      (8UL)                     /*!< OUTCFG161 (Bit 8)                                     */
#define TIMER_OUTCFG40_OUTCFG161_Msk      (0x3f00UL)                /*!< OUTCFG161 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG40_OUTCFG160_Pos      (0UL)                     /*!< OUTCFG160 (Bit 0)                                     */
#define TIMER_OUTCFG40_OUTCFG160_Msk      (0x3fUL)                  /*!< OUTCFG160 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG41  ======================================================== */
#define TIMER_OUTCFG41_OUTCFG167_Pos      (24UL)                    /*!< OUTCFG167 (Bit 24)                                    */
#define TIMER_OUTCFG41_OUTCFG167_Msk      (0x3f000000UL)            /*!< OUTCFG167 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG41_OUTCFG166_Pos      (16UL)                    /*!< OUTCFG166 (Bit 16)                                    */
#define TIMER_OUTCFG41_OUTCFG166_Msk      (0x3f0000UL)              /*!< OUTCFG166 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG41_OUTCFG165_Pos      (8UL)                     /*!< OUTCFG165 (Bit 8)                                     */
#define TIMER_OUTCFG41_OUTCFG165_Msk      (0x3f00UL)                /*!< OUTCFG165 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG41_OUTCFG164_Pos      (0UL)                     /*!< OUTCFG164 (Bit 0)                                     */
#define TIMER_OUTCFG41_OUTCFG164_Msk      (0x3fUL)                  /*!< OUTCFG164 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG42  ======================================================== */
#define TIMER_OUTCFG42_OUTCFG171_Pos      (24UL)                    /*!< OUTCFG171 (Bit 24)                                    */
#define TIMER_OUTCFG42_OUTCFG171_Msk      (0x3f000000UL)            /*!< OUTCFG171 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG42_OUTCFG170_Pos      (16UL)                    /*!< OUTCFG170 (Bit 16)                                    */
#define TIMER_OUTCFG42_OUTCFG170_Msk      (0x3f0000UL)              /*!< OUTCFG170 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG42_OUTCFG169_Pos      (8UL)                     /*!< OUTCFG169 (Bit 8)                                     */
#define TIMER_OUTCFG42_OUTCFG169_Msk      (0x3f00UL)                /*!< OUTCFG169 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG42_OUTCFG168_Pos      (0UL)                     /*!< OUTCFG168 (Bit 0)                                     */
#define TIMER_OUTCFG42_OUTCFG168_Msk      (0x3fUL)                  /*!< OUTCFG168 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG43  ======================================================== */
#define TIMER_OUTCFG43_OUTCFG175_Pos      (24UL)                    /*!< OUTCFG175 (Bit 24)                                    */
#define TIMER_OUTCFG43_OUTCFG175_Msk      (0x3f000000UL)            /*!< OUTCFG175 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG43_OUTCFG174_Pos      (16UL)                    /*!< OUTCFG174 (Bit 16)                                    */
#define TIMER_OUTCFG43_OUTCFG174_Msk      (0x3f0000UL)              /*!< OUTCFG174 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG43_OUTCFG173_Pos      (8UL)                     /*!< OUTCFG173 (Bit 8)                                     */
#define TIMER_OUTCFG43_OUTCFG173_Msk      (0x3f00UL)                /*!< OUTCFG173 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG43_OUTCFG172_Pos      (0UL)                     /*!< OUTCFG172 (Bit 0)                                     */
#define TIMER_OUTCFG43_OUTCFG172_Msk      (0x3fUL)                  /*!< OUTCFG172 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG44  ======================================================== */
#define TIMER_OUTCFG44_OUTCFG179_Pos      (24UL)                    /*!< OUTCFG179 (Bit 24)                                    */
#define TIMER_OUTCFG44_OUTCFG179_Msk      (0x3f000000UL)            /*!< OUTCFG179 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG44_OUTCFG178_Pos      (16UL)                    /*!< OUTCFG178 (Bit 16)                                    */
#define TIMER_OUTCFG44_OUTCFG178_Msk      (0x3f0000UL)              /*!< OUTCFG178 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG44_OUTCFG177_Pos      (8UL)                     /*!< OUTCFG177 (Bit 8)                                     */
#define TIMER_OUTCFG44_OUTCFG177_Msk      (0x3f00UL)                /*!< OUTCFG177 (Bitfield-Mask: 0x3f)                       */
