AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
#define TIMER_OUTCFG44_OUTCFG176_Pos      (0UL)                     /*!< OUTCFG176 (Bit 0)                                     */
#define TIMER_OUTCFG44_OUTCFG176_Msk      (0x3fUL)                  /*!< OUTCFG176 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG45  ======================================================== */
#define TIMER_OUTCFG45_OUTCFG183_Pos      (24UL)                    /*!< OUTCFG183 (Bit 24)                                    */
#define TIMER_OUTCFG45_OUTCFG183_Msk      (0x3f000000UL)            /*!< OUTCFG183 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG45_OUTCFG182_Pos      (16UL)                    /*!< OUTCFG182 (Bit 16)                                    */
#define TIMER_OUTCFG45_OUTCFG182_Msk      (0x3f0000UL)              /*!< OUTCFG182 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG45_OUTCFG181_Pos      (8UL)                     /*!< OUTCFG181 (Bit 8)                                     */
#define TIMER_OUTCFG45_OUTCFG181_Msk      (0x3f00UL)                /*!< OUTCFG181 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG45_OUTCFG180_Pos      (0UL)                     /*!< OUTCFG180 (Bit 0)                                     */
#define TIMER_OUTCFG45_OUTCFG180_Msk      (0x3fUL)                  /*!< OUTCFG180 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG46  ======================================================== */
#define TIMER_OUTCFG46_OUTCFG187_Pos      (24UL)                    /*!< OUTCFG187 (Bit 24)                                    */
#define TIMER_OUTCFG46_OUTCFG187_Msk      (0x3f000000UL)            /*!< OUTCFG187 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG46_OUTCFG186_Pos      (16UL)                    /*!< OUTCFG186 (Bit 16)                                    */
#define TIMER_OUTCFG46_OUTCFG186_Msk      (0x3f0000UL)              /*!< OUTCFG186 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG46_OUTCFG185_Pos      (8UL)                     /*!< OUTCFG185 (Bit 8)                                     */
#define TIMER_OUTCFG46_OUTCFG185_Msk      (0x3f00UL)                /*!< OUTCFG185 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG46_OUTCFG184_Pos      (0UL)                     /*!< OUTCFG184 (Bit 0)                                     */
#define TIMER_OUTCFG46_OUTCFG184_Msk      (0x3fUL)                  /*!< OUTCFG184 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG47  ======================================================== */
#define TIMER_OUTCFG47_OUTCFG191_Pos      (24UL)                    /*!< OUTCFG191 (Bit 24)                                    */
#define TIMER_OUTCFG47_OUTCFG191_Msk      (0x3f000000UL)            /*!< OUTCFG191 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG47_OUTCFG190_Pos      (16UL)                    /*!< OUTCFG190 (Bit 16)                                    */
#define TIMER_OUTCFG47_OUTCFG190_Msk      (0x3f0000UL)              /*!< OUTCFG190 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG47_OUTCFG189_Pos      (8UL)                     /*!< OUTCFG189 (Bit 8)                                     */
#define TIMER_OUTCFG47_OUTCFG189_Msk      (0x3f00UL)                /*!< OUTCFG189 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG47_OUTCFG188_Pos      (0UL)                     /*!< OUTCFG188 (Bit 0)                                     */
#define TIMER_OUTCFG47_OUTCFG188_Msk      (0x3fUL)                  /*!< OUTCFG188 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG48  ======================================================== */
#define TIMER_OUTCFG48_OUTCFG195_Pos      (24UL)                    /*!< OUTCFG195 (Bit 24)                                    */
#define TIMER_OUTCFG48_OUTCFG195_Msk      (0x3f000000UL)            /*!< OUTCFG195 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG48_OUTCFG194_Pos      (16UL)                    /*!< OUTCFG194 (Bit 16)                                    */
#define TIMER_OUTCFG48_OUTCFG194_Msk      (0x3f0000UL)              /*!< OUTCFG194 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG48_OUTCFG193_Pos      (8UL)                     /*!< OUTCFG193 (Bit 8)                                     */
#define TIMER_OUTCFG48_OUTCFG193_Msk      (0x3f00UL)                /*!< OUTCFG193 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG48_OUTCFG192_Pos      (0UL)                     /*!< OUTCFG192 (Bit 0)                                     */
#define TIMER_OUTCFG48_OUTCFG192_Msk      (0x3fUL)                  /*!< OUTCFG192 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG49  ======================================================== */
#define TIMER_OUTCFG49_OUTCFG199_Pos      (24UL)                    /*!< OUTCFG199 (Bit 24)                                    */
#define TIMER_OUTCFG49_OUTCFG199_Msk      (0x3f000000UL)            /*!< OUTCFG199 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG49_OUTCFG198_Pos      (16UL)                    /*!< OUTCFG198 (Bit 16)                                    */
#define TIMER_OUTCFG49_OUTCFG198_Msk      (0x3f0000UL)              /*!< OUTCFG198 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG49_OUTCFG197_Pos      (8UL)                     /*!< OUTCFG197 (Bit 8)                                     */
#define TIMER_OUTCFG49_OUTCFG197_Msk      (0x3f00UL)                /*!< OUTCFG197 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG49_OUTCFG196_Pos      (0UL)                     /*!< OUTCFG196 (Bit 0)                                     */
#define TIMER_OUTCFG49_OUTCFG196_Msk      (0x3fUL)                  /*!< OUTCFG196 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG50  ======================================================== */
#define TIMER_OUTCFG50_OUTCFG203_Pos      (24UL)                    /*!< OUTCFG203 (Bit 24)                                    */
#define TIMER_OUTCFG50_OUTCFG203_Msk      (0x3f000000UL)            /*!< OUTCFG203 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG50_OUTCFG202_Pos      (16UL)                    /*!< OUTCFG202 (Bit 16)                                    */
#define TIMER_OUTCFG50_OUTCFG202_Msk      (0x3f0000UL)              /*!< OUTCFG202 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG50_OUTCFG201_Pos      (8UL)                     /*!< OUTCFG201 (Bit 8)                                     */
#define TIMER_OUTCFG50_OUTCFG201_Msk      (0x3f00UL)                /*!< OUTCFG201 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG50_OUTCFG200_Pos      (0UL)                     /*!< OUTCFG200 (Bit 0)                                     */
#define TIMER_OUTCFG50_OUTCFG200_Msk      (0x3fUL)                  /*!< OUTCFG200 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG51  ======================================================== */
#define TIMER_OUTCFG51_OUTCFG207_Pos      (24UL)                    /*!< OUTCFG207 (Bit 24)                                    */
#define TIMER_OUTCFG51_OUTCFG207_Msk      (0x3f000000UL)            /*!< OUTCFG207 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG51_OUTCFG206_Pos      (16UL)                    /*!< OUTCFG206 (Bit 16)                                    */
#define TIMER_OUTCFG51_OUTCFG206_Msk      (0x3f0000UL)              /*!< OUTCFG206 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG51_OUTCFG205_Pos      (8UL)                     /*!< OUTCFG205 (Bit 8)                                     */
#define TIMER_OUTCFG51_OUTCFG205_Msk      (0x3f00UL)                /*!< OUTCFG205 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG51_OUTCFG204_Pos      (0UL)                     /*!< OUTCFG204 (Bit 0)                                     */
#define TIMER_OUTCFG51_OUTCFG204_Msk      (0x3fUL)                  /*!< OUTCFG204 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG52  ======================================================== */
#define TIMER_OUTCFG52_OUTCFG211_Pos      (24UL)                    /*!< OUTCFG211 (Bit 24)                                    */
#define TIMER_OUTCFG52_OUTCFG211_Msk      (0x3f000000UL)            /*!< OUTCFG211 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG52_OUTCFG210_Pos      (16UL)                    /*!< OUTCFG210 (Bit 16)                                    */
#define TIMER_OUTCFG52_OUTCFG210_Msk      (0x3f0000UL)              /*!< OUTCFG210 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG52_OUTCFG209_Pos      (8UL)                     /*!< OUTCFG209 (Bit 8)                                     */
#define TIMER_OUTCFG52_OUTCFG209_Msk      (0x3f00UL)                /*!< OUTCFG209 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG52_OUTCFG208_Pos      (0UL)                     /*!< OUTCFG208 (Bit 0)                                     */
#define TIMER_OUTCFG52_OUTCFG208_Msk      (0x3fUL)                  /*!< OUTCFG208 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG53  ======================================================== */
#define TIMER_OUTCFG53_OUTCFG215_Pos      (24UL)                    /*!< OUTCFG215 (Bit 24)                                    */
#define TIMER_OUTCFG53_OUTCFG215_Msk      (0x3f000000UL)            /*!< OUTCFG215 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG53_OUTCFG214_Pos      (16UL)                    /*!< OUTCFG214 (Bit 16)                                    */
#define TIMER_OUTCFG53_OUTCFG214_Msk      (0x3f0000UL)              /*!< OUTCFG214 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG53_OUTCFG213_Pos      (8UL)                     /*!< OUTCFG213 (Bit 8)                                     */
#define TIMER_OUTCFG53_OUTCFG213_Msk      (0x3f00UL)                /*!< OUTCFG213 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG53_OUTCFG212_Pos      (0UL)                     /*!< OUTCFG212 (Bit 0)                                     */
#define TIMER_OUTCFG53_OUTCFG212_Msk      (0x3fUL)                  /*!< OUTCFG212 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG54  ======================================================== */
#define TIMER_OUTCFG54_OUTCFG219_Pos      (24UL)                    /*!< OUTCFG219 (Bit 24)                                    */
#define TIMER_OUTCFG54_OUTCFG219_Msk      (0x3f000000UL)            /*!< OUTCFG219 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG54_OUTCFG218_Pos      (16UL)                    /*!< OUTCFG218 (Bit 16)                                    */
#define TIMER_OUTCFG54_OUTCFG218_Msk      (0x3f0000UL)              /*!< OUTCFG218 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG54_OUTCFG217_Pos      (8UL)                     /*!< OUTCFG217 (Bit 8)                                     */
#define TIMER_OUTCFG54_OUTCFG217_Msk      (0x3f00UL)                /*!< OUTCFG217 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG54_OUTCFG216_Pos      (0UL)                     /*!< OUTCFG216 (Bit 0)                                     */
#define TIMER_OUTCFG54_OUTCFG216_Msk      (0x3fUL)                  /*!< OUTCFG216 (Bitfield-Mask: 0x3f)                       */
/* =======================================================  OUTCFG55  ======================================================== */
#define TIMER_OUTCFG55_OUTCFG223_Pos      (24UL)                    /*!< OUTCFG223 (Bit 24)                                    */
#define TIMER_OUTCFG55_OUTCFG223_Msk      (0x3f000000UL)            /*!< OUTCFG223 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG55_OUTCFG222_Pos      (16UL)                    /*!< OUTCFG222 (Bit 16)                                    */
#define TIMER_OUTCFG55_OUTCFG222_Msk      (0x3f0000UL)              /*!< OUTCFG222 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG55_OUTCFG221_Pos      (8UL)                     /*!< OUTCFG221 (Bit 8)                                     */
#define TIMER_OUTCFG55_OUTCFG221_Msk      (0x3f00UL)                /*!< OUTCFG221 (Bitfield-Mask: 0x3f)                       */
#define TIMER_OUTCFG55_OUTCFG220_Pos      (0UL)                     /*!< OUTCFG220 (Bit 0)                                     */
#define TIMER_OUTCFG55_OUTCFG220_Msk      (0x3fUL)                  /*!< OUTCFG220 (Bitfield-Mask: 0x3f)                       */
/* =========================================================  CTRL0  ========================================================= */
#define TIMER_CTRL0_TMR0LMT_Pos           (24UL)                    /*!< TMR0LMT (Bit 24)                                      */
#define TIMER_CTRL0_TMR0LMT_Msk           (0xff000000UL)            /*!< TMR0LMT (Bitfield-Mask: 0xff)                         */
#define TIMER_CTRL0_TMR0TMODE_Pos         (17UL)                    /*!< TMR0TMODE (Bit 17)                                    */
#define TIMER_CTRL0_TMR0TMODE_Msk         (0x60000UL)               /*!< TMR0TMODE (Bitfield-Mask: 0x03)                       */
#define TIMER_CTRL0_TMR0CLK_Pos           (8UL)                     /*!< TMR0CLK (Bit 8)                                       */
#define TIMER_CTRL0_TMR0CLK_Msk           (0x1ff00UL)               /*!< TMR0CLK (Bitfield-Mask: 0x1ff)                        */
#define TIMER_CTRL0_TMR0FN_Pos            (4UL)                     /*!< TMR0FN (Bit 4)                                        */
#define TIMER_CTRL0_TMR0FN_Msk            (0xf0UL)                  /*!< TMR0FN (Bitfield-Mask: 0x0f)                          */
#define TIMER_CTRL0_TMR0POL1_Pos          (3UL)                     /*!< TMR0POL1 (Bit 3)                                      */
#define TIMER_CTRL0_TMR0POL1_Msk          (0x8UL)                   /*!< TMR0POL1 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL0_TMR0POL0_Pos          (2UL)                     /*!< TMR0POL0 (Bit 2)                                      */
#define TIMER_CTRL0_TMR0POL0_Msk          (0x4UL)                   /*!< TMR0POL0 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL0_TMR0CLR_Pos           (1UL)                     /*!< TMR0CLR (Bit 1)                                       */
#define TIMER_CTRL0_TMR0CLR_Msk           (0x2UL)                   /*!< TMR0CLR (Bitfield-Mask: 0x01)                         */
#define TIMER_CTRL0_TMR0EN_Pos            (0UL)                     /*!< TMR0EN (Bit 0)                                        */
#define TIMER_CTRL0_TMR0EN_Msk            (0x1UL)                   /*!< TMR0EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER0  ========================================================= */
#define TIMER_TIMER0_TIMER0_Pos           (0UL)                     /*!< TIMER0 (Bit 0)                                        */
#define TIMER_TIMER0_TIMER0_Msk           (0xffffffffUL)            /*!< TIMER0 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR0CMP0  ======================================================== */
#define TIMER_TMR0CMP0_TMR0CMP0_Pos       (0UL)                     /*!< TMR0CMP0 (Bit 0)                                      */
#define TIMER_TMR0CMP0_TMR0CMP0_Msk       (0xffffffffUL)            /*!< TMR0CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR0CMP1  ======================================================== */
#define TIMER_TMR0CMP1_TMR0CMP1_Pos       (0UL)                     /*!< TMR0CMP1 (Bit 0)                                      */
#define TIMER_TMR0CMP1_TMR0CMP1_Msk       (0xffffffffUL)            /*!< TMR0CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE0  ========================================================= */
#define TIMER_MODE0_TMR0TRIGSEL_Pos       (8UL)                     /*!< TMR0TRIGSEL (Bit 8)                                   */
#define TIMER_MODE0_TMR0TRIGSEL_Msk       (0x1ff00UL)               /*!< TMR0TRIGSEL (Bitfield-Mask: 0x1ff)                    */
/* ======================================================  TMR0LMTVAL  ======================================================= */
#define TIMER_TMR0LMTVAL_TMR0LMTVAL_Pos   (0UL)                     /*!< TMR0LMTVAL (Bit 0)                                    */
#define TIMER_TMR0LMTVAL_TMR0LMTVAL_Msk   (0xffUL)                  /*!< TMR0LMTVAL (Bitfield-Mask: 0xff)                      */
/* =========================================================  CTRL1  ========================================================= */
#define TIMER_CTRL1_TMR1LMT_Pos           (24UL)                    /*!< TMR1LMT (Bit 24)                                      */
#define TIMER_CTRL1_TMR1LMT_Msk           (0xff000000UL)            /*!< TMR1LMT (Bitfield-Mask: 0xff)                         */
#define TIMER_CTRL1_TMR1TMODE_Pos         (17UL)                    /*!< TMR1TMODE (Bit 17)                                    */
#define TIMER_CTRL1_TMR1TMODE_Msk         (0x60000UL)               /*!< TMR1TMODE (Bitfield-Mask: 0x03)                       */
#define TIMER_CTRL1_TMR1CLK_Pos           (8UL)                     /*!< TMR1CLK (Bit 8)                                       */
#define TIMER_CTRL1_TMR1CLK_Msk           (0x1ff00UL)               /*!< TMR1CLK (Bitfield-Mask: 0x1ff)                        */
#define TIMER_CTRL1_TMR1FN_Pos            (4UL)                     /*!< TMR1FN (Bit 4)                                        */
#define TIMER_CTRL1_TMR1FN_Msk            (0xf0UL)                  /*!< TMR1FN (Bitfield-Mask: 0x0f)                          */
#define TIMER_CTRL1_TMR1POL1_Pos          (3UL)                     /*!< TMR1POL1 (Bit 3)                                      */
#define TIMER_CTRL1_TMR1POL1_Msk          (0x8UL)                   /*!< TMR1POL1 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL1_TMR1POL0_Pos          (2UL)                     /*!< TMR1POL0 (Bit 2)                                      */
#define TIMER_CTRL1_TMR1POL0_Msk          (0x4UL)                   /*!< TMR1POL0 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL1_TMR1CLR_Pos           (1UL)                     /*!< TMR1CLR (Bit 1)                                       */
#define TIMER_CTRL1_TMR1CLR_Msk           (0x2UL)                   /*!< TMR1CLR (Bitfield-Mask: 0x01)                         */
#define TIMER_CTRL1_TMR1EN_Pos            (0UL)                     /*!< TMR1EN (Bit 0)                                        */
#define TIMER_CTRL1_TMR1EN_Msk            (0x1UL)                   /*!< TMR1EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER1  ========================================================= */
#define TIMER_TIMER1_TIMER1_Pos           (0UL)                     /*!< TIMER1 (Bit 0)                                        */
#define TIMER_TIMER1_TIMER1_Msk           (0xffffffffUL)            /*!< TIMER1 (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  TMR1CMP0  ======================================================== */
#define TIMER_TMR1CMP0_TMR1CMP0_Pos       (0UL)                     /*!< TMR1CMP0 (Bit 0)                                      */
#define TIMER_TMR1CMP0_TMR1CMP0_Msk       (0xffffffffUL)            /*!< TMR1CMP0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  TMR1CMP1  ======================================================== */
#define TIMER_TMR1CMP1_TMR1CMP1_Pos       (0UL)                     /*!< TMR1CMP1 (Bit 0)                                      */
#define TIMER_TMR1CMP1_TMR1CMP1_Msk       (0xffffffffUL)            /*!< TMR1CMP1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  MODE1  ========================================================= */
#define TIMER_MODE1_TMR1TRIGSEL_Pos       (8UL)                     /*!< TMR1TRIGSEL (Bit 8)                                   */
#define TIMER_MODE1_TMR1TRIGSEL_Msk       (0x1ff00UL)               /*!< TMR1TRIGSEL (Bitfield-Mask: 0x1ff)                    */
/* ======================================================  TMR1LMTVAL  ======================================================= */
#define TIMER_TMR1LMTVAL_TMR1LMTVAL_Pos   (0UL)                     /*!< TMR1LMTVAL (Bit 0)                                    */
#define TIMER_TMR1LMTVAL_TMR1LMTVAL_Msk   (0xffUL)                  /*!< TMR1LMTVAL (Bitfield-Mask: 0xff)                      */
/* =========================================================  CTRL2  ========================================================= */
#define TIMER_CTRL2_TMR2LMT_Pos           (24UL)                    /*!< TMR2LMT (Bit 24)                                      */
#define TIMER_CTRL2_TMR2LMT_Msk           (0xff000000UL)            /*!< TMR2LMT (Bitfield-Mask: 0xff)                         */
#define TIMER_CTRL2_TMR2TMODE_Pos         (17UL)                    /*!< TMR2TMODE (Bit 17)                                    */
#define TIMER_CTRL2_TMR2TMODE_Msk         (0x60000UL)               /*!< TMR2TMODE (Bitfield-Mask: 0x03)                       */
#define TIMER_CTRL2_TMR2CLK_Pos           (8UL)                     /*!< TMR2CLK (Bit 8)                                       */
#define TIMER_CTRL2_TMR2CLK_Msk           (0x1ff00UL)               /*!< TMR2CLK (Bitfield-Mask: 0x1ff)                        */
#define TIMER_CTRL2_TMR2FN_Pos            (4UL)                     /*!< TMR2FN (Bit 4)                                        */
#define TIMER_CTRL2_TMR2FN_Msk            (0xf0UL)                  /*!< TMR2FN (Bitfield-Mask: 0x0f)                          */
#define TIMER_CTRL2_TMR2POL1_Pos          (3UL)                     /*!< TMR2POL1 (Bit 3)                                      */
#define TIMER_CTRL2_TMR2POL1_Msk          (0x8UL)                   /*!< TMR2POL1 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL2_TMR2POL0_Pos          (2UL)                     /*!< TMR2POL0 (Bit 2)                                      */
#define TIMER_CTRL2_TMR2POL0_Msk          (0x4UL)                   /*!< TMR2POL0 (Bitfield-Mask: 0x01)                        */
#define TIMER_CTRL2_TMR2CLR_Pos           (1UL)                     /*!< TMR2CLR (Bit 1)                                       */
#define TIMER_CTRL2_TMR2CLR_Msk           (0x2UL)                   /*!< TMR2CLR (Bitfield-Mask: 0x01)                         */
#define TIMER_CTRL2_TMR2EN_Pos            (0UL)                     /*!< TMR2EN (Bit 0)                                        */
#define TIMER_CTRL2_TMR2EN_Msk            (0x1UL)                   /*!< TMR2EN (Bitfield-Mask: 0x01)                          */
/* ========================================================  TIMER2  ========================================================= */
#define TIMER_TIMER2_TIMER2_Pos           (0UL)                     /*!< TIMER2 (Bit 0)                                        */
