AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =======================================================  DMATRIGEN  ======================================================= */
/* ======================================================  DMATRIGSTAT  ====================================================== */
/* ========================================================  DMACFG  ========================================================= */
/* ==============================================  ADC DMACFG DMAMSK [17..17]  =============================================== */
typedef enum {                                  /*!< ADC_DMACFG_DMAMSK                                                         */
  ADC_DMACFG_DMAMSK_DIS                = 0,     /*!< DIS : FIFO Contents are copied directly to memory without modification.   */
  ADC_DMACFG_DMAMSK_EN                 = 1,     /*!< EN : Only the FIFODATA contents are copied to memory on DMA
                                                     transfers. The SLOTNUM and FIFOCNT contents are cleared
                                                     to zero.                                                                  */
} ADC_DMACFG_DMAMSK_Enum;

/* ==============================================  ADC DMACFG DMADYNPRI [9..9]  ============================================== */
typedef enum {                                  /*!< ADC_DMACFG_DMADYNPRI                                                      */
  ADC_DMACFG_DMADYNPRI_DIS             = 0,     /*!< DIS : Disable dynamic priority (use DMAPRI setting only)                  */
  ADC_DMACFG_DMADYNPRI_EN              = 1,     /*!< EN : Enable dynamic priority                                              */
} ADC_DMACFG_DMADYNPRI_Enum;

/* ===============================================  ADC DMACFG DMAPRI [8..8]  ================================================ */
typedef enum {                                  /*!< ADC_DMACFG_DMAPRI                                                         */
  ADC_DMACFG_DMAPRI_LOW                = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  ADC_DMACFG_DMAPRI_HIGH               = 1,     /*!< HIGH : High Priority (service immediately)                                */
} ADC_DMACFG_DMAPRI_Enum;

/* ===============================================  ADC DMACFG DMADIR [2..2]  ================================================ */
typedef enum {                                  /*!< ADC_DMACFG_DMADIR                                                         */
  ADC_DMACFG_DMADIR_P2M                = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction                             */
  ADC_DMACFG_DMADIR_M2P                = 1,     /*!< M2P : Memory to Peripheral transaction                                    */
} ADC_DMACFG_DMADIR_Enum;

/* ================================================  ADC DMACFG DMAEN [0..0]  ================================================ */
typedef enum {                                  /*!< ADC_DMACFG_DMAEN                                                          */
  ADC_DMACFG_DMAEN_DIS                 = 0,     /*!< DIS : Disable DMA Function                                                */
  ADC_DMACFG_DMAEN_EN                  = 1,     /*!< EN : Enable DMA Function                                                  */
} ADC_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* ====================================================  DMATARGADDRNEXT  ==================================================== */
/* ====================================================  DMATOTCOUNTNEXT  ==================================================== */
/* =====================================================  DMAENNEXTCTRL  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          AUDADC                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ==============================================  AUDADC CFG CLKSEL [24..26]  =============================================== */
typedef enum {                                  /*!< AUDADC_CFG_CLKSEL                                                         */
  AUDADC_CFG_CLKSEL_HFRC_48MHz         = 0,     /*!< HFRC_48MHz : 48MHz clock sourced from the HFRC                            */
  AUDADC_CFG_CLKSEL_HFRC_48MHz_INV     = 1,     /*!< HFRC_48MHz_INV : Inverted version of the 48MHz clock sourced
                                                     from the HFRC                                                             */
  AUDADC_CFG_CLKSEL_XTAL_HS            = 2,     /*!< XTAL_HS : High Frequency XTAL input (nominally 32 MHz)                    */
  AUDADC_CFG_CLKSEL_HFRC2_31MHz        = 3,     /*!< HFRC2_31MHz : HFRC2 250MHz clock divided-by-8 (31.25MHz)                  */
  AUDADC_CFG_CLKSEL_EXTREFCLK          = 4,     /*!< EXTREFCLK : External reference clock input                                */
  AUDADC_CFG_CLKSEL_OFF                = 5,     /*!< OFF : ADC clock is off; APB clock is HFRC_24MHz                           */
} AUDADC_CFG_CLKSEL_Enum;

/* ============================================  AUDADC CFG RPTTRIGSEL [20..20]  ============================================= */
typedef enum {                                  /*!< AUDADC_CFG_RPTTRIGSEL                                                     */
  AUDADC_CFG_RPTTRIGSEL_TMR            = 0,     /*!< TMR : Trigger from on-chip timer.                                         */
  AUDADC_CFG_RPTTRIGSEL_INT            = 1,     /*!< INT : Trigger from ADC-internal timer.                                    */
} AUDADC_CFG_RPTTRIGSEL_Enum;

