AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKSEL [6..9]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_750KHz = 0,/*!< HFRC_750KHz : 750KHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_1p5MHz = 1,/*!< HFRC_1p5MHz : 1.5MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : 3MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_6MHz = 3,/*!< HFRC_6MHz : 6MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_12MHz = 4,/*!< HFRC_12MHz : 12MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_24MHz = 5,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_48MHz = 6,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC2_125MHz = 9,/*!< HFRC2_125MHz : 125MHz sourced from the HFRC2                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_HFRC2_250MHz = 10,/*!< HFRC2_250MHz : 250MHz sourced from the HFRC2                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI1IOCLKEN [5..5]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI0IOCLKSEL [1..4]  ======================================= */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL                                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_750KHz = 0,/*!< HFRC_750KHz : 750KHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_1p5MHz = 1,/*!< HFRC_1p5MHz : 1.5MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_3MHz = 2,/*!< HFRC_3MHz : 3MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_6MHz = 3,/*!< HFRC_6MHz : 6MHz sourced from the HFRC                                 */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_12MHz = 4,/*!< HFRC_12MHz : 12MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_24MHz = 5,/*!< HFRC_24MHz : 24MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_48MHz = 6,/*!< HFRC_48MHz : 48MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_96MHz = 7,/*!< HFRC_96MHz : 96MHz sourced from the HFRC                              */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC_192MHz = 8,/*!< HFRC_192MHz : 192MHz sourced from the HFRC                           */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC2_125MHz = 9,/*!< HFRC2_125MHz : 125MHz sourced from the HFRC2                        */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_HFRC2_250MHz = 10,/*!< HFRC2_250MHz : 250MHz sourced from the HFRC2                       */
} CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Enum;

/* =======================================  CLKGEN MSPIIOCLKCTRL MSPI0IOCLKEN [0..0]  ======================================== */
typedef enum {                                  /*!< CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN                                         */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_DIS = 0,    /*!< DIS : Disable io clock                                                    */
  CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_EN = 1,     /*!< EN : Enable io clock                                                      */
} CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Enum;

/* ========================================================  CLKCTRL  ======================================================== */
/* ==========================================  CLKGEN CLKCTRL DISPCTRLCLKEN [8..8]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_DISPCTRLCLKEN                                              */
  CLKGEN_CLKCTRL_DISPCTRLCLKEN_DISABLE = 0,     /*!< DISABLE : Display controller clock disabled                               */
  CLKGEN_CLKCTRL_DISPCTRLCLKEN_ENABLE  = 1,     /*!< ENABLE : Display controller clock enabled                                 */
} CLKGEN_CLKCTRL_DISPCTRLCLKEN_Enum;

/* ==========================================  CLKGEN CLKCTRL MCUCLKFORCEON [7..7]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_MCUCLKFORCEON                                              */
  CLKGEN_CLKCTRL_MCUCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operation                                                    */
  CLKGEN_CLKCTRL_MCUCLKFORCEON_ON      = 1,     /*!< ON : Force MCU clock on                                                   */
} CLKGEN_CLKCTRL_MCUCLKFORCEON_Enum;

/* =========================================  CLKGEN CLKCTRL IWICCLKFORCEON [6..6]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_IWICCLKFORCEON                                             */
  CLKGEN_CLKCTRL_IWICCLKFORCEON_OFF    = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_IWICCLKFORCEON_ON     = 1,     /*!< ON : Force IWIC clock on                                                  */
} CLKGEN_CLKCTRL_IWICCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL DBGCLKFORCEON [5..5]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_DBGCLKFORCEON                                              */
  CLKGEN_CLKCTRL_DBGCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_DBGCLKFORCEON_ON      = 1,     /*!< ON : Force DBG clock on                                                   */
} CLKGEN_CLKCTRL_DBGCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL PMUCLKFORCEON [4..4]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_PMUCLKFORCEON                                              */
  CLKGEN_CLKCTRL_PMUCLKFORCEON_OFF     = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_PMUCLKFORCEON_ON      = 1,     /*!< ON : Force PMU clock on                                                   */
} CLKGEN_CLKCTRL_PMUCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL STCLKFORCEON [3..3]  =========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_STCLKFORCEON                                               */
  CLKGEN_CLKCTRL_STCLKFORCEON_OFF      = 0,     /*!< OFF : Normal operaration                                                  */
  CLKGEN_CLKCTRL_STCLKFORCEON_ON       = 1,     /*!< ON : Force ST clock on                                                    */
} CLKGEN_CLKCTRL_STCLKFORCEON_Enum;

/* ==========================================  CLKGEN CLKCTRL GFXCORECLKSEL [1..2]  ========================================== */
typedef enum {                                  /*!< CLKGEN_CLKCTRL_GFXCORECLKSEL                                              */
  CLKGEN_CLKCTRL_GFXCORECLKSEL_HFRC_96MHz = 0,  /*!< HFRC_96MHz : 96MHz sourced from the HFRC                                  */
  CLKGEN_CLKCTRL_GFXCORECLKSEL_HFRC_192MHz = 1, /*!< HFRC_192MHz : 192MHz sourced from the HFRC                                */
  CLKGEN_CLKCTRL_GFXCORECLKSEL_HFRC2_125MHz = 2,/*!< HFRC2_125MHz : 125MHz sourced from the HFRC2                              */
  CLKGEN_CLKCTRL_GFXCORECLKSEL_HFRC2_250MHz = 3,/*!< HFRC2_250MHz : 250MHz sourced from the HFRC2                              */
} CLKGEN_CLKCTRL_GFXCORECLKSEL_Enum;

