AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =============================================  GPIO PINCFG123 DS123 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG123_DS123                                                      */
  GPIO_PINCFG123_DS123_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR123 = 0, 0.63x
                                                     output driver selected if SR123 = 1                                       */
  GPIO_PINCFG123_DS123_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR123 = 0, 0.75x
                                                     output driver selected if SR123 = 1                                       */
  GPIO_PINCFG123_DS123_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR123 = 0, 0.88x
                                                     output driver selected if SR123 = 1                                       */
  GPIO_PINCFG123_DS123_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR123 = 0, 1.0x output
                                                     driver selected if SR123 = 1                                              */
} GPIO_PINCFG123_DS123_Enum;

/* ============================================  GPIO PINCFG123 OUTCFG123 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG123_OUTCFG123                                                  */
  GPIO_PINCFG123_OUTCFG123_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG123_OUTCFG123_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG123_OUTCFG123_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG123_OUTCFG123_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG123_OUTCFG123_Enum;

/* ============================================  GPIO PINCFG123 IRPTEN123 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG123_IRPTEN123                                                  */
  GPIO_PINCFG123_IRPTEN123_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG123_IRPTEN123_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG123_IRPTEN123_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG123_IRPTEN123_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG123_IRPTEN123_Enum;

/* ============================================  GPIO PINCFG123 FNCSEL123 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG123_FNCSEL123                                                  */
  GPIO_PINCFG123_FNCSEL123_MSPI3_8     = 0,     /*!< MSPI3_8 : MSPI Master 3 Interface Signal                                  */
  GPIO_PINCFG123_FNCSEL123_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG123_FNCSEL123_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_CT123       = 6,     /*!< CT123 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG123_FNCSEL123_NCE123      = 7,     /*!< NCE123 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG123_FNCSEL123_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG123_FNCSEL123_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG123_FNCSEL123_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG123_FNCSEL123_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG123_FNCSEL123_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG123_FNCSEL123_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG123_FNCSEL123_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG123_FNCSEL123_Enum;

