AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =======================================================  PINCFG124  ======================================================= */
/* ===========================================  GPIO PINCFG124 NCEPOL124 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG124_NCEPOL124                                                  */
  GPIO_PINCFG124_NCEPOL124_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG124_NCEPOL124_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG124_NCEPOL124_Enum;

/* ===========================================  GPIO PINCFG124 NCESRC124 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG124_NCESRC124                                                  */
  GPIO_PINCFG124_NCESRC124_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG124_NCESRC124_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG124_NCESRC124_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG124_NCESRC124_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG124_NCESRC124_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG124_NCESRC124_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG124_NCESRC124_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG124_NCESRC124_Enum;

/* ==========================================  GPIO PINCFG124 PULLCFG124 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG124_PULLCFG124                                                 */
  GPIO_PINCFG124_PULLCFG124_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG124_PULLCFG124_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG124_PULLCFG124_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG124_PULLCFG124_Enum;

/* =============================================  GPIO PINCFG124 SR124 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG124_SR124                                                      */
  GPIO_PINCFG124_SR124_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG124_SR124_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG124_SR124_Enum;

/* =============================================  GPIO PINCFG124 DS124 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG124_DS124                                                      */
  GPIO_PINCFG124_DS124_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR124 = 0, 0.63x
                                                     output driver selected if SR124 = 1                                       */
  GPIO_PINCFG124_DS124_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR124 = 0, 0.75x
                                                     output driver selected if SR124 = 1                                       */
  GPIO_PINCFG124_DS124_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR124 = 0, 0.88x
                                                     output driver selected if SR124 = 1                                       */
  GPIO_PINCFG124_DS124_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR124 = 0, 1.0x output
                                                     driver selected if SR124 = 1                                              */
} GPIO_PINCFG124_DS124_Enum;

/* ============================================  GPIO PINCFG124 OUTCFG124 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG124_OUTCFG124                                                  */
  GPIO_PINCFG124_OUTCFG124_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG124_OUTCFG124_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG124_OUTCFG124_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG124_OUTCFG124_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG124_OUTCFG124_Enum;

/* ============================================  GPIO PINCFG124 IRPTEN124 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG124_IRPTEN124                                                  */
  GPIO_PINCFG124_IRPTEN124_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG124_IRPTEN124_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG124_IRPTEN124_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG124_IRPTEN124_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG124_IRPTEN124_Enum;

/* ============================================  GPIO PINCFG124 FNCSEL124 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG124_FNCSEL124                                                  */
  GPIO_PINCFG124_FNCSEL124_MSPI3_9     = 0,     /*!< MSPI3_9 : MSPI Master 3 Interface Signal                                  */
  GPIO_PINCFG124_FNCSEL124_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG124_FNCSEL124_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_CT124       = 6,     /*!< CT124 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG124_FNCSEL124_NCE124      = 7,     /*!< NCE124 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG124_FNCSEL124_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG124_FNCSEL124_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG124_FNCSEL124_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG124_FNCSEL124_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG124_FNCSEL124_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG124_FNCSEL124_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG124_FNCSEL124_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG124_FNCSEL124_Enum;

/* =======================================================  PINCFG125  ======================================================= */
/* ===========================================  GPIO PINCFG125 NCEPOL125 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG125_NCEPOL125                                                  */
  GPIO_PINCFG125_NCEPOL125_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG125_NCEPOL125_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG125_NCEPOL125_Enum;

