AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =============================================  GPIO PINCFG138 DS138 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG138_DS138                                                      */
  GPIO_PINCFG138_DS138_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG138_DS138_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG138_DS138_Enum;

/* ============================================  GPIO PINCFG138 OUTCFG138 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG138_OUTCFG138                                                  */
  GPIO_PINCFG138_OUTCFG138_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG138_OUTCFG138_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG138_OUTCFG138_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG138_OUTCFG138_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG138_OUTCFG138_Enum;

/* ============================================  GPIO PINCFG138 IRPTEN138 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG138_IRPTEN138                                                  */
  GPIO_PINCFG138_IRPTEN138_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG138_IRPTEN138_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG138_IRPTEN138_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG138_IRPTEN138_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG138_IRPTEN138_Enum;

/* ============================================  GPIO PINCFG138 FNCSEL138 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG138_FNCSEL138                                                  */
  GPIO_PINCFG138_FNCSEL138_MNCE1_1     = 0,     /*!< MNCE1_1 : MSPI Master 1 nCE 1 Signal                                      */
  GPIO_PINCFG138_FNCSEL138_32KHzXT     = 1,     /*!< 32KHzXT : 32kHZ from analog                                               */
  GPIO_PINCFG138_FNCSEL138_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG138_FNCSEL138_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG138_FNCSEL138_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG138_FNCSEL138_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG138_FNCSEL138_CT138       = 6,     /*!< CT138 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG138_FNCSEL138_NCE138      = 7,     /*!< NCE138 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG138_FNCSEL138_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG138_FNCSEL138_I2S0_SDIN   = 9,     /*!< I2S0_SDIN : I2S Data input (I2S Master/Slave 0)                           */
  GPIO_PINCFG138_FNCSEL138_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG138_FNCSEL138_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG138_FNCSEL138_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG138_FNCSEL138_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG138_FNCSEL138_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG138_FNCSEL138_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG138_FNCSEL138_Enum;

/* =======================================================  PINCFG139  ======================================================= */
/* ===========================================  GPIO PINCFG139 NCEPOL139 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG139_NCEPOL139                                                  */
  GPIO_PINCFG139_NCEPOL139_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG139_NCEPOL139_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG139_NCEPOL139_Enum;

