AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =============================================  GPIO PINCFG140 DS140 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG140_DS140                                                      */
  GPIO_PINCFG140_DS140_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG140_DS140_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG140_DS140_Enum;

/* ============================================  GPIO PINCFG140 OUTCFG140 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG140_OUTCFG140                                                  */
  GPIO_PINCFG140_OUTCFG140_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG140_OUTCFG140_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG140_OUTCFG140_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG140_OUTCFG140_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG140_OUTCFG140_Enum;

/* ============================================  GPIO PINCFG140 IRPTEN140 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG140_IRPTEN140                                                  */
  GPIO_PINCFG140_IRPTEN140_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG140_IRPTEN140_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG140_IRPTEN140_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG140_IRPTEN140_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG140_IRPTEN140_Enum;

/* ============================================  GPIO PINCFG140 FNCSEL140 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG140_FNCSEL140                                                  */
  GPIO_PINCFG140_FNCSEL140_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_DISP_D16    = 1,     /*!< DISP_D16 : Display Data 16                                                */
  GPIO_PINCFG140_FNCSEL140_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG140_FNCSEL140_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_CT140       = 6,     /*!< CT140 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG140_FNCSEL140_NCE140      = 7,     /*!< NCE140 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG140_FNCSEL140_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG140_FNCSEL140_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG140_FNCSEL140_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG140_FNCSEL140_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG140_FNCSEL140_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG140_FNCSEL140_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG140_FNCSEL140_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG140_FNCSEL140_Enum;

/* =======================================================  PINCFG141  ======================================================= */
/* ===========================================  GPIO PINCFG141 NCEPOL141 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG141_NCEPOL141                                                  */
  GPIO_PINCFG141_NCEPOL141_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG141_NCEPOL141_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG141_NCEPOL141_Enum;

