AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ==========================================  GPIO PINCFG149 PULLCFG149 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG149_PULLCFG149                                                 */
  GPIO_PINCFG149_PULLCFG149_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG149_PULLCFG149_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG149_PULLCFG149_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG149_PULLCFG149_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG149_PULLCFG149_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG149_PULLCFG149_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG149_PULLCFG149_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG149_PULLCFG149_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG149_PULLCFG149_Enum;

/* =============================================  GPIO PINCFG149 DS149 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG149_DS149                                                      */
  GPIO_PINCFG149_DS149_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG149_DS149_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG149_DS149_Enum;

/* ============================================  GPIO PINCFG149 OUTCFG149 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG149_OUTCFG149                                                  */
  GPIO_PINCFG149_OUTCFG149_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG149_OUTCFG149_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG149_OUTCFG149_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG149_OUTCFG149_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG149_OUTCFG149_Enum;

/* ============================================  GPIO PINCFG149 IRPTEN149 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG149_IRPTEN149                                                  */
  GPIO_PINCFG149_IRPTEN149_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG149_IRPTEN149_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG149_IRPTEN149_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG149_IRPTEN149_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG149_IRPTEN149_Enum;

/* ============================================  GPIO PINCFG149 FNCSEL149 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG149_FNCSEL149                                                  */
  GPIO_PINCFG149_FNCSEL149_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG149_FNCSEL149_DISP_D6     = 1,     /*!< DISP_D6 : Display Data 6                                                  */
  GPIO_PINCFG149_FNCSEL149_DBIB_D9     = 2,     /*!< DBIB_D9 : Display DBI Data                                                */
  GPIO_PINCFG149_FNCSEL149_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG149_FNCSEL149_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG149_FNCSEL149_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG149_FNCSEL149_CT149       = 6,     /*!< CT149 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG149_FNCSEL149_NCE149      = 7,     /*!< NCE149 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG149_FNCSEL149_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG149_FNCSEL149_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG149_FNCSEL149_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG149_FNCSEL149_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG149_FNCSEL149_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG149_FNCSEL149_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG149_FNCSEL149_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG149_FNCSEL149_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG149_FNCSEL149_Enum;

/* =======================================================  PINCFG150  ======================================================= */
/* ===========================================  GPIO PINCFG150 NCEPOL150 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG150_NCEPOL150                                                  */
  GPIO_PINCFG150_NCEPOL150_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG150_NCEPOL150_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG150_NCEPOL150_Enum;

