AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ==========================================  GPIO PINCFG171 PULLCFG171 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG171_PULLCFG171                                                 */
  GPIO_PINCFG171_PULLCFG171_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG171_PULLCFG171_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG171_PULLCFG171_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG171_PULLCFG171_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG171_PULLCFG171_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG171_PULLCFG171_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG171_PULLCFG171_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG171_PULLCFG171_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG171_PULLCFG171_Enum;

/* =============================================  GPIO PINCFG171 DS171 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG171_DS171                                                      */
  GPIO_PINCFG171_DS171_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG171_DS171_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG171_DS171_Enum;

/* ============================================  GPIO PINCFG171 OUTCFG171 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG171_OUTCFG171                                                  */
  GPIO_PINCFG171_OUTCFG171_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG171_OUTCFG171_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG171_OUTCFG171_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG171_OUTCFG171_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG171_OUTCFG171_Enum;

/* ============================================  GPIO PINCFG171 IRPTEN171 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG171_IRPTEN171                                                  */
  GPIO_PINCFG171_IRPTEN171_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG171_IRPTEN171_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG171_IRPTEN171_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG171_IRPTEN171_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG171_IRPTEN171_Enum;

/* ============================================  GPIO PINCFG171 FNCSEL171 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG171_FNCSEL171                                                  */
  GPIO_PINCFG171_FNCSEL171_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED3   = 3,     /*!< RESERVED3 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED6   = 6,     /*!< RESERVED6 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED7   = 7,     /*!< RESERVED7 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG171_FNCSEL171_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG171_FNCSEL171_RESERVED11  = 11,    /*!< RESERVED11 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG171_FNCSEL171_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG171_FNCSEL171_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG171_FNCSEL171_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG171_FNCSEL171_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG171_FNCSEL171_Enum;

