AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ============================================  GPIO PINCFG173 OUTCFG173 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG173_OUTCFG173                                                  */
  GPIO_PINCFG173_OUTCFG173_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG173_OUTCFG173_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG173_OUTCFG173_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG173_OUTCFG173_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG173_OUTCFG173_Enum;

/* ============================================  GPIO PINCFG173 IRPTEN173 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG173_IRPTEN173                                                  */
  GPIO_PINCFG173_IRPTEN173_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG173_IRPTEN173_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG173_IRPTEN173_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG173_IRPTEN173_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG173_IRPTEN173_Enum;

/* ============================================  GPIO PINCFG173 FNCSEL173 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG173_FNCSEL173                                                  */
  GPIO_PINCFG173_FNCSEL173_SLFDINT     = 0,     /*!< SLFDINT : I2C Slave FD1 interrupt                                         */
  GPIO_PINCFG173_FNCSEL173_SLFD1INT    = 1,     /*!< SLFD1INT : I2C Slave FD2 interrupt                                        */
  GPIO_PINCFG173_FNCSEL173_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG173_FNCSEL173_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG173_FNCSEL173_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG173_FNCSEL173_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG173_FNCSEL173_CT173       = 6,     /*!< CT173 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG173_FNCSEL173_NCE173      = 7,     /*!< NCE173 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG173_FNCSEL173_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG173_FNCSEL173_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG173_FNCSEL173_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG173_FNCSEL173_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG173_FNCSEL173_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG173_FNCSEL173_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG173_FNCSEL173_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG173_FNCSEL173_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG173_FNCSEL173_Enum;

/* =======================================================  PINCFG174  ======================================================= */
/* ===========================================  GPIO PINCFG174 NCEPOL174 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG174_NCEPOL174                                                  */
  GPIO_PINCFG174_NCEPOL174_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG174_NCEPOL174_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG174_NCEPOL174_Enum;

/* ===========================================  GPIO PINCFG174 NCESRC174 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG174_NCESRC174                                                  */
  GPIO_PINCFG174_NCESRC174_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG174_NCESRC174_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG174_NCESRC174_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG174_NCESRC174_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG174_NCESRC174_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG174_NCESRC174_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG174_NCESRC174_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG174_NCESRC174_Enum;

