AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =============================================  GPIO PINCFG187 DS187 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG187_DS187                                                      */
  GPIO_PINCFG187_DS187_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG187_DS187_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG187_DS187_Enum;

/* ============================================  GPIO PINCFG187 OUTCFG187 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG187_OUTCFG187                                                  */
  GPIO_PINCFG187_OUTCFG187_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG187_OUTCFG187_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG187_OUTCFG187_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG187_OUTCFG187_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG187_OUTCFG187_Enum;

/* ============================================  GPIO PINCFG187 IRPTEN187 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG187_IRPTEN187                                                  */
  GPIO_PINCFG187_IRPTEN187_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG187_IRPTEN187_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG187_IRPTEN187_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG187_IRPTEN187_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG187_IRPTEN187_Enum;

/* ============================================  GPIO PINCFG187 FNCSEL187 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG187_FNCSEL187                                                  */
  GPIO_PINCFG187_FNCSEL187_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_DISP_DE     = 1,     /*!< DISP_DE : Display RGB Data Enable                                         */
  GPIO_PINCFG187_FNCSEL187_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG187_FNCSEL187_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_CT187       = 6,     /*!< CT187 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG187_FNCSEL187_NCE187      = 7,     /*!< NCE187 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG187_FNCSEL187_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG187_FNCSEL187_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG187_FNCSEL187_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG187_FNCSEL187_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG187_FNCSEL187_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG187_FNCSEL187_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG187_FNCSEL187_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG187_FNCSEL187_Enum;

/* =======================================================  PINCFG188  ======================================================= */
/* ===========================================  GPIO PINCFG188 NCEPOL188 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG188_NCEPOL188                                                  */
  GPIO_PINCFG188_NCEPOL188_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG188_NCEPOL188_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG188_NCEPOL188_Enum;

