AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ==========================================  GPIO PINCFG203 PULLCFG203 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG203_PULLCFG203                                                 */
  GPIO_PINCFG203_PULLCFG203_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG203_PULLCFG203_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG203_PULLCFG203_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG203_PULLCFG203_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG203_PULLCFG203_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG203_PULLCFG203_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG203_PULLCFG203_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG203_PULLCFG203_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG203_PULLCFG203_Enum;

/* =============================================  GPIO PINCFG203 DS203 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG203_DS203                                                      */
  GPIO_PINCFG203_DS203_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG203_DS203_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG203_DS203_Enum;

/* ============================================  GPIO PINCFG203 OUTCFG203 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG203_OUTCFG203                                                  */
  GPIO_PINCFG203_OUTCFG203_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG203_OUTCFG203_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG203_OUTCFG203_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG203_OUTCFG203_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG203_OUTCFG203_Enum;

/* ============================================  GPIO PINCFG203 IRPTEN203 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG203_IRPTEN203                                                  */
  GPIO_PINCFG203_IRPTEN203_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG203_IRPTEN203_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG203_IRPTEN203_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG203_IRPTEN203_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG203_IRPTEN203_Enum;

/* ============================================  GPIO PINCFG203 FNCSEL203 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG203_FNCSEL203                                                  */
  GPIO_PINCFG203_FNCSEL203_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED3   = 3,     /*!< RESERVED3 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED6   = 6,     /*!< RESERVED6 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED7   = 7,     /*!< RESERVED7 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG203_FNCSEL203_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG203_FNCSEL203_RESERVED11  = 11,    /*!< RESERVED11 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG203_FNCSEL203_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG203_FNCSEL203_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG203_FNCSEL203_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG203_FNCSEL203_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG203_FNCSEL203_Enum;

/* =======================================================  PINCFG204  ======================================================= */
/* ===========================================  GPIO PINCFG204 NCEPOL204 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG204_NCEPOL204                                                  */
  GPIO_PINCFG204_NCEPOL204_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG204_NCEPOL204_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG204_NCEPOL204_Enum;

/* ===========================================  GPIO PINCFG204 NCESRC204 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG204_NCESRC204                                                  */
  GPIO_PINCFG204_NCESRC204_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG204_NCESRC204_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG204_NCESRC204_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG204_NCESRC204_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG204_NCESRC204_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG204_NCESRC204_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG204_NCESRC204_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG204_NCESRC204_Enum;

/* ==========================================  GPIO PINCFG204 PULLCFG204 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG204_PULLCFG204                                                 */
  GPIO_PINCFG204_PULLCFG204_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG204_PULLCFG204_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG204_PULLCFG204_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG204_PULLCFG204_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG204_PULLCFG204_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG204_PULLCFG204_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG204_PULLCFG204_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG204_PULLCFG204_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG204_PULLCFG204_Enum;

/* =============================================  GPIO PINCFG204 DS204 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG204_DS204                                                      */
  GPIO_PINCFG204_DS204_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG204_DS204_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG204_DS204_Enum;

/* ============================================  GPIO PINCFG204 OUTCFG204 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG204_OUTCFG204                                                  */
  GPIO_PINCFG204_OUTCFG204_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG204_OUTCFG204_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG204_OUTCFG204_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG204_OUTCFG204_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG204_OUTCFG204_Enum;

/* ============================================  GPIO PINCFG204 IRPTEN204 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG204_IRPTEN204                                                  */
  GPIO_PINCFG204_IRPTEN204_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG204_IRPTEN204_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG204_IRPTEN204_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG204_IRPTEN204_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG204_IRPTEN204_Enum;

/* ============================================  GPIO PINCFG204 FNCSEL204 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG204_FNCSEL204                                                  */
  GPIO_PINCFG204_FNCSEL204_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED3   = 3,     /*!< RESERVED3 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED6   = 6,     /*!< RESERVED6 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED7   = 7,     /*!< RESERVED7 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG204_FNCSEL204_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG204_FNCSEL204_RESERVED11  = 11,    /*!< RESERVED11 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG204_FNCSEL204_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG204_FNCSEL204_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG204_FNCSEL204_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG204_FNCSEL204_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG204_FNCSEL204_Enum;

/* =======================================================  PINCFG205  ======================================================= */
/* ===========================================  GPIO PINCFG205 NCEPOL205 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG205_NCEPOL205                                                  */
  GPIO_PINCFG205_NCEPOL205_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG205_NCEPOL205_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG205_NCEPOL205_Enum;

