AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ============================================  GPIO PINCFG211 OUTCFG211 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG211_OUTCFG211                                                  */
  GPIO_PINCFG211_OUTCFG211_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG211_OUTCFG211_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG211_OUTCFG211_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG211_OUTCFG211_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG211_OUTCFG211_Enum;

/* ============================================  GPIO PINCFG211 IRPTEN211 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG211_IRPTEN211                                                  */
  GPIO_PINCFG211_IRPTEN211_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG211_IRPTEN211_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG211_IRPTEN211_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG211_IRPTEN211_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG211_IRPTEN211_Enum;

/* ============================================  GPIO PINCFG211 FNCSEL211 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG211_FNCSEL211                                                  */
  GPIO_PINCFG211_FNCSEL211_DISP_R1     = 0,     /*!< DISP_R1 : Display MiP Red Bit 1                                           */
  GPIO_PINCFG211_FNCSEL211_DISP_D23    = 1,     /*!< DISP_D23 : Display Data 23                                                */
  GPIO_PINCFG211_FNCSEL211_DBIB_WRX    = 2,     /*!< DBIB_WRX : Display DBI Write                                              */
  GPIO_PINCFG211_FNCSEL211_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG211_FNCSEL211_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG211_FNCSEL211_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG211_FNCSEL211_CT211       = 6,     /*!< CT211 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG211_FNCSEL211_NCE211      = 7,     /*!< NCE211 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG211_FNCSEL211_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG211_FNCSEL211_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG211_FNCSEL211_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG211_FNCSEL211_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG211_FNCSEL211_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG211_FNCSEL211_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG211_FNCSEL211_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG211_FNCSEL211_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG211_FNCSEL211_Enum;

/* =======================================================  PINCFG212  ======================================================= */
/* ===========================================  GPIO PINCFG212 NCEPOL212 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG212_NCEPOL212                                                  */
  GPIO_PINCFG212_NCEPOL212_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG212_NCEPOL212_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG212_NCEPOL212_Enum;

/* ===========================================  GPIO PINCFG212 NCESRC212 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG212_NCESRC212                                                  */
  GPIO_PINCFG212_NCESRC212_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG212_NCESRC212_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG212_NCESRC212_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG212_NCESRC212_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG212_NCESRC212_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG212_NCESRC212_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG212_NCESRC212_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG212_NCESRC212_Enum;

/* ==========================================  GPIO PINCFG212 PULLCFG212 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG212_PULLCFG212                                                 */
  GPIO_PINCFG212_PULLCFG212_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG212_PULLCFG212_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG212_PULLCFG212_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG212_PULLCFG212_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG212_PULLCFG212_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG212_PULLCFG212_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG212_PULLCFG212_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG212_PULLCFG212_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG212_PULLCFG212_Enum;

/* =============================================  GPIO PINCFG212 DS212 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG212_DS212                                                      */
  GPIO_PINCFG212_DS212_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG212_DS212_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG212_DS212_Enum;

