AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ============================================  GPIO PINCFG215 FNCSEL215 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG215_FNCSEL215                                                  */
  GPIO_PINCFG215_FNCSEL215_DISP_B1     = 0,     /*!< DISP_B1 : Display MiP Blue Bit 1                                          */
  GPIO_PINCFG215_FNCSEL215_DISP_D19    = 1,     /*!< DISP_D19 : Display Data 19                                                */
  GPIO_PINCFG215_FNCSEL215_DBIB_D2     = 2,     /*!< DBIB_D2 : Display DBI Data                                                */
  GPIO_PINCFG215_FNCSEL215_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG215_FNCSEL215_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG215_FNCSEL215_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG215_FNCSEL215_CT215       = 6,     /*!< CT215 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG215_FNCSEL215_NCE215      = 7,     /*!< NCE215 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG215_FNCSEL215_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG215_FNCSEL215_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG215_FNCSEL215_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG215_FNCSEL215_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG215_FNCSEL215_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG215_FNCSEL215_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG215_FNCSEL215_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG215_FNCSEL215_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG215_FNCSEL215_Enum;

/* =======================================================  PINCFG216  ======================================================= */
/* ===========================================  GPIO PINCFG216 NCEPOL216 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG216_NCEPOL216                                                  */
  GPIO_PINCFG216_NCEPOL216_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG216_NCEPOL216_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG216_NCEPOL216_Enum;

/* ===========================================  GPIO PINCFG216 NCESRC216 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG216_NCESRC216                                                  */
  GPIO_PINCFG216_NCESRC216_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG216_NCESRC216_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG216_NCESRC216_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG216_NCESRC216_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG216_NCESRC216_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG216_NCESRC216_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG216_NCESRC216_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG216_NCESRC216_Enum;

/* ==========================================  GPIO PINCFG216 PULLCFG216 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG216_PULLCFG216                                                 */
  GPIO_PINCFG216_PULLCFG216_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG216_PULLCFG216_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG216_PULLCFG216_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG216_PULLCFG216_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG216_PULLCFG216_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG216_PULLCFG216_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG216_PULLCFG216_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG216_PULLCFG216_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG216_PULLCFG216_Enum;

