AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ========================================================  RXDATA  ========================================================= */
/* =======================================================  RXCHANID  ======================================================== */
/* =====================================================  RXFIFOSTATUS  ====================================================== */
/* ======================================================  RXFIFOSIZE  ======================================================= */
/* =====================================================  RXUPPERLIMIT  ====================================================== */
/* ========================================================  TXDATA  ========================================================= */
/* =======================================================  TXCHANID  ======================================================== */
/* =====================================================  TXFIFOSTATUS  ====================================================== */
/* ======================================================  TXFIFOSIZE  ======================================================= */
/* =====================================================  TXLOWERLIMIT  ====================================================== */
/* ======================================================  I2SDATACFG  ======================================================= */
/* ============================================  I2S0 I2SDATACFG FRLEN2 [24..30]  ============================================ */
typedef enum {                                  /*!< I2S0_I2SDATACFG_FRLEN2                                                    */
  I2S0_I2SDATACFG_FRLEN2_1CHLS         = 0,     /*!< 1CHLS : One channel in phase 2.                                           */
  I2S0_I2SDATACFG_FRLEN2_2CHLS         = 1,     /*!< 2CHLS : Two channels in phase 2.                                          */
  I2S0_I2SDATACFG_FRLEN2_3CHLS         = 2,     /*!< 3CHLS : Three channels in phase 2.                                        */
  I2S0_I2SDATACFG_FRLEN2_4CHLS         = 3,     /*!< 4CHLS : Four channels in phase 2.                                         */
  I2S0_I2SDATACFG_FRLEN2_5CHLS         = 4,     /*!< 5CHLS : Five channels in phase 2.                                         */
  I2S0_I2SDATACFG_FRLEN2_6CHLS         = 5,     /*!< 6CHLS : Six channels in phase 2.                                          */
  I2S0_I2SDATACFG_FRLEN2_7CHLS         = 6,     /*!< 7CHLS : Seven channels in phase 2.                                        */
  I2S0_I2SDATACFG_FRLEN2_8CHLS         = 7,     /*!< 8CHLS : Eight channels in phase 2.                                        */
  I2S0_I2SDATACFG_FRLEN2_128CHLS       = 127,   /*!< 128CHLS : 128 channels in phase 2.                                        */
} I2S0_I2SDATACFG_FRLEN2_Enum;

/* ============================================  I2S0 I2SDATACFG WDLEN2 [21..23]  ============================================ */
typedef enum {                                  /*!< I2S0_I2SDATACFG_WDLEN2                                                    */
  I2S0_I2SDATACFG_WDLEN2_8b            = 0,     /*!< 8b : Receive channel length is 8 bits for phase 2.                        */
  I2S0_I2SDATACFG_WDLEN2_12b           = 1,     /*!< 12b : Receive channel length is 12 bits for phase 2.                      */
  I2S0_I2SDATACFG_WDLEN2_16b           = 2,     /*!< 16b : Receive channel length is 16 bits for phase 2.                      */
  I2S0_I2SDATACFG_WDLEN2_20b           = 3,     /*!< 20b : Receive channel length is 20 bits for phase 2.                      */
  I2S0_I2SDATACFG_WDLEN2_24b           = 4,     /*!< 24b : Receive channel length is 24 bits for phase 2.                      */
  I2S0_I2SDATACFG_WDLEN2_32b           = 5,     /*!< 32b : Receive channel length is 32 bits for phase 2.                      */
} I2S0_I2SDATACFG_WDLEN2_Enum;

/* =============================================  I2S0 I2SDATACFG SSZ2 [16..18]  ============================================= */
typedef enum {                                  /*!< I2S0_I2SDATACFG_SSZ2                                                      */
  I2S0_I2SDATACFG_SSZ2_8b              = 0,     /*!< 8b : Receive audio sample length is 8 bits for phase 2.                   */
  I2S0_I2SDATACFG_SSZ2_12b             = 1,     /*!< 12b : Receive audio sample length is 12 bits for phase 2.                 */
  I2S0_I2SDATACFG_SSZ2_16b             = 2,     /*!< 16b : Receive audio sample length is 16 bits for phase 2.                 */
  I2S0_I2SDATACFG_SSZ2_20b             = 3,     /*!< 20b : Receive audio sample length is 20 bits for phase 2.                 */
  I2S0_I2SDATACFG_SSZ2_24b             = 4,     /*!< 24b : Receive audio sample length is 24 bits for phase 2.                 */
  I2S0_I2SDATACFG_SSZ2_32b             = 5,     /*!< 32b : Receive audio sample length is 32 bits for phase 2.                 */
} I2S0_I2SDATACFG_SSZ2_Enum;

/* ============================================  I2S0 I2SDATACFG FRLEN1 [8..14]  ============================================= */
typedef enum {                                  /*!< I2S0_I2SDATACFG_FRLEN1                                                    */
  I2S0_I2SDATACFG_FRLEN1_1CHLS         = 0,     /*!< 1CHLS : One channel in phase 1.                                           */
  I2S0_I2SDATACFG_FRLEN1_2CHLS         = 1,     /*!< 2CHLS : Two channels in phase 1.                                          */
  I2S0_I2SDATACFG_FRLEN1_3CHLS         = 2,     /*!< 3CHLS : Three channels in phase 1.                                        */
  I2S0_I2SDATACFG_FRLEN1_4CHLS         = 3,     /*!< 4CHLS : Four channels in phase 1.                                         */
  I2S0_I2SDATACFG_FRLEN1_5CHLS         = 4,     /*!< 5CHLS : Five channels in phase 1.                                         */
  I2S0_I2SDATACFG_FRLEN1_6CHLS         = 5,     /*!< 6CHLS : Six channels in phase 1.                                          */
  I2S0_I2SDATACFG_FRLEN1_7CHLS         = 6,     /*!< 7CHLS : Seven channels in phase 1.                                        */
  I2S0_I2SDATACFG_FRLEN1_8CHLS         = 7,     /*!< 8CHLS : Eight channels in phase 1.                                        */
  I2S0_I2SDATACFG_FRLEN1_128CHLS       = 127,   /*!< 128CHLS : 128 channels in phase 1.                                        */
} I2S0_I2SDATACFG_FRLEN1_Enum;

