AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ===============================================  IOSLAVE CFG IFCSEL [0..0]  =============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_IFCSEL                                                        */
  IOSLAVE_CFG_IFCSEL_I2C               = 0,     /*!< I2C : Selects I2C interface for the IO Slave.                             */
  IOSLAVE_CFG_IFCSEL_SPI               = 1,     /*!< SPI : Selects SPI interface for the IO Slave.                             */
} IOSLAVE_CFG_IFCSEL_Enum;

/* =========================================================  PRENC  ========================================================= */
/* =======================================================  IOINTCTL  ======================================================== */
/* ========================================================  GENADD  ========================================================= */
/* ========================================================  ADDPTR  ========================================================= */
/* ========================================================  DMACFG  ========================================================= */
/* ===========================================  IOSLAVE DMACFG FRCRDWRT [26..26]  ============================================ */
typedef enum {                                  /*!< IOSLAVE_DMACFG_FRCRDWRT                                                   */
  IOSLAVE_DMACFG_FRCRDWRT_FRCWRT       = 0,     /*!< FRCWRT : Force DMA transfer write                                         */
  IOSLAVE_DMACFG_FRCRDWRT_FRCRD        = 1,     /*!< FRCRD : Force DMA transfer read                                           */
} IOSLAVE_DMACFG_FRCRDWRT_Enum;

/* ============================================  IOSLAVE DMACFG FRCDMA [25..25]  ============================================= */
typedef enum {                                  /*!< IOSLAVE_DMACFG_FRCDMA                                                     */
  IOSLAVE_DMACFG_FRCDMA_NOFORCE        = 0,     /*!< NOFORCE : Do not force read/write                                         */
  IOSLAVE_DMACFG_FRCDMA_FORCE          = 1,     /*!< FORCE : Force DMA read or DMA write, depending on FRCRDWRT bit            */
} IOSLAVE_DMACFG_FRCDMA_Enum;

/* ===========================================  IOSLAVE DMACFG PADBYTEEN [24..24]  =========================================== */
typedef enum {                                  /*!< IOSLAVE_DMACFG_PADBYTEEN                                                  */
  IOSLAVE_DMACFG_PADBYTEEN_DIS         = 0,     /*!< DIS : Disable PAD Byte Function                                           */
  IOSLAVE_DMACFG_PADBYTEEN_EN          = 1,     /*!< EN : Enable PAD Byte Function                                             */
} IOSLAVE_DMACFG_PADBYTEEN_Enum;

/* ============================================  IOSLAVE DMACFG DMAQUAD [10..10]  ============================================ */
typedef enum {                                  /*!< IOSLAVE_DMACFG_DMAQUAD                                                    */
  IOSLAVE_DMACFG_DMAQUAD_SINGLE        = 0,     /*!< SINGLE : Transfer one word per DMA request                                */
  IOSLAVE_DMACFG_DMAQUAD_QUAD          = 1,     /*!< QUAD : Transfer up to four words per DMA request                          */
} IOSLAVE_DMACFG_DMAQUAD_Enum;

/* =============================================  IOSLAVE DMACFG DPWROFF [9..9]  ============================================= */
typedef enum {                                  /*!< IOSLAVE_DMACFG_DPWROFF                                                    */
  IOSLAVE_DMACFG_DPWROFF_DIS           = 0,     /*!< DIS : Power off disabled                                                  */
  IOSLAVE_DMACFG_DPWROFF_EN            = 1,     /*!< EN : Power off enabled                                                    */
} IOSLAVE_DMACFG_DPWROFF_Enum;

/* =============================================  IOSLAVE DMACFG DMAPRI [8..8]  ============================================== */
typedef enum {                                  /*!< IOSLAVE_DMACFG_DMAPRI                                                     */
  IOSLAVE_DMACFG_DMAPRI_LOW            = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  IOSLAVE_DMACFG_DMAPRI_HIGH           = 1,     /*!< HIGH : High Priority (service immediately)                                */
} IOSLAVE_DMACFG_DMAPRI_Enum;

/* =============================================  IOSLAVE DMACFG DMADIR [1..1]  ============================================== */
typedef enum {                                  /*!< IOSLAVE_DMACFG_DMADIR                                                     */
  IOSLAVE_DMACFG_DMADIR_P2M            = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. To be set when
                                                     doing DMA read operations, ie reading data from external
                                                     devices.                                                                  */
  IOSLAVE_DMACFG_DMADIR_M2P            = 1,     /*!< M2P : Memory to Peripheral transaction. To be set when doing
                                                     DMA write operations, ie writing data to external devices.                */
} IOSLAVE_DMACFG_DMADIR_Enum;

/* ==============================================  IOSLAVE DMACFG DMAEN [0..0]  ============================================== */
typedef enum {                                  /*!< IOSLAVE_DMACFG_DMAEN                                                      */
  IOSLAVE_DMACFG_DMAEN_DIS             = 0,     /*!< DIS : Disable DMA Function                                                */
  IOSLAVE_DMACFG_DMAEN_EN              = 1,     /*!< EN : Enable DMA Function                                                  */
} IOSLAVE_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ======================================================  REGACCINTEN  ====================================================== */
/* =====================================================  REGACCINTSTAT  ===================================================== */
/* =====================================================  REGACCINTCLR  ====================================================== */
/* =====================================================  REGACCINTSET  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIPPN  ========================================================= */
/* ==============================================  MCUCTRL CHIPPN PN [24..31]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PN                                                         */
  MCUCTRL_CHIPPN_PN_APOLLO5            = 16,    /*!< APOLLO5 : Apollo510 part number is 0x10xxxxxx.                            */
} MCUCTRL_CHIPPN_PN_Enum;

/* ===========================================  MCUCTRL CHIPPN MRAMSIZE [20..23]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_MRAMSIZE                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_4MB          = 3,     /*!< 4MB : MRAM size is 4MB.                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_3MB          = 2,     /*!< 3MB : MRAM size is 3MB.                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_2MB          = 1,     /*!< 2MB : MRAM size is 2MB.                                                   */
  MCUCTRL_CHIPPN_MRAMSIZE_1MB          = 0,     /*!< 1MB : MRAM size is 1MB.                                                   */
} MCUCTRL_CHIPPN_MRAMSIZE_Enum;

