AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ===========================================  MCUCTRL CHIPPN SRAMSIZE [16..19]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_SRAMSIZE                                                   */
  MCUCTRL_CHIPPN_SRAMSIZE_ITCM256K_DTCM512K_SSRAM3M = 3,/*!< ITCM256K_DTCM512K_SSRAM3M : ITCM=256KB, DTCM=512KB, SSRAM=3MB     */
  MCUCTRL_CHIPPN_SRAMSIZE_ITCM256K_DTCM512K_SSRAM2M = 2,/*!< ITCM256K_DTCM512K_SSRAM2M : ITCM=256KB, DTCM=512KB, SSRAM=2MB     */
  MCUCTRL_CHIPPN_SRAMSIZE_ITCM128K_DTCM256K_SSRAM2M = 1,/*!< ITCM128K_DTCM256K_SSRAM2M : ITCM=128KB, DTCM=256KB, SSRAM=2MB     */
  MCUCTRL_CHIPPN_SRAMSIZE_ITCM128K_DTCM256K_SSRAM1M = 0,/*!< ITCM128K_DTCM256K_SSRAM1M : ITCM=128KB, DTCM=256KB, SSRAM=1MB     */
} MCUCTRL_CHIPPN_SRAMSIZE_Enum;

/* ==============================================  MCUCTRL CHIPPN PINS [3..5]  =============================================== */
typedef enum {                                  /*!< MCUCTRL_CHIPPN_PINS                                                       */
  MCUCTRL_CHIPPN_PINS_PINS274          = 1,     /*!< PINS274 : The number of pins = 274                                        */
  MCUCTRL_CHIPPN_PINS_PINS231          = 0,     /*!< PINS231 : The number of pins = 231                                        */
} MCUCTRL_CHIPPN_PINS_Enum;

/* ========================================================  CHIPID0  ======================================================== */
/* ========================================================  CHIPID1  ======================================================== */
/* ========================================================  CHIPREV  ======================================================== */
/* =============================================  MCUCTRL CHIPREV REVMAJ [4..7]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMAJ                                                    */
  MCUCTRL_CHIPREV_REVMAJ_C             = 3,     /*!< C : Apollo510 revision C                                                  */
  MCUCTRL_CHIPREV_REVMAJ_B             = 2,     /*!< B : Apollo510 revision B                                                  */
  MCUCTRL_CHIPREV_REVMAJ_A             = 1,     /*!< A : Apollo510 revision A                                                  */
} MCUCTRL_CHIPREV_REVMAJ_Enum;

/* =============================================  MCUCTRL CHIPREV REVMIN [0..3]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_CHIPREV_REVMIN                                                    */
  MCUCTRL_CHIPREV_REVMIN_REV2          = 3,     /*!< REV2 : Apollo510 minor rev 2.                                             */
  MCUCTRL_CHIPREV_REVMIN_REV1          = 2,     /*!< REV1 : Apollo510 minor rev 1.                                             */
  MCUCTRL_CHIPREV_REVMIN_REV0          = 1,     /*!< REV0 : Apollo510 minor rev 0. Minor revision value, succeeding
                                                     minor revisions will increment from this value.                           */
} MCUCTRL_CHIPREV_REVMIN_Enum;

/* =======================================================  VENDORID  ======================================================== */
/* ===========================================  MCUCTRL VENDORID VENDORID [0..31]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_VENDORID_VENDORID                                                 */
  MCUCTRL_VENDORID_VENDORID_AMBIQ      = 1095582289,/*!< AMBIQ : Ambiq Vendor ID 'AMBQ'                                        */
  MCUCTRL_VENDORID_VENDORID_DEFAULT    = 0,     /*!< DEFAULT : Default Vendor ID                                               */
} MCUCTRL_VENDORID_VENDORID_Enum;

/* ==========================================================  SKU  ========================================================== */
/* ============================================  MCUCTRL SKU SKUMRAMSIZE [2..3]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUMRAMSIZE                                                   */
  MCUCTRL_SKU_SKUMRAMSIZE_1MB          = 0,     /*!< 1MB : Total available MRAM size is 1MB.                                   */
  MCUCTRL_SKU_SKUMRAMSIZE_2MB          = 1,     /*!< 2MB : Total available MRAM size is 2MB.                                   */
  MCUCTRL_SKU_SKUMRAMSIZE_3MB          = 2,     /*!< 3MB : Total available MRAM size is 3MB.                                   */
  MCUCTRL_SKU_SKUMRAMSIZE_4MB          = 3,     /*!< 4MB : Total available MRAM size is 4MB.                                   */
} MCUCTRL_SKU_SKUMRAMSIZE_Enum;

/* ============================================  MCUCTRL SKU SKUSRAMSIZE [0..1]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_SKU_SKUSRAMSIZE                                                   */
  MCUCTRL_SKU_SKUSRAMSIZE_1MB          = 0,     /*!< 1MB : Total available System SRAM size is 1MB (SSRAM0 only).              */
  MCUCTRL_SKU_SKUSRAMSIZE_2MB          = 1,     /*!< 2MB : Total available System SRAM size is 2MB (SSRAM0 and SSRAM1).        */
  MCUCTRL_SKU_SKUSRAMSIZE_RESVD        = 2,     /*!< RESVD : This value is reserved.                                           */
  MCUCTRL_SKU_SKUSRAMSIZE_3MB          = 3,     /*!< 3MB : Total available System SRAM size is 3MB (SSRAM0, SSRAM1,
                                                     and SSRAM2).                                                              */
} MCUCTRL_SKU_SKUSRAMSIZE_Enum;

/* ======================================================  SKUOVERRIDE  ====================================================== */
/* =======================================================  DEBUGGER  ======================================================== */
/* =========================================================  ACRG  ========================================================== */
/* ===========================================  MCUCTRL ACRG ACRGIBIASSEL [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_ACRG_ACRGIBIASSEL                                                 */
  MCUCTRL_ACRG_ACRGIBIASSEL_BGSEL      = 0,     /*!< BGSEL : Selects the bandgap                                               */
  MCUCTRL_ACRG_ACRGIBIASSEL_CCRGSEL    = 1,     /*!< CCRGSEL : Selects the CCRG                                                */
} MCUCTRL_ACRG_ACRGIBIASSEL_Enum;

/* ==============================================  MCUCTRL ACRG ACRGPWD [1..1]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_ACRG_ACRGPWD                                                      */
  MCUCTRL_ACRG_ACRGPWD_ACRG_PWR_DN     = 1,     /*!< ACRG_PWR_DN : Powers down the ACRG trim.                                  */
  MCUCTRL_ACRG_ACRGPWD_ACRG_PWR_UP     = 0,     /*!< ACRG_PWR_UP : Power up the ACRG trim.                                     */
} MCUCTRL_ACRG_ACRGPWD_Enum;

/* =======================================================  VREFGEN2  ======================================================== */
/* =======================================================  VREFGEN4  ======================================================== */
/* ========================================================  VREFBUF  ======================================================== */
/* ========================================================  VRCTRL  ========================================================= */
/* ========================================================  LDOREG1  ======================================================== */
/* ========================================================  LDOREG2  ======================================================== */
/* =========================================================  LFRC  ========================================================== */
/* =========================================  MCUCTRL LFRC LFRCSIMOCLKDIV [10..12]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_LFRC_LFRCSIMOCLKDIV                                               */
  MCUCTRL_LFRC_LFRCSIMOCLKDIV_DIV1     = 0,     /*!< DIV1 : Divide by 1                                                        */
  MCUCTRL_LFRC_LFRCSIMOCLKDIV_DIV2     = 1,     /*!< DIV2 : Divide by 2                                                        */
  MCUCTRL_LFRC_LFRCSIMOCLKDIV_DIV4     = 2,     /*!< DIV4 : Divide by 4                                                        */
  MCUCTRL_LFRC_LFRCSIMOCLKDIV_DIV8     = 3,     /*!< DIV8 : Divide by 8                                                        */
  MCUCTRL_LFRC_LFRCSIMOCLKDIV_DIV32    = 5,     /*!< DIV32 : Inversion of DIV32                                                */
} MCUCTRL_LFRC_LFRCSIMOCLKDIV_Enum;

/* =============================================  MCUCTRL LFRC RESETLFRC [7..7]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_LFRC_RESETLFRC                                                    */
  MCUCTRL_LFRC_RESETLFRC_EN            = 0,     /*!< EN : Enable LFRC.                                                         */
  MCUCTRL_LFRC_RESETLFRC_RESET         = 1,     /*!< RESET : Reset LFRC.                                                       */
} MCUCTRL_LFRC_RESETLFRC_Enum;

