AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ===========================================  MCUCTRL BOOTLOADER SBRLOCK [1..1]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SBRLOCK                                                */
  MCUCTRL_BOOTLOADER_SBRLOCK_LOCK      = 1,     /*!< LOCK : Enable the secure boot lock                                        */
  MCUCTRL_BOOTLOADER_SBRLOCK_DEFAULT   = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_BOOTLOADER_SBRLOCK_Enum;

/* ======================================================  SHADOWVALID  ====================================================== */
/* =======================================  MCUCTRL SHADOWVALID OTPBOOTFAULT [7..12]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPBOOTFAULT                                          */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_power_fault = 1,/*!< power_fault : Indicate OTP Power fault                                 */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_output_data = 2,/*!< output_data : Conflict on OTP output data                              */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_input_parity = 4,/*!< input_parity : input parity check error                               */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_metal_shielding = 8,/*!< metal_shielding : metal shielding fault                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_fsm_error = 16,/*!< fsm_error : fsm parity error                                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_reg_error = 32,/*!< reg_error : critical reg parity error                                   */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_no_error = 0,/*!< no_error : No OTP interrupt happens during boot stage                     */
} MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Enum;

/* ==========================================  MCUCTRL SHADOWVALID OTPREADY [6..6]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPREADY                                              */
  MCUCTRL_SHADOWVALID_OTPREADY_VALID   = 1,     /*!< VALID : Indicate OTP is ready for access                                  */
  MCUCTRL_SHADOWVALID_OTPREADY_DEFAULT = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_OTPREADY_Enum;

/* ========================================  MCUCTRL SHADOWVALID INFO0SELOTP [4..4]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO0SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_VALID = 1,    /*!< VALID : Indicate select OTP Info0                                         */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Select MRAM Info0                                */
} MCUCTRL_SHADOWVALID_INFO0SELOTP_Enum;

/* ========================================  MCUCTRL SHADOWVALID INFO1SELOTP [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO1SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_VALID = 1,    /*!< VALID : Indicate selector OTP Info1                                       */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Indicate select MRAM Info1.                      */
} MCUCTRL_SHADOWVALID_INFO1SELOTP_Enum;

/* ===========================================  MCUCTRL SHADOWVALID VALID [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_VALID                                                 */
  MCUCTRL_SHADOWVALID_VALID_VALID      = 1,     /*!< VALID : Flash information space contains valid data.                      */
  MCUCTRL_SHADOWVALID_VALID_DEFAULT    = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_VALID_Enum;

/* =======================================================  SCRATCH0  ======================================================== */
/* =======================================================  SCRATCH1  ======================================================== */
/* =========================================================  DBGR1  ========================================================= */
/* =========================================================  DBGR2  ========================================================= */
/* ======================================================  WICCONTROL  ======================================================= */
/* ==========================================  MCUCTRL WICCONTROL DEEPISWIC [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_WICCONTROL_DEEPISWIC                                              */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_REGULAR_SLEEP = 0,/*!< SLEEPDEEP_IS_REGULAR_SLEEP : When de-asserted, SCR.SLEEPDEEP
                                                     is set and the processor core is in sleep, the processor
                                                     does not enter WIC sleep, and the processor must stay powered-up.         */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_WIC_SLEEP = 1,/*!< SLEEPDEEP_IS_WIC_SLEEP : When asserted, SCR.SLEEPDEEP is set
                                                     and the processor core is in sleep, the processor enters
                                                     WIC sleep and the clock and power can both be removed from
                                                     the processor.                                                            */
} MCUCTRL_WICCONTROL_DEEPISWIC_Enum;

/* ========================================================  DBGCTRL  ======================================================== */
/* =========================================  MCUCTRL DBGCTRL DBGTSCLKSEL [12..14]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTSCLKSEL                                               */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_LOWPWR   = 0,     /*!< LOWPWR : Low power state.                                                 */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV2 = 1,     /*!< HFRCDIV2 : Selects HFRC divided by 2 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV8 = 2,     /*!< HFRCDIV8 : Selects HFRC divided by 8 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV16 = 3,    /*!< HFRCDIV16 : Selects HFRC divided by 16 as the source dbg ts
                                                     clk                                                                       */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV32 = 4,    /*!< HFRCDIV32 : Selects HFRC divided by 32 as the source dbg ts
                                                     clk                                                                       */
} MCUCTRL_DBGCTRL_DBGTSCLKSEL_Enum;

/* ==========================================  MCUCTRL DBGCTRL DBGETBENABLE [8..8]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGETBENABLE                                              */
  MCUCTRL_DBGCTRL_DBGETBENABLE_DIS     = 0,     /*!< DIS : Disable ETB.                                                        */
  MCUCTRL_DBGCTRL_DBGETBENABLE_EN      = 1,     /*!< EN : Enable ETB.                                                          */
} MCUCTRL_DBGCTRL_DBGETBENABLE_Enum;

/* =========================================  MCUCTRL DBGCTRL DBGTPIUCLKSEL [1..3]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUCLKSEL                                             */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_OFF    = 0,     /*!< OFF : Low power state.                                                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_48MHz = 1, /*!< HFRC_48MHz : Selects HFRC 48Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_96MHz = 2, /*!< HFRC_96MHz : Selects HFRC 96Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_192MHz = 3,/*!< HFRC_192MHz : Selects HFRC 192Mhz as the source TPIU clk                  */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC2_125MHz = 4,/*!< HFRC2_125MHz : Selects HFRC2 125Mhz as the source TPIU clk.
                                                     Note that this setting requires CLKGEN.MISC.HFRC2 be enabled              */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC2_250MHz = 5,/*!< HFRC2_250MHz : Selects HFRC2 250Mhz as the source TPIU clk.
                                                     Note that this setting requires CLKGEN.MISC.HFRC2 be enabled              */
} MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Enum;

/* =======================================  MCUCTRL DBGCTRL DBGTPIUTRACEENABLE [0..0]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE                                        */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_DIS = 0,   /*!< DIS : Disable the TPIU TRACE.                                             */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_EN = 1,    /*!< EN : Enable the TPIU TRACE.                                               */
} MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Enum;

