AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ======================================================  OTAPOINTER  ======================================================= */
/* ======================================================  APBDMACTRL  ======================================================= */
/* =========================================  MCUCTRL APBDMACTRL DECODEABORT [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DECODEABORT                                            */
  MCUCTRL_APBDMACTRL_DECODEABORT_DISABLE = 0,   /*!< DISABLE : Bus operations to powered down peripherals are quietly
                                                     discarded                                                                 */
  MCUCTRL_APBDMACTRL_DECODEABORT_ENABLE = 1,    /*!< ENABLE : Bus operations to powered down peripherals result in
                                                     a bus fault.                                                              */
} MCUCTRL_APBDMACTRL_DECODEABORT_Enum;

/* ==========================================  MCUCTRL APBDMACTRL DMAENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DMAENABLE                                              */
  MCUCTRL_APBDMACTRL_DMAENABLE_DISABLE = 0,     /*!< DISABLE : DMA operations disabled                                         */
  MCUCTRL_APBDMACTRL_DMAENABLE_ENABLE  = 1,     /*!< ENABLE : DMA operations enabled                                           */
} MCUCTRL_APBDMACTRL_DMAENABLE_Enum;

/* =====================================================  FORCEAXICLKEN  ===================================================== */
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key value to unlock the register.                                   */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK0  ======================================================= */
/* =======================================================  SIMOBUCK1  ======================================================= */
/* ======================================  MCUCTRL SIMOBUCK1 SIMOBUCKHPTRIMEN [31..31]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN                                        */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_OFF = 0,/*!< SIMOBUCK_HP_OFF : Disable simobuck hp trim.                      */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_ON = 1,/*!< SIMOBUCK_HP_ON : Enable simobuck hp trim.                         */
} MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Enum;

/* =======================================  MCUCTRL SIMOBUCK1 SIMOBUCKOBSEN [30..30]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN                                           */
  MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_SIMO_DATA_OFF = 0,/*!< SIMO_DATA_OFF : Disable simobuck data output.                         */
  MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_SIMO_DATA_ON = 1,/*!< SIMO_DATA_ON : Enable simobuck data output.                            */
} MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Enum;

/* ==========================================  MCUCTRL SIMOBUCK1 BUCKMODE [29..29]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_BUCKMODE                                                */
  MCUCTRL_SIMOBUCK1_BUCKMODE_ZXCOMP    = 0,     /*!< ZXCOMP : Select default (ZXCOMP) sequence operating mode.                 */
  MCUCTRL_SIMOBUCK1_BUCKMODE_NOZXCOMP  = 1,     /*!< NOZXCOMP : Select backup sequence operating mode.                         */
} MCUCTRL_SIMOBUCK1_BUCKMODE_Enum;

/* ========================================  MCUCTRL SIMOBUCK1 FORCEBUCKOFF [28..28]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_FORCEBUCKOFF                                            */
  MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_VARIED_CYCLES = 0,/*!< VARIED_CYCLES : Stop point will vary depending on operating
                                                     mode.                                                                     */
  MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_TWO_CYCLE = 1, /*!< TWO_CYCLE : Stop exactly 1 TONCLK cycle before snubber asserts.           */
} MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Enum;

/* ========================================  MCUCTRL SIMOBUCK1 FORCETONCLKEN [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_FORCETONCLKEN                                           */
  MCUCTRL_SIMOBUCK1_FORCETONCLKEN_LP_TONCLK = 0,/*!< LP_TONCLK : TONCLK will be active only when needed.                       */
  MCUCTRL_SIMOBUCK1_FORCETONCLKEN_AON_TONCLK = 1,/*!< AON_TONCLK : TONCLK is always on.                                        */
} MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Enum;

/* =======================================================  SIMOBUCK2  ======================================================= */
/* =======================================================  SIMOBUCK3  ======================================================= */
/* =======================================================  SIMOBUCK4  ======================================================= */
/* =======================================================  SIMOBUCK5  ======================================================= */
/* =======================================================  SIMOBUCK6  ======================================================= */
/* =======================================================  SIMOBUCK7  ======================================================= */
/* =======================================================  SIMOBUCK8  ======================================================= */
/* =======================================================  SIMOBUCK9  ======================================================= */
/* ======================================================  SIMOBUCK10  ======================================================= */
/* ======================================================  SIMOBUCK11  ======================================================= */
/* ======================================================  SIMOBUCK12  ======================================================= */
/* ======================================================  SIMOBUCK13  ======================================================= */
/* ======================================================  SIMOBUCK14  ======================================================= */
/* ======================================================  SIMOBUCK15  ======================================================= */
/* ========================================================  PWRSW0  ========================================================= */
/* ======================================  MCUCTRL PWRSW0 PWRSWVDDRCPUSTATSEL [30..30]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL                                        */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDFLP = 1,/*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDS = 0,  /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Enum;

