AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =====================================================  MEMPWRSTATUS  ====================================================== */
/* =========================================  PWRCTRL MEMPWRSTATUS PWRSTTCM [0..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWRSTATUS_PWRSTTCM                                             */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_NONE   = 0,     /*!< NONE : Do not enable power to any DTCMs                                   */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM32K_DTCM128K = 1,/*!< ITCM32K_DTCM128K : Only lower 32k of ITCM and 128k of DTCM is
                                                     powered up                                                                */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM128K_DTCM256K = 3,/*!< ITCM128K_DTCM256K : Only lower 128k of ITCM and 256k of DTCM
                                                     is powered up                                                             */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM256K_DTCM512K = 7,/*!< ITCM256K_DTCM512K : All 256k of ITCM and 512k of DTCM is powered
                                                     up                                                                        */
} PWRCTRL_MEMPWRSTATUS_PWRSTTCM_Enum;

/* =======================================================  MEMRETCFG  ======================================================= */
/* ==========================================  PWRCTRL MEMRETCFG NVMPWDSLP [1..1]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_NVMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_EN       = 1,     /*!< EN : NVM is powered down during deepsleep                                 */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_DIS      = 0,     /*!< DIS : NVM is kept powered on during deepsleep                             */
} PWRCTRL_MEMRETCFG_NVMPWDSLP_Enum;

/* ==========================================  PWRCTRL MEMRETCFG TCMPWDSLP [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_TCMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_RETAIN   = 0,     /*!< RETAIN : All Enabled TCM retained.                                        */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_NORETAIN = 1,     /*!< NORETAIN : No TCM retained.                                               */
} PWRCTRL_MEMRETCFG_TCMPWDSLP_Enum;

/* =====================================================  SYSPWRSTATUS  ====================================================== */
/* ======================================================  SSRAMPWREN  ======================================================= */
/* =========================================  PWRCTRL SSRAMPWREN PWRENSSRAM [0..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_SSRAMPWREN_PWRENSSRAM                                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_NONE   = 0,     /*!< NONE : Do not power ON any of the SRAM banks                              */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP0 = 1,     /*!< GROUP0 : Power ON only SRAM0 group (lower 1M)                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP1 = 2,     /*!< GROUP1 : Power ON only SRAM1 group (middle 1M)                            */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP2 = 4,     /*!< GROUP2 : Power ON only SRAM2 group (upper 1M)                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_ALL    = 7,     /*!< ALL : All shared SRAM banks (SSRAM0 1M + SSRAM1 1M + SSRAM2
                                                     1M) powered ON                                                            */
} PWRCTRL_SSRAMPWREN_PWRENSSRAM_Enum;

/* ======================================================  SSRAMPWRST  ======================================================= */
/* ======================================================  SSRAMRETCFG  ====================================================== */
/* ========================================  PWRCTRL SSRAMRETCFG SSRAMPWDSLP [0..2]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP                                           */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_NONE = 0,     /*!< NONE : All banks retained                                                 */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP0 = 1,   /*!< GROUP0 : Power down only SRAM group0                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP1 = 2,   /*!< GROUP1 : Power down only SRAM group1                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP2 = 4,   /*!< GROUP2 : Power down only SRAM group2                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_ALL  = 7,     /*!< ALL : All shared SRAM banks powered down                                  */
} PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Enum;

/* =====================================================  DEVPWREVENTEN  ===================================================== */
/* ========================================  PWRCTRL DEVPWREVENTEN PDMEVEN [12..12]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_PDMEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_EN     = 1,     /*!< EN : Enable PDM power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_DIS    = 0,     /*!< DIS : Disable PDM power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_PDMEVEN_Enum;

/* =======================================  PWRCTRL DEVPWREVENTEN MSPI3EVEN [11..11]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPI3EVEN                                           */
  PWRCTRL_DEVPWREVENTEN_MSPI3EVEN_EN   = 1,     /*!< EN : Enable MSPI3 power-on status event                                   */
  PWRCTRL_DEVPWREVENTEN_MSPI3EVEN_DIS  = 0,     /*!< DIS : Disable MSPI3 power-on status event                                 */
} PWRCTRL_DEVPWREVENTEN_MSPI3EVEN_Enum;

/* =======================================  PWRCTRL DEVPWREVENTEN MSPI2EVEN [10..10]  ======================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPI2EVEN                                           */
  PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_EN   = 1,     /*!< EN : Enable MSPI2 power-on status event                                   */
  PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_DIS  = 0,     /*!< DIS : Disable MSPI2 power-on status event                                 */
} PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Enum;

/* ========================================  PWRCTRL DEVPWREVENTEN MSPI1EVEN [9..9]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPI1EVEN                                           */
  PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_EN   = 1,     /*!< EN : Enable MSPI1 power-on status event                                   */
  PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_DIS  = 0,     /*!< DIS : Disable MSPI1 power-on status event                                 */
} PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN MSPIEVEN [8..8]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_MSPIEVEN                                            */
  PWRCTRL_DEVPWREVENTEN_MSPIEVEN_EN    = 1,     /*!< EN : Enable MSPI power-on status event                                    */
  PWRCTRL_DEVPWREVENTEN_MSPIEVEN_DIS   = 0,     /*!< DIS : Disable MSPI power-on status event                                  */
} PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN AUDEVEN [7..7]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_AUDEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_AUDEVEN_EN     = 1,     /*!< EN : Enable AUD power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_AUDEVEN_DIS    = 0,     /*!< DIS : Disable AUD power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_AUDEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN ADCEVEN [5..5]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_ADCEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_ADCEVEN_EN     = 1,     /*!< EN : Enable ADC power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_ADCEVEN_DIS    = 0,     /*!< DIS : Disable ADC power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_ADCEVEN_Enum;

/* =========================================  PWRCTRL DEVPWREVENTEN HCPCEVEN [4..4]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_HCPCEVEN                                            */
  PWRCTRL_DEVPWREVENTEN_HCPCEVEN_EN    = 1,     /*!< EN : Enable HCPC power-on status event                                    */
  PWRCTRL_DEVPWREVENTEN_HCPCEVEN_DIS   = 0,     /*!< DIS : Disable HCPC power-on status event                                  */
} PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Enum;

