AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ===================================================  PWRCTRLMODESTATUS  =================================================== */
/* =====================================  PWRCTRL PWRCTRLMODESTATUS LEGACYMODEST [0..0]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST                                    */
  PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_LEGACY_MODE_ON = 1,/*!< LEGACY_MODE_ON : Power control works in legacy mode (As per
                                                     sleeping and sleepdeep signals from M55 Core)                             */
  PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_LEGACY_MODE_OFF = 0,/*!< LEGACY_MODE_OFF : Power control works according to P/Q channel
                                                     interface signals coming from PMU                                         */
} PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_Enum;

/* =====================================================  CPUPWRSTATUS  ====================================================== */
/* =======================================================  PWRACKOVR  ======================================================= */
/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI3 [25..25]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_Enum;

/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI2 [24..24]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Enum;

/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI1 [23..23]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1                                     */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                         */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMSPI [22..22]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEROM [21..21]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEMCUE [20..20]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEOTP [19..19]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_Enum;

