AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =======================================  SDIO0 HOSTCTRL1 DATATRANSFERWIDTH [1..1]  ======================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_DATATRANSFERWIDTH                                         */
  SDIO0_HOSTCTRL1_DATATRANSFERWIDTH_SD4 = 1,    /*!< SD4 : 4 bit mode                                                          */
  SDIO0_HOSTCTRL1_DATATRANSFERWIDTH_SD1 = 0,    /*!< SD1 : 1 bit mode                                                          */
} SDIO0_HOSTCTRL1_DATATRANSFERWIDTH_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 LEDCONTROL [0..0]  =========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_LEDCONTROL                                                */
  SDIO0_HOSTCTRL1_LEDCONTROL_ON        = 1,     /*!< ON : LED on                                                               */
  SDIO0_HOSTCTRL1_LEDCONTROL_OFF       = 0,     /*!< OFF : LED off                                                             */
} SDIO0_HOSTCTRL1_LEDCONTROL_Enum;

/* =======================================================  CLOCKCTRL  ======================================================= */
/* ===========================================  SDIO0 CLOCKCTRL SWRSTDAT [26..26]  =========================================== */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_SWRSTDAT                                                  */
  SDIO0_CLOCKCTRL_SWRSTDAT_RESET       = 1,     /*!< RESET : Reset                                                             */
  SDIO0_CLOCKCTRL_SWRSTDAT_WORK        = 0,     /*!< WORK : Work                                                               */
} SDIO0_CLOCKCTRL_SWRSTDAT_Enum;

/* ===========================================  SDIO0 CLOCKCTRL SWRSTCMD [25..25]  =========================================== */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_SWRSTCMD                                                  */
  SDIO0_CLOCKCTRL_SWRSTCMD_RESET       = 1,     /*!< RESET : Reset                                                             */
  SDIO0_CLOCKCTRL_SWRSTCMD_WORK        = 0,     /*!< WORK : Work                                                               */
} SDIO0_CLOCKCTRL_SWRSTCMD_Enum;

/* ===========================================  SDIO0 CLOCKCTRL SWRSTALL [24..24]  =========================================== */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_SWRSTALL                                                  */
  SDIO0_CLOCKCTRL_SWRSTALL_RESET       = 1,     /*!< RESET : Reset                                                             */
  SDIO0_CLOCKCTRL_SWRSTALL_WORK        = 0,     /*!< WORK : Work                                                               */
} SDIO0_CLOCKCTRL_SWRSTALL_Enum;

/* ==========================================  SDIO0 CLOCKCTRL TIMEOUTCNT [16..19]  ========================================== */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_TIMEOUTCNT                                                */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_27        = 14,    /*!< 27 : TMCLK * 2^27                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_26        = 13,    /*!< 26 : TMCLK * 2^26                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_25        = 12,    /*!< 25 : TMCLK * 2^25                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_24        = 11,    /*!< 24 : TMCLK * 2^24                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_23        = 10,    /*!< 23 : TMCLK * 2^23                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_22        = 9,     /*!< 22 : TMCLK * 2^22                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_21        = 8,     /*!< 21 : TMCLK * 2^21                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_20        = 7,     /*!< 20 : TMCLK * 2^20                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_19        = 6,     /*!< 19 : TMCLK * 2^19                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_18        = 5,     /*!< 18 : TMCLK * 2^18                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_17        = 4,     /*!< 17 : TMCLK * 2^17                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_16        = 3,     /*!< 16 : TMCLK * 2^16                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_15        = 2,     /*!< 15 : TMCLK * 2^15                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_14        = 1,     /*!< 14 : TMCLK * 2^14                                                         */
  SDIO0_CLOCKCTRL_TIMEOUTCNT_13        = 0,     /*!< 13 : TMCLK * 2^13                                                         */
} SDIO0_CLOCKCTRL_TIMEOUTCNT_Enum;

/* ============================================  SDIO0 CLOCKCTRL FREQSEL [8..15]  ============================================ */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_FREQSEL                                                   */
  SDIO0_CLOCKCTRL_FREQSEL_DIV256       = 128,   /*!< DIV256 : base clock divided by 256                                        */
  SDIO0_CLOCKCTRL_FREQSEL_DIV128       = 64,    /*!< DIV128 : base clock divided by 128                                        */
  SDIO0_CLOCKCTRL_FREQSEL_DIV64        = 32,    /*!< DIV64 : base clock divided by 64                                          */
  SDIO0_CLOCKCTRL_FREQSEL_DIV32        = 16,    /*!< DIV32 : base clock divided by 32                                          */
  SDIO0_CLOCKCTRL_FREQSEL_DIV16        = 8,     /*!< DIV16 : base clock divided by 16                                          */
  SDIO0_CLOCKCTRL_FREQSEL_DIV8         = 4,     /*!< DIV8 : base clock divided by 8                                            */
  SDIO0_CLOCKCTRL_FREQSEL_DIV4         = 2,     /*!< DIV4 : base clock divided by 4                                            */
  SDIO0_CLOCKCTRL_FREQSEL_DIV2         = 1,     /*!< DIV2 : base clock divided by 2                                            */
  SDIO0_CLOCKCTRL_FREQSEL_BASECLK      = 0,     /*!< BASECLK : Base clock (10MHz - 63MHz)                                      */
} SDIO0_CLOCKCTRL_FREQSEL_Enum;

/* ===========================================  SDIO0 CLOCKCTRL CLKGENSEL [5..5]  ============================================ */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_CLKGENSEL                                                 */
  SDIO0_CLOCKCTRL_CLKGENSEL_PROGCLK    = 1,     /*!< PROGCLK : Programmable Clock Mode                                         */
  SDIO0_CLOCKCTRL_CLKGENSEL_DIVCLK     = 0,     /*!< DIVCLK : Divided Clock Mode                                               */
} SDIO0_CLOCKCTRL_CLKGENSEL_Enum;

/* ============================================  SDIO0 CLOCKCTRL SDCLKEN [2..2]  ============================================= */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_SDCLKEN                                                   */
  SDIO0_CLOCKCTRL_SDCLKEN_ENABLE       = 1,     /*!< ENABLE : Enable                                                           */
  SDIO0_CLOCKCTRL_SDCLKEN_DISABLE      = 0,     /*!< DISABLE : Disable                                                         */
} SDIO0_CLOCKCTRL_SDCLKEN_Enum;

/* ===========================================  SDIO0 CLOCKCTRL CLKSTABLE [1..1]  ============================================ */
typedef enum {                                  /*!< SDIO0_CLOCKCTRL_CLKSTABLE                                                 */
  SDIO0_CLOCKCTRL_CLKSTABLE_READY      = 1,     /*!< READY : Ready                                                             */
  SDIO0_CLOCKCTRL_CLKSTABLE_NOTREADY   = 0,     /*!< NOTREADY : Not Ready                                                      */
} SDIO0_CLOCKCTRL_CLKSTABLE_Enum;

