AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =========================================  SDIO0 INTSIG AUTOCMD12ERREN [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_AUTOCMD12ERREN                                               */
  SDIO0_INTSIG_AUTOCMD12ERREN_MASKED   = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_AUTOCMD12ERREN_ENABLED  = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_AUTOCMD12ERREN_Enum;

/* ==========================================  SDIO0 INTSIG CURRLMTERREN [23..23]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CURRLMTERREN                                                 */
  SDIO0_INTSIG_CURRLMTERREN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CURRLMTERREN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CURRLMTERREN_Enum;

/* ==========================================  SDIO0 INTSIG DATAENDERREN [22..22]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_DATAENDERREN                                                 */
  SDIO0_INTSIG_DATAENDERREN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_DATAENDERREN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_DATAENDERREN_Enum;

/* ==========================================  SDIO0 INTSIG DATACRCERREN [21..21]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_DATACRCERREN                                                 */
  SDIO0_INTSIG_DATACRCERREN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_DATACRCERREN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_DATACRCERREN_Enum;

/* ==========================================  SDIO0 INTSIG DATATOERROREN [20..20]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_DATATOERROREN                                                */
  SDIO0_INTSIG_DATATOERROREN_MASKED    = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_DATATOERROREN_ENABLED   = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_DATATOERROREN_Enum;

/* ===========================================  SDIO0 INTSIG CMDIDXERREN [19..19]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CMDIDXERREN                                                  */
  SDIO0_INTSIG_CMDIDXERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CMDIDXERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CMDIDXERREN_Enum;

/* =========================================  SDIO0 INTSIG CMDENDBITERREN [18..18]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CMDENDBITERREN                                               */
  SDIO0_INTSIG_CMDENDBITERREN_MASKED   = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CMDENDBITERREN_ENABLED  = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CMDENDBITERREN_Enum;

/* ===========================================  SDIO0 INTSIG CMDCRCERREN [17..17]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CMDCRCERREN                                                  */
  SDIO0_INTSIG_CMDCRCERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CMDCRCERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CMDCRCERREN_Enum;

/* ===========================================  SDIO0 INTSIG CMDTOERREN [16..16]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSIG_CMDTOERREN                                                   */
  SDIO0_INTSIG_CMDTOERREN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CMDTOERREN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CMDTOERREN_Enum;

/* =============================================  SDIO0 INTSIG FIXED0 [15..15]  ============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_FIXED0                                                       */
  SDIO0_INTSIG_FIXED0_MASKED           = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_FIXED0_ENABLED          = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_FIXED0_Enum;

/* ============================================  SDIO0 INTSIG BOOTTERM [14..14]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_BOOTTERM                                                     */
  SDIO0_INTSIG_BOOTTERM_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_BOOTTERM_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_BOOTTERM_Enum;

/* ============================================  SDIO0 INTSIG BOOTACKEN [13..13]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSIG_BOOTACKEN                                                    */
  SDIO0_INTSIG_BOOTACKEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_BOOTACKEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_BOOTACKEN_Enum;

/* ==========================================  SDIO0 INTSIG RETUNEEVENTEN [12..12]  ========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_RETUNEEVENTEN                                                */
  SDIO0_INTSIG_RETUNEEVENTEN_MASKED    = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_RETUNEEVENTEN_ENABLED   = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_RETUNEEVENTEN_Enum;

/* =============================================  SDIO0 INTSIG INTCEN [11..11]  ============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_INTCEN                                                       */
  SDIO0_INTSIG_INTCEN_MASKED           = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_INTCEN_ENABLED          = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_INTCEN_Enum;

