AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ===========================================  SDIO0 FORCE FORCEACMD12NOT [0..0]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMD12NOT                                                */
  SDIO0_FORCE_FORCEACMD12NOT_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMD12NOT_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMD12NOT_Enum;

/* =========================================================  ADMA  ========================================================== */
/* =========================================  SDIO0 ADMA ADMALENMISMATCHERR [2..2]  ========================================== */
typedef enum {                                  /*!< SDIO0_ADMA_ADMALENMISMATCHERR                                             */
  SDIO0_ADMA_ADMALENMISMATCHERR_ERROR  = 1,     /*!< ERROR : Error                                                             */
  SDIO0_ADMA_ADMALENMISMATCHERR_NOERROR = 0,    /*!< NOERROR : No error                                                        */
} SDIO0_ADMA_ADMALENMISMATCHERR_Enum;

/* ===========================================  SDIO0 ADMA ADMAERRORSTATE [0..1]  ============================================ */
typedef enum {                                  /*!< SDIO0_ADMA_ADMAERRORSTATE                                                 */
  SDIO0_ADMA_ADMAERRORSTATE_STDMA      = 0,     /*!< STDMA : ST_STOP (Stop DMA) Points to next of the error descriptor         */
  SDIO0_ADMA_ADMAERRORSTATE_FETCHDESC  = 1,     /*!< FETCHDESC : ST_FDS (Fetch Descriptor) Points to the error descriptor      */
  SDIO0_ADMA_ADMAERRORSTATE_INVALID    = 2,     /*!< INVALID : Never set this state (Not used)                                 */
  SDIO0_ADMA_ADMAERRORSTATE_XFERDATA   = 3,     /*!< XFERDATA : ST_TFR (Transfer Data) Points to the next of the
                                                     error descriptor                                                          */
} SDIO0_ADMA_ADMAERRORSTATE_Enum;

/* =======================================================  ADMALOWD  ======================================================== */
/* =======================================================  ADMAHIWD  ======================================================== */
/* ========================================================  PRESET0  ======================================================== */
/* ========================================  SDIO0 PRESET0 DEFSPDRVRSTRSEL [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET0_DEFSPDRVRSTRSEL                                             */
  SDIO0_PRESET0_DEFSPDRVRSTRSEL_TYPED  = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET0_DEFSPDRVRSTRSEL_TYPEC  = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET0_DEFSPDRVRSTRSEL_TYPEA  = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET0_DEFSPDRVRSTRSEL_TYPEB  = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET0_DEFSPDRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET0 DEFSPCLKGENSEL [26..26]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET0_DEFSPCLKGENSEL                                              */
  SDIO0_PRESET0_DEFSPCLKGENSEL_PROGCLK = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET0_DEFSPCLKGENSEL_HOSTCTLR = 0,    /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET0_DEFSPCLKGENSEL_Enum;

/* =========================================  SDIO0 PRESET0 HISPDRVRSTRSEL [14..15]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET0_HISPDRVRSTRSEL                                              */
  SDIO0_PRESET0_HISPDRVRSTRSEL_TYPED   = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET0_HISPDRVRSTRSEL_TYPEC   = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET0_HISPDRVRSTRSEL_TYPEA   = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET0_HISPDRVRSTRSEL_TYPEB   = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET0_HISPDRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET0 HISPCLKGENSEL [10..10]  ========================================== */
typedef enum {                                  /*!< SDIO0_PRESET0_HISPCLKGENSEL                                               */
  SDIO0_PRESET0_HISPCLKGENSEL_PROGCLK  = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET0_HISPCLKGENSEL_HOSTCTLR = 0,     /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET0_HISPCLKGENSEL_Enum;

/* ========================================================  PRESET1  ======================================================== */
/* ========================================  SDIO0 PRESET1 SDR12DRVRSTRSEL [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET1_SDR12DRVRSTRSEL                                             */
  SDIO0_PRESET1_SDR12DRVRSTRSEL_TYPED  = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET1_SDR12DRVRSTRSEL_TYPEC  = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET1_SDR12DRVRSTRSEL_TYPEA  = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET1_SDR12DRVRSTRSEL_TYPEB  = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET1_SDR12DRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET1 SDR12CLKGENSEL [26..26]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET1_SDR12CLKGENSEL                                              */
  SDIO0_PRESET1_SDR12CLKGENSEL_PROGCLK = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET1_SDR12CLKGENSEL_HOSTCTLR = 0,    /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET1_SDR12CLKGENSEL_Enum;

/* ==========================================  SDIO0 PRESET1 HSDRVRSTRSEL [14..15]  ========================================== */
typedef enum {                                  /*!< SDIO0_PRESET1_HSDRVRSTRSEL                                                */
  SDIO0_PRESET1_HSDRVRSTRSEL_TYPED     = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET1_HSDRVRSTRSEL_TYPEC     = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET1_HSDRVRSTRSEL_TYPEA     = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET1_HSDRVRSTRSEL_TYPEB     = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET1_HSDRVRSTRSEL_Enum;

/* ==========================================  SDIO0 PRESET1 HSCLKGENSEL [10..10]  =========================================== */
typedef enum {                                  /*!< SDIO0_PRESET1_HSCLKGENSEL                                                 */
  SDIO0_PRESET1_HSCLKGENSEL_PROGCLK    = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET1_HSCLKGENSEL_HOSTCTLR   = 0,     /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET1_HSCLKGENSEL_Enum;

/* ========================================================  PRESET2  ======================================================== */
/* ========================================  SDIO0 PRESET2 SDR50DRVRSTRSEL [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET2_SDR50DRVRSTRSEL                                             */
  SDIO0_PRESET2_SDR50DRVRSTRSEL_TYPED  = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET2_SDR50DRVRSTRSEL_TYPEC  = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET2_SDR50DRVRSTRSEL_TYPEA  = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET2_SDR50DRVRSTRSEL_TYPEB  = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET2_SDR50DRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET2 SDR50CLKGENSEL [26..26]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET2_SDR50CLKGENSEL                                              */
  SDIO0_PRESET2_SDR50CLKGENSEL_PROGCLK = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET2_SDR50CLKGENSEL_HOSTCTLR = 0,    /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET2_SDR50CLKGENSEL_Enum;

/* ========================================  SDIO0 PRESET2 SDR25DRVRSTRSEL [14..15]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET2_SDR25DRVRSTRSEL                                             */
  SDIO0_PRESET2_SDR25DRVRSTRSEL_TYPED  = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET2_SDR25DRVRSTRSEL_TYPEC  = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET2_SDR25DRVRSTRSEL_TYPEA  = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET2_SDR25DRVRSTRSEL_TYPEB  = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET2_SDR25DRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET2 SDR25CLKGENSEL [10..10]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET2_SDR25CLKGENSEL                                              */
  SDIO0_PRESET2_SDR25CLKGENSEL_PROGCLK = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET2_SDR25CLKGENSEL_HOSTCTLR = 0,    /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET2_SDR25CLKGENSEL_Enum;

/* ========================================================  PRESET3  ======================================================== */
/* ========================================  SDIO0 PRESET3 DDR50DRVRSTRSEL [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET3_DDR50DRVRSTRSEL                                             */
  SDIO0_PRESET3_DDR50DRVRSTRSEL_TYPED  = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET3_DDR50DRVRSTRSEL_TYPEC  = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET3_DDR50DRVRSTRSEL_TYPEA  = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET3_DDR50DRVRSTRSEL_TYPEB  = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET3_DDR50DRVRSTRSEL_Enum;

/* =========================================  SDIO0 PRESET3 DDR50CLKGENSEL [26..26]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET3_DDR50CLKGENSEL                                              */
  SDIO0_PRESET3_DDR50CLKGENSEL_PROGCLK = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET3_DDR50CLKGENSEL_HOSTCTLR = 0,    /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET3_DDR50CLKGENSEL_Enum;

/* ========================================  SDIO0 PRESET3 SDR104DRVRSTRSEL [14..15]  ======================================== */
typedef enum {                                  /*!< SDIO0_PRESET3_SDR104DRVRSTRSEL                                            */
  SDIO0_PRESET3_SDR104DRVRSTRSEL_TYPED = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO0_PRESET3_SDR104DRVRSTRSEL_TYPEC = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO0_PRESET3_SDR104DRVRSTRSEL_TYPEA = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO0_PRESET3_SDR104DRVRSTRSEL_TYPEB = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO0_PRESET3_SDR104DRVRSTRSEL_Enum;

/* ========================================  SDIO0 PRESET3 SDR104CLKGENSEL [10..10]  ========================================= */
typedef enum {                                  /*!< SDIO0_PRESET3_SDR104CLKGENSEL                                             */
  SDIO0_PRESET3_SDR104CLKGENSEL_PROGCLK = 1,    /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO0_PRESET3_SDR104CLKGENSEL_HOSTCTLR = 0,   /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO0_PRESET3_SDR104CLKGENSEL_Enum;

/* ======================================================  BOOTTOCTRL  ======================================================= */
/* ========================================================  VENDOR  ========================================================= */
/* ==============================================  SDIO0 VENDOR DLYDIS [1..1]  =============================================== */
typedef enum {                                  /*!< SDIO0_VENDOR_DLYDIS                                                       */
  SDIO0_VENDOR_DLYDIS_DISABLE          = 1,     /*!< DISABLE : Disable the rtl fix made to delay the sampling of
                                                     cmd_in and data_in                                                        */
  SDIO0_VENDOR_DLYDIS_ENABLE           = 0,     /*!< ENABLE : Enable the rtl fix made to delay the sampling of cmd_in
                                                     and data_in                                                               */
} SDIO0_VENDOR_DLYDIS_Enum;

