AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* ==================================================  UART0 FR DSR [1..1]  ================================================== */
typedef enum {                                  /*!< UART0_FR_DSR                                                              */
  UART0_FR_DSR_READY                   = 1,     /*!< READY : Data set ready.                                                   */
  UART0_FR_DSR_NOTREADY                = 0,     /*!< NOTREADY : Data set not ready/default.                                    */
} UART0_FR_DSR_Enum;

/* ==================================================  UART0 FR CTS [0..0]  ================================================== */
typedef enum {                                  /*!< UART0_FR_CTS                                                              */
  UART0_FR_CTS_CLEARTOSEND             = 1,     /*!< CLEARTOSEND : Clear to send is indicated.                                 */
  UART0_FR_CTS_DEFAULT                 = 0,     /*!< DEFAULT : Clear to send default value.                                    */
} UART0_FR_CTS_Enum;

/* =========================================================  ILPR  ========================================================== */
/* =========================================================  IBRD  ========================================================== */
/* =========================================================  FBRD  ========================================================== */
/* =========================================================  LCRH  ========================================================== */
/* ==========================================================  CR  =========================================================== */
/* ================================================  UART0 CR CLKSEL [4..6]  ================================================= */
typedef enum {                                  /*!< UART0_CR_CLKSEL                                                           */
  UART0_CR_CLKSEL_OFF                  = 0,     /*!< OFF : No UART clock. This is the low power default                        */
  UART0_CR_CLKSEL_HFRC_24MHZ           = 1,     /*!< HFRC_24MHZ : 24 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_HFRC_12MHZ           = 2,     /*!< HFRC_12MHZ : 12 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_HFRC_6MHZ            = 3,     /*!< HFRC_6MHZ : 6 MHz sourced from the HFRC                                   */
  UART0_CR_CLKSEL_HFRC_3MHZ            = 4,     /*!< HFRC_3MHZ : 3 MHz sourced from the HFRC                                   */
  UART0_CR_CLKSEL_HFRC_48MHZ           = 5,     /*!< HFRC_48MHZ : 48 MHz sourced from the HFRC                                 */
  UART0_CR_CLKSEL_PLL_CLK              = 6,     /*!< PLL_CLK : Sourced from the PLL                                            */
} UART0_CR_CLKSEL_Enum;

/* =========================================================  IFLS  ========================================================== */
/* ==========================================================  IER  ========================================================== */
/* ==========================================================  IES  ========================================================== */
/* ==========================================================  MIS  ========================================================== */
/* ==========================================================  IEC  ========================================================== */
/* ==========================================================  DCR  ========================================================== */
/* ================================================  UART0 DCR DMAPRI [3..3]  ================================================ */
typedef enum {                                  /*!< UART0_DCR_DMAPRI                                                          */
  UART0_DCR_DMAPRI_LOW                 = 0,     /*!< LOW : Low Priority (service as best effort).                              */
  UART0_DCR_DMAPRI_HIGH                = 1,     /*!< HIGH : High Priority (service immediately).                               */
} UART0_DCR_DMAPRI_Enum;

/* =======================================================  TARGADDR  ======================================================== */
/* =========================================================  COUNT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  REG00  ========================================================= */
/* =========================================================  REG04  ========================================================= */
/* =========================================================  REG08  ========================================================= */
/* =========================================================  REG0C  ========================================================= */
/* =========================================================  REG10  ========================================================= */
/* =========================================================  REG14  ========================================================= */
/* ===============================================  USBPHY REG14 BF55 [5..5]  ================================================ */
typedef enum {                                  /*!< USBPHY_REG14_BF55                                                         */
  USBPHY_REG14_BF55_DIV40              = 0,     /*!< DIV40 : PLL feedback clock divided by 40.                                 */
  USBPHY_REG14_BF55_DIV20              = 1,     /*!< DIV20 : PLL feedback clock divided by 20.                                 */
} USBPHY_REG14_BF55_Enum;

