AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/CMSIS/AmbiqMicro/Include/apollo5b.h
/* =========================================================  CFG1  ========================================================== */
/* =============================================  USB CFG1 EP5InIntEn [21..21]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP5InIntEn                                                       */
  USB_CFG1_EP5InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP5InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP5InIntEn_Enum;

/* =============================================  USB CFG1 EP4InIntEn [20..20]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP4InIntEn                                                       */
  USB_CFG1_EP4InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP4InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP4InIntEn_Enum;

/* =============================================  USB CFG1 EP3InIntEn [19..19]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP3InIntEn                                                       */
  USB_CFG1_EP3InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP3InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP3InIntEn_Enum;

/* =============================================  USB CFG1 EP2InIntEn [18..18]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP2InIntEn                                                       */
  USB_CFG1_EP2InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP2InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP2InIntEn_Enum;

/* =============================================  USB CFG1 EP1InIntEn [17..17]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP1InIntEn                                                       */
  USB_CFG1_EP1InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP1InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP1InIntEn_Enum;

/* =============================================  USB CFG1 EP0InIntEn [16..16]  ============================================== */
typedef enum {                                  /*!< USB_CFG1_EP0InIntEn                                                       */
  USB_CFG1_EP0InIntEn_DIS              = 0,     /*!< DIS : IN Endpoint interrupt disabled.                                     */
  USB_CFG1_EP0InIntEn_EN               = 1,     /*!< EN : IN Endpoint interrupt enabled.                                       */
} USB_CFG1_EP0InIntEn_Enum;

/* =============================================  USB CFG1 EP5OutIntStat [5..5]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP5OutIntStat                                                    */
  USB_CFG1_EP5OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP5OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP5OutIntStat_Enum;

/* =============================================  USB CFG1 EP4OutIntStat [4..4]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP4OutIntStat                                                    */
  USB_CFG1_EP4OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP4OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP4OutIntStat_Enum;

/* =============================================  USB CFG1 EP3OutIntStat [3..3]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP3OutIntStat                                                    */
  USB_CFG1_EP3OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP3OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP3OutIntStat_Enum;

/* =============================================  USB CFG1 EP2OutIntStat [2..2]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP2OutIntStat                                                    */
  USB_CFG1_EP2OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP2OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP2OutIntStat_Enum;

/* =============================================  USB CFG1 EP1OutIntStat [1..1]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP1OutIntStat                                                    */
  USB_CFG1_EP1OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP1OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP1OutIntStat_Enum;

/* =============================================  USB CFG1 EP0OutIntStat [0..0]  ============================================= */
typedef enum {                                  /*!< USB_CFG1_EP0OutIntStat                                                    */
  USB_CFG1_EP0OutIntStat_INACTIVE      = 0,     /*!< INACTIVE : Interrupt inactive.                                            */
  USB_CFG1_EP0OutIntStat_ACTIVE        = 1,     /*!< ACTIVE : Interrupt active.                                                */
} USB_CFG1_EP0OutIntStat_Enum;

/* =========================================================  CFG2  ========================================================== */
/* ================================================  USB CFG2 SOFE [27..27]  ================================================= */
typedef enum {                                  /*!< USB_CFG2_SOFE                                                             */
  USB_CFG2_SOFE_DIS                    = 0,     /*!< DIS : SOF interrupt disable.                                              */
  USB_CFG2_SOFE_EN                     = 1,     /*!< EN : SOF interrupt enable.                                                */
} USB_CFG2_SOFE_Enum;

/* ===============================================  USB CFG2 ResetE [26..26]  ================================================ */
typedef enum {                                  /*!< USB_CFG2_ResetE                                                           */
  USB_CFG2_ResetE_DIS                  = 0,     /*!< DIS : Reset detect interrupt disable.                                     */
  USB_CFG2_ResetE_EN                   = 1,     /*!< EN : Reset detect interrupt enable.                                       */
} USB_CFG2_ResetE_Enum;

/* ===============================================  USB CFG2 ResumeE [25..25]  =============================================== */
typedef enum {                                  /*!< USB_CFG2_ResumeE                                                          */
  USB_CFG2_ResumeE_DIS                 = 0,     /*!< DIS : Resume interrupt disable.                                           */
  USB_CFG2_ResumeE_EN                  = 1,     /*!< EN : Resume interrupt enable.                                             */
} USB_CFG2_ResumeE_Enum;

/* ==============================================  USB CFG2 SuspendE [24..24]  =============================================== */
typedef enum {                                  /*!< USB_CFG2_SuspendE                                                         */
  USB_CFG2_SuspendE_DIS                = 0,     /*!< DIS : Suspend interrupt disable.                                          */
  USB_CFG2_SuspendE_EN                 = 1,     /*!< EN : Suspend interrupt enable.                                            */
} USB_CFG2_SuspendE_Enum;

/* =================================================  USB CFG2 SOF [19..19]  ================================================= */
typedef enum {                                  /*!< USB_CFG2_SOF                                                              */
  USB_CFG2_SOF_SOF_INACTIVE            = 0,     /*!< SOF_INACTIVE : SOF interrupt inactive.                                    */
  USB_CFG2_SOF_SOF_ACTIVE              = 1,     /*!< SOF_ACTIVE : SOF interrupt active.                                        */
} USB_CFG2_SOF_Enum;

/* ================================================  USB CFG2 Reset [18..18]  ================================================ */
typedef enum {                                  /*!< USB_CFG2_Reset                                                            */
  USB_CFG2_Reset_RESET_INACTIVE        = 0,     /*!< RESET_INACTIVE : Reset Detect interrupt inactive.                         */
  USB_CFG2_Reset_RESET_ACTIVE          = 1,     /*!< RESET_ACTIVE : Reset Detect interrupt active.                             */
} USB_CFG2_Reset_Enum;

/* ===============================================  USB CFG2 Resume [17..17]  ================================================ */
typedef enum {                                  /*!< USB_CFG2_Resume                                                           */
  USB_CFG2_Resume_RESUME_INACTIVE      = 0,     /*!< RESUME_INACTIVE : Resume interrupt inactive.                              */
  USB_CFG2_Resume_RESUME_ACTIVE        = 1,     /*!< RESUME_ACTIVE : Resume interrupt active.                                  */
} USB_CFG2_Resume_Enum;

/* ===============================================  USB CFG2 Suspend [16..16]  =============================================== */
typedef enum {                                  /*!< USB_CFG2_Suspend                                                          */
  USB_CFG2_Suspend_SUSPEND_INACTIVE    = 0,     /*!< SUSPEND_INACTIVE : Suspend interrupt inactive.                            */
  USB_CFG2_Suspend_SUSPEND_ACTIVE      = 1,     /*!< SUSPEND_ACTIVE : Suspend interrupt active.                                */
} USB_CFG2_Suspend_Enum;

